{
    "http://arxiv.org/abs/2411.09566v1": {
        "summary": "**Summary of \"New orbital periods of high-inclination dwarf novae based on Gaia Alerts photometry\" by Sáez-Carvajal et al.**\n\n**1. Main objective and motivation:**\n\nThe paper aims to determine new orbital periods and refine existing ones for high-inclination dwarf novae (DNe), a type of cataclysmic variable (CV) binary system.  Accurate orbital periods are crucial for understanding the structure, physics, and evolution of these systems, particularly regarding the elusive \"period gap\" where systems with periods around 2-3 hours are underrepresented. The study leverages high-quality but often sparse Gaia Alerts photometry to address this gap in the existing data.\n\n**2. Key methods and approaches:**\n\nThe authors utilize two approaches to select high-inclination targets: identifying systems exhibiting eclipses or ellipsoidal variations in their light curves.  They employ the following methods:\n\n* **Eclipse Timing:**  A code is developed to systematically search for potential orbital periods based on observed eclipse times.  The method minimizes the sum of absolute differences between calculated and expected cycle numbers for successive eclipses, yielding the most likely period.\n* **Lomb-Scargle Periodogram:**  Applied to identify a first approximation of the orbital period, overcoming the limitations of irregular Gaia data.  A visual inspection of phase-folded light curves near the detected peak period is used for precise period determination.\n* **Ephemeris Determination:**  A linear least-squares fit is employed to determine precise ephemerides (orbital period and epoch) based on the collected eclipse times, improving on existing values or establishing new ones.\n\nThe analysis focuses on Gaia Alerts photometry data, specifically g-band data from the VSX catalogue, selecting quiescent state observations to avoid outburst artifacts.  A magnitude limit of g > 21 and a minimum of ~40 quiescent observations are applied to ensure data reliability.\n\n**3. Principal findings and results:**\n\nThe study successfully determined orbital periods for 75 DNe previously unknown and refined or modified ephemerides for 27 additional systems.  This constitutes a significant contribution to the existing dataset, especially for longer periods (> 0.44 days), effectively doubling the number of known periods in that range.\n\n* **Period Distribution:**  The study confirms the existence of a period gap around 2-3 hours, but also shows that the transition from systems dominated by accretion disc/hotspot emission to those dominated by ellipsoidal variations from the secondary star is not abrupt. The authors highlight the presence of ellipsoidal variations even at orbital periods where the secondary star is expected to be a cool, faint M-dwarf, indicating possible evolutionary histories of significantly evolved donor stars before mass transfer.\n\n* **Phase-folded Light Curves:** A comprehensive collection of 117 phased-folded light curves are presented, showcasing the diverse behavior of DNe in quiescence across the period range.  The light curves clearly delineate the transition from orbital humps (shorter periods) to double-hump patterns indicative of ellipsoidal variations (longer periods). Strikingly, some relatively short-period systems show the double-hump feature, challenging the predicted behavior of the secondary star in such cases.\n\n* **Contribution to VSX Data:** The newly determined and refined periods represent a 9.4% increase in the total population of DNe with known periods and significantly improve the population of long-period systems, highlighting the importance of the study.\n\n**4. Significance and implications:**\n\nThe study provides valuable insights into the orbital period distribution of DNe and the nature of their secondary stars, including potential evolutionary implications for systems near the period gap.\n\n* **Period Gap Characterization:** The results are crucial in understanding the behavior of CVs during and around the period gap, helping to refine existing models. The observed prevalence of ellipsoidal variations at short periods hints at the importance of donor evolution, potentially challenging the standard \"disrupted magnetic braking\" model.\n\n* **Expanded Dataset:**  The significantly expanded database of DNe orbital periods greatly enhances our understanding of CV evolution and mass-transfer processes. This refined dataset will be valuable for future studies investigating the relationship between orbital periods, mass-transfer rates, and physical properties within CV binaries.  The additional tables of data are particularly significant for supporting further analysis.\n\n* **Gaia's Potential:** The study validates the use of Gaia Alerts data for determining orbital periods of DNe, showing that even sparse, irregularly distributed data can yield valuable results with careful analysis and the proper methodology, particularly for objects with longer orbital periods.\n",
        "insights": "This paper determines new orbital periods for 75 dwarf novae and refines existing ones for 27 more using Gaia Alerts photometry, significantly increasing the known orbital period data for these cataclysmic variable stars, especially those with longer periods.\n\n**Key Insights and Lessons Learned:**\n\n* **Gaia data useful for orbital period determination:**  Even with gaps and uneven time distributions, high-quality Gaia photometry can accurately determine orbital periods, especially for systems with longer orbital periods.\n* **Importance of high-inclination systems:**  Eclipsing and ellipsoidal variations provide crucial information for determining orbital inclination, allowing for more complete characterization of binary systems.\n* **Transition in light curve characteristics:**  A transition in light curve characteristics is observed around the period gap, with a shift from systems dominated by accretion disc and hot spot to systems where the Roche-lobe-filling secondary star dominates the visual flux.  This transition is not abrupt; a mixture of types is observed around the period gap.\n* **Evolved donors near the period gap:**  The presence of ellipsoidal variations in systems near the period gap suggests that the donor stars in these systems may have already evolved significantly, potentially being helium-rich stars.\n* **Ground-based photometry limitations:** Ground-based observations may be less effective for determining the orbital periods of long-period systems, contributing to the paucity of known periods in that range.\n\n\n**Questions for the Authors:**\n\n1.  Given the observed mixture of light curve types around the period gap, can you elaborate on the potential mechanisms that could cause this variability?\n2.  Could you discuss the limitations of using Gaia data for determining orbital periods, particularly in the context of the quality and quantity of observations?\n3.  What are the implications of the observed helium-rich donor stars near the period gap for our understanding of cataclysmic variable evolution?\n4.  Can you comment on the potential biases in the current VSX catalog concerning the distribution of known orbital periods, especially for long periods, that might affect the interpretation of your findings?\n5. What are the next steps in determining the evolutionary pathways of the systems near the period gap, and what further data would be required?\n\n**Suggestions for Related Topics/Future Research Directions:**\n\n1.  Investigate the link between donor star evolution and the presence of ellipsoidal variations in the light curves of cataclysmic variables, particularly those near the period gap.\n2.  Develop automated methods for selecting high-inclination targets from Gaia data to increase the efficiency of period determination in CVs.\n3.  Combine Gaia photometry with spectroscopic observations to gain insights into the properties of the donor stars and constrain their evolutionary models in CVs.\n4.  Compare the orbital period distribution of dwarf novae found in this study with those found in other catalogs (e.g., those using TESS data) to further investigate the presence of bias related to observation techniques and data quality.\n5. Examine the effects of different mass transfer rates on the observed light curve characteristics across the period range to better understand the transition between different stages of CV evolution.\n\n\n**Relevant References:**\n\n1.  **Gaia Collaboration et al. (2018):**  *A&A, 616, A1*.  (Essential for context on Gaia data)\n2.  **Gänsicke et al. (2009):** *MNRAS, 397, 2170*. (Relevant for understanding the period gap)\n3.  **Knigge (2006):** *MNRAS, 373, 484*. (Discussion of donor star evolution)\n4.  **Schreiber et al. (2024):** *A&A, 682, L7*.  (Discusses contemporary models of the period gap)\n5.  **Pala et al. (2022):** *MNRAS, 510, 6110*.  (Investigates mass-transfer rates)\n\n\n"
    },
    "http://arxiv.org/abs/2411.09506v1": {
        "summary": "**Summary of \"Gl 725A b: a potential super-Earth detected with SOPHIE and SPIRou in an M dwarf binary system at 3.5 pc\"**\n\n**1. Main objective and motivation:**\n\nThe paper aims to confirm the existence of a low-mass planet orbiting the nearby M dwarf star Gl 725A using high-precision radial velocity (RV) measurements from both optical (SOPHIE) and near-infrared (SPIRou) spectrographs. The primary motivation is the prevalence of low-mass planets around M dwarfs and the difficulty in distinguishing true planetary signals from stellar activity noise, especially in the case of M dwarf binaries.  The study is particularly focused on Gl 725A as it is a relatively close and low-activity M dwarf in a binary system, offering a unique opportunity for detailed characterization.\n\n**2. Key methods and approaches:**\n\nThe study utilizes high-precision RV measurements from both SOPHIE and SPIRou, employing different wavelength regimes to address the chromatic nature of stellar activity.  The data reduction process for both instruments includes sophisticated methods to correct for instrumental systematics, telluric contamination (specifically addressed with the Wapiti method for SPIRou), and stellar activity using Gaussian Process Regression (GPR).  The RV time series are analyzed using generalized Lomb-Scargle and stacked Bayesian generalized Lomb-Scargle periodograms to identify periodic signals. Independent Keplerian fits are performed on data from each instrument, followed by a joint analysis to maximize detection confidence and refine the model.  The detection of a signal is further validated with an injection-recovery test in the RV residuals, and a transit search in TESS photometry was conducted.\n\n**3. Principal findings and results:**\n\nA significant planetary signal with a period of 11.2201 ± 0.0051 days is detected independently by both SOPHIE and SPIRou, strongly suggesting a planetary origin. The RV semi-amplitude is 1.67 ± 0.20 m/s, which translates to a minimum planet mass of Mp sin i = 2.78 ± 0.35 M⊕. This places the planet in the super-Earth regime.  The best-fit model, incorporating two independent Gaussian Processes (one for each instrument) to account for stellar activity, significantly improves the fit to the data and strongly favors a circular orbit over an eccentric one.  The analysis indicates a low level of activity-induced RV variability for Gl 725A, which is consistent with the star’s long rotation period (103.1 ± 6.1 days).  No transit signal was detected in TESS photometry, and statistical analysis (True/False Inclusion Probabilities) corroborates this non-transiting status. Mass-radius relationships are used to estimate a likely planetary radius of ~1.4 R⊕.\n\n**4. Significance and implications:**\n\nThe discovery of Gl 725A b represents a significant addition to the population of low-mass planets in short periods around nearby M dwarfs. This confirms the commonality of super-Earths in such systems.  The use of joint optical and near-infrared observations provides a robust detection method for low-mass exoplanets by mitigating the impact of stellar activity.  The proximity of Gl 725A b to Earth allows for future follow-up observations with a variety of techniques to further characterize its properties.  Furthermore, the study contributes to refining understanding of the prevalence and formation of planets around M dwarf binaries. The findings highlight the increasing efficacy of multi-wavelength RV measurements in detecting and characterizing exoplanets, particularly those orbiting low-mass stars.\n",
        "insights": "This paper reports the discovery of a super-Earth candidate, Gl 725A b, orbiting the nearby M dwarf binary system Gl 725A, using high-precision radial velocity measurements from SOPHIE and SPIRou spectrographs.\n\n**Key Insights and Lessons Learned:**\n\n* **Multi-wavelength observations are crucial for accurate exoplanet detection:** Combining optical (SOPHIE) and near-infrared (SPIRou) data allows for more reliable detection by mitigating chromatic effects of stellar activity.\n* **Stellar activity significantly impacts RV measurements:**  Gaussian process regression (GPR) models are essential to disentangle planetary signals from the noise of stellar activity variability.  The Wapiti method is effective for correcting NIR data contamination.\n* **Close M dwarf binaries are fertile ground for exoplanet discoveries:**  The proximity of Gl 725A to Earth and the relatively high multiplicity rate of M dwarfs in the solar neighbourhood suggest more such discoveries are possible.\n* **Transit detection is challenging in blended light curves:** While no transits were detected in TESS data, the limitations of photometry for blended binary systems are highlighted, indicating the need for more refined techniques or other methods.\n* **Super-Earths are common around close M dwarfs:**  The newly discovered planet fits the pattern of low-mass planets with short orbital periods around M dwarfs.\n\n**Questions for the Authors:**\n\n1.  Given the limitations of the current data in detecting transits, what alternative techniques could be used to increase the reliability of transit searches for future observations of blended systems?\n2.  How robust is the conclusion of Gl 725A b being non-transiting given the relatively high scatter in the TESS data after detrending?\n3.  What are the specific mechanisms or processes, if any, that could potentially explain the slight difference in the amplitude of the GPs derived from SOPHIE and SPIRou data? Could that be related to variability in the stellar activity region distribution?\n4.  What is the current status of the in-preparation work on Gl 725B and how might that further refine our understanding of the Gl 725 system?\n5.  What are the major uncertainties in the age estimation of Gl 725A and how might these affect the interpretation of the star's activity and the potential for future exoplanet discoveries in similar systems?\n\n\n**Suggestions for Related Topics/Future Research:**\n\n1.  Investigate the formation mechanisms of S-type planets in close binary systems to understand the interplay of stellar multiplicity with planet formation.\n2.  Develop improved techniques for transit detection in blended light curves from M dwarf binaries, considering the challenges of light curve detrending and activity.\n3.  Explore the long-term temporal variability of stellar activity in M dwarfs to better understand the evolution of active regions and their impact on radial velocity measurements.\n4.  Carry out similar multi-wavelength surveys for other nearby M dwarf binaries to establish a larger dataset and explore the frequency and distribution of exoplanets in such systems.\n5.  Use theoretical models to explore the potential influence of stellar magnetic field configurations on the variability of M dwarfs and their effect on RV measurements.\n\n**Relevant References:**\n\n1.  Anglada-Escudé, G., et al. (2016). *Nature*, *536*, 437.\n2.  Dressing, C. D., & Charbonneau, D. (2013). *ApJ*, *767*, 95.\n3.  Bonfils, X., et al. (2013). *A&A*, *549*, A109.\n4.  Fulton, B. J., et al. (2018). *PASP*, *130*, 044504.\n5.  Kopparapu, R. K. (2013). *ApJ*, *767*, L8.\n"
    },
    "http://arxiv.org/abs/2411.09408v1": {
        "summary": "**Summary of \"New results on the onset of a coronal mass ejection from 5303˚A emission line observations with VELC/ADITYA-L1\"**\n\n**1. Main objective and motivation:**\n\nThe study aims to use spectroscopic observations of the 5303Å coronal emission line, obtained by the VELC instrument on the ADITYA-L1 mission, to characterize the onset of a coronal mass ejection (CME).  The motivation is to improve our understanding of the thermodynamic changes in the near-Sun corona during CMEs, a crucial step in predicting space weather events.  Prior research on CMEs using similar techniques from ground-based and space-based instruments (e.g., LASCO) is limited, especially concerning dynamic events near the solar limb, motivating the present work.\n\n**2. Key methods and approaches:**\n\nThe study utilizes the VELC/ADITYA-L1 instrument, a coronagraph capable of both imaging and spectroscopy in the 5303Å line, and other complementary observations, including STEREO-A/EUVI data, SOHO/LASCO-C2 observations, and GOES soft X-ray data.  The authors analyze data acquired using both sit-and-stare and raster scan modes, providing spatial and temporal variations of spectral parameters (intensity, width, Doppler shift) within a specific region of interest near the solar west limb.  The spectroscopic data is analyzed by fitting Gaussian profiles to the emission lines, allowing for the determination of peak intensity, line width, and Doppler velocity.  Comparisons with data from other instruments and historical observations provide context for the detected phenomena.\n\n**3. Principal findings and results:**\n\nOn 16 July 2024, a CME associated with an X1.9 class flare was observed.  VELC observations reveal a significant dimming (~50%) in the 5303Å emission line intensity around ≈13:18 UT in a specific spatial location. This dimming was concurrent with a localized Hα flare.  The emission line width increased by ~15% during the dimming period, indicative of an increase in the Doppler temperature from ~2.7×10<sup>6</sup> K to ~3.6×10<sup>6</sup> K.  A non-thermal velocity of ~24.87 km/s was estimated.  Doppler velocity analysis indicated an outflow from the region, showing a redshift (~10 km/s) suggesting a deflection of the CME by the ambient magnetic field.  The onset time of the CME at 1 R⊙ was estimated to be ~13:48 UT based on a 2nd order fit to height-time measurements from SOHO/LASCO.  The estimated speed in the plane-of-sky was ~393 km/s. The observations strongly suggest that the 5303Å dimming was a direct consequence of CME-induced material depletion.\n\n**4. Significance and implications:**\n\nThe study provides the first spectroscopic observations of a CME onset in the 5303Å emission line using the VELC instrument.  These results offer valuable insights into the early stages of CME development and the associated coronal changes. The combined analysis of intensity, width, and Doppler shift provides multi-faceted information for CME modelling and forecasting.  The observed timing relationship with other solar phenomena (flare, radio burst, CME in SOHO/LASCO) strengthens the causal link between the eruption and the observed dimming.  Further synoptic observations with VELC and other instruments will refine the understanding of CME onset and evolution, improving space weather prediction models. The data helps constrain the input parameters in CME simulations.\n",
        "insights": "This paper reports on the spectroscopic observation of a coronal mass ejection (CME) onset using the 5303˚A emission line from the VELC/ADITYA-L1 instrument, providing constraints on the onset time and associated parameters.\n\n\n**Key Insights and Lessons Learned:**\n\n* **First Spectroscopic CME Onset Observation:** The study presents the first spectroscopic observations of the onset phase of a CME in the 5303˚A coronal emission line using the VELC/ADITYA-L1 instrument.\n* **Coronal Dimming:**  A significant coronal dimming (≈50%) was observed, likely due to CME-induced material depletion, and persisted for approximately 6 hours.\n* **Line Broadening:** A 15% increase in the emission line width was observed, suggesting an increase in the Doppler temperature from ≈ 2.7×10<sup>6</sup> K to ≈ 3.6×10<sup>6</sup> K, likely due to increased turbulence.\n* **Doppler Shift:** A redshift of ≈10 km/s was measured, which could indicate a deflection of the CME by the ambient magnetic field.\n* **Near-Sun Observations:**  The VELC/ADITYA-L1 observations captured the CME approximately 1 hour before it entered the field of view of SoHO/LASCO-C2.\n* **Relationship between Flare and CME:** The CME was associated with a X1.9 class soft X-ray flare from a specific active region.\n* **Non-thermal velocity:** The non-thermal velocity associated with the line broadening was measured at ≈24.87 km/s.\n\n\n**Questions for the Authors:**\n\n1.  Could you elaborate on the specific mechanisms responsible for the observed coronal dimming, particularly the density decrease of ≈7% ?\n2.  What are the uncertainties associated with estimating the onset time of the CME based on the linear and quadratic fits to the height-time measurements?\n3.  How does the observed non-thermal velocity relate to the restructuring of the coronal magnetic field and small-scale magnetic reconnections at the CME source region?\n4.  Given the close proximity of the observed dimming to the flare location, could you discuss the potential causal link between the flare and the CME onset?\n5.  How do the results of these observations compare to similar CME observations made in other wavelengths, and what is the significance of VELC/ADITYA-L1's unique capabilities for observing the onset of CMEs?\n\n\n**Suggestions for Future Research:**\n\n1.  Further investigation into the correlation between coronal dimming, emission line broadening, and Doppler shifts during different types and intensities of CMEs.\n2.  Detailed modeling of the coronal density changes during the CME onset using the observed spectroscopic data.\n3.  Simultaneous observations in multiple wavelengths (e.g., EUV, radio) to further constrain the CME's onset time and propagation characteristics.\n4.  Systematic study of the relationship between the characteristics of the 5303˚A emission line and the CME propagation characteristics.\n5.  Using VELC/ADITYA-L1 to study the role of magnetic field reconnection in the onset of different types of solar eruptions.\n\n\n**Relevant References:**\n\n1.  **Dere, K. P., Brueckner, G. E., Howard, R. A., et al. (1997).** Sol. Phys., 175, 601. (Early spectroscopic CME observations)\n2.  **Plunkett, S. P., Brueckner, G. E., Dere, K. P., et al. (1997).** Sol. Phys., 175, 699. (Another relevant paper on spectroscopic CME observations)\n3.  **Schwenn, R., Inhester, B., Plunkett, S. P., et al. (1997).** Sol. Phys., 175, 667. (Further insight into using coronagraphs)\n4.  **Howard, R. A., Moses, J. D., Vourlidas, A., et al. (2008).** Space Sci. Rev., 136, 67. (Details about STEREO-A/EUVI)\n5.  **Tian, H., Tomczyk, S., McIntosh, S. W., et al. (2013).** Sol. Phys., 288, 637. (Model comparisons and constraints)\n"
    },
    "http://arxiv.org/abs/2411.09319v1": {
        "summary": "**Solar flares in the Solar Orbiter Era: Short exposure EUI/FSI observations of STIX flares**\n\n**1. Main objective and motivation:**\n\nThe paper aims to demonstrate the utility of short-exposure extreme ultraviolet (EUV) observations of solar flares, particularly those captured by the Extreme Ultraviolet Imager (EUI) on Solar Orbiter in short exposure mode.  The primary motivation is to overcome the saturation issues prevalent in standard EUV imagers during large flares, enabling detailed study of the spatial and temporal evolution of the flare ribbons and their relation to hard X-ray (HXR) emission, crucial for understanding particle acceleration, heating, and energy partitioning.\n\n**2. Key methods and approaches:**\n\nThe study focuses on a selection of flares simultaneously observed by the Spectrometer Telescope for Imaging X-rays (STIX) and EUI/Full Sun Imager (FSI) in short-exposure mode.  A key method involves comparing STIX HXR observations with corresponding short-exposure EUI/FSI images in the 174 Å passband.  The authors employ a forward modeling approach using the RADYN 1D hydrodynamic code to simulate the atmospheric response to a non-thermal electron beam inferred from STIX observations.  The simulated response is then compared with the observed EUV emission.  A curated flarelist of STIX flares with corresponding short exposure EUI/FSI data is created from operational STIX flare lists.  Flux correction factors are calculated to account for potential non-linearities in instrument response with varying exposure times.  Appropriate techniques such as rotating and aligning STIX HXR images with EUI images are used to facilitate comparison.\n\n**3. Principal findings and results:**\n\nThe study demonstrates that short-exposure EUI/FSI observations provide valuable diagnostics of solar flares.  The observations reveal substructure within flaring ribbons that spatially coincide with hard X-ray emission from STIX in most cases.  The analysis of three example flares, including a large X9-class flare and a C1.4-class flare, highlights the improved spatial resolution and dynamic range provided by the short exposure mode.  This enables precise alignment of STIX HXR sources with EUV ribbons. A significant result is the successful comparison between predicted and observed EUV 174 Å emissions for a C1.4 flare. The model accurately captures the peak flux of the short-exposure 174 Å observations during the impulsive phase, demonstrating that most of the EUV emission originates from the chromosphere at this stage. This outcome validates the usefulness of the short exposure mode for inferring electron beam energy fluxes required for flare modeling. The study highlights the usefulness of high cadence short exposure observations for understanding flare energy release and transport processes.\n\n**4. Significance and implications:**\n\nThe work demonstrates the crucial role of short-exposure EUV observations in studying solar flares, specifically in overcoming saturation limitations and revealing finer details in flaring ribbons.  This refined level of detail significantly advances our understanding of particle acceleration and energy release processes.  The study underscores the importance of co-observational data, particularly in cases where ground-based observations are unavailable (e.g., far-side flares). The development of a publicly accessible flarelist with short-exposure EUI data is a valuable contribution to the solar physics community.  The paper further motivates the need for future instruments capable of high cadence, high-resolution EUV observations for a more comprehensive understanding of flare dynamics and a refinement of flare modeling efforts.  The results also demonstrate the potential to refine constraints on electron energy fluxes in flares and understand energy partitioning within them more precisely.  The RADYN modeling successfully links HXR and EUV observations, validating the approach for future studies.\n",
        "insights": "This paper demonstrates the utility of short-exposure extreme ultraviolet (EUV) observations from the Solar Orbiter's EUI/FSI instrument for studying solar flares, particularly in conjunction with hard X-ray data from STIX, by revealing fine structure in flaring ribbons that are typically lost due to instrument saturation.\n\n**Key Insights and Lessons Learned:**\n\n* **Short-exposure EUV observations are crucial:**  Short exposures allow for the observation of fine details in flaring ribbons that are obscured by saturation in standard exposure modes.\n* **Improved diagnostics of flare energy release:**  Combining short-exposure EUV (e.g., EUI/FSI) with hard X-ray (e.g., STIX) observations provides critical diagnostics for understanding particle acceleration, heating, and energy partitioning in solar flares.\n* **Precise alignment of different wavelengths:**  The spatial correspondence between EUV and hard X-ray emission is enhanced by the availability of unsaturated EUV data.\n* **Flare modeling constraints:** Short-exposure observations provide better constraints on the electron energy flux needed for flare models.\n* **Importance of \"far-side\" observations:**  Solar Orbiter's ability to observe the Sun from the far side provides essential context for events not observable from Earth.\n* **Data limitations and processing considerations:**  Non-linearity in instrumental response and difficulties in rotating images affect the accuracy of analysis. Case-by-case correction is recommended.  Sparse data points in short exposure images also introduce complexities.\n\n**Questions for the Authors:**\n\n1.  What is the most significant limitation in accuracy of the derived electron beam energy flux when using the 1D RADYN modeling approach presented in the paper?\n\n\n2.  Given the limitations of spatial resolution at some radial distances, what alternative methods were investigated or considered for calculating the electron beam footpoint area in cases where EUI/FSI resolution is insufficient?\n\n3.  How does the flux correction factor for short-exposure images depend on the flare characteristics (e.g., size, location, energy release rate)? Can a standardized correction procedure be established for general applicability across a range of flare events?\n\n\n4.  What are the next steps in refining the correction factor used for the non-linearity observed in the instrumental response between regular and short exposures, considering the specific characteristics of EUI/FSI?\n\n\n5.  Beyond the 2022-2023 dataset, what further data sets or future campaigns are planned using Solar Orbiter to leverage this short exposure methodology for more complex or extensive flare events?\n\n**Suggestions for Related Topics/Future Research:**\n\n1.  Development of automated algorithms for accurate flux correction and image manipulation of short-exposure data from EUV/UV instruments.\n\n2.  Comparison of results obtained using short-exposure EUV observations with results obtained from other solar instruments (like IRIS, AIA, etc.) in the same or overlapping wavelength bands to validate the findings and gain a holistic understanding of the flaring process.\n\n3.  Investigating the effect of different spectral indices and energy cutoffs of electron beams on the predicted and observed EUV emission in 1D RADYN simulations to refine the relationship.\n\n4.  Development of a physically motivated model of flare ribbons to better interpret the observed spatial structure and refine the 1D flare model.\n\n\n5.  Exploring the possibility of using short-exposure data to study coronal mass ejections (CMEs) and their relation to flares for a more comprehensive view of solar activity.\n\n**Relevant References (5 examples):**\n\n1.  **Lemen et al. (2012):**  This reference is cited within the paper and provides context on the AIA instrument's exposure control methods, a key aspect in the context of saturation in EUV observations.\n\n2.  **Berghmans et al. (2023):**  This reference is cited and directly relates to the Solar Orbiter instrumentation and its potential to observe the far-side of the Sun.\n\n3.  **Krucker et al. (2020):**  This reference details the STIX instrument and is essential for understanding the hard X-ray observations used in the study, complementary to the EUV data.\n\n4.  **Rochus et al. (2020):**  Describes EUI design and capabilities, which directly relates to the short-exposure methodology.\n\n5.  **Carlsson & Stein (1992):** This reference is cited and provides context on the RADYN model, used in the paper to model atmospheric response to electron beams.\n"
    },
    "http://arxiv.org/abs/2411.09311v1": {
        "summary": "**Compression Method for Solar Polarization Spectra Collected from Hinode SOT/SP Observations**\n\n**1. Main objective and motivation:**\n\nThe paper aims to develop and evaluate deep learning-based compression techniques for solar polarization spectra, specifically focusing on Stokes I and V parameters, to address the growing volume of high-dimensional data from instruments like Hinode SOT/SP.  The motivation stems from the need for efficient data handling, enabling comprehensive analysis of complex solar phenomena, including those associated with active regions, which are often characterized by intricate magnetic fields.  The authors also acknowledge the limited previous work in compressing solar spectra, particularly for active regions and the two-dimensional nature of the data.\n\n\n**2. Key methods and approaches:**\n\nThe authors employ two deep learning architectures: a Deep Autoencoder (DAE) and a 1D Convolutional Autoencoder (CAE). Both models aim to learn a compressed representation of the input spectra (Stokes I and V from Hinode SOT/SP).  The models' architectures utilize layers of fully connected neurons (DAE) or 1D convolutional filters (CAE), augmented with batch normalization and an exponential linear unit (ELU) activation function. The encoder reduces the dimensionality of the input, while the decoder reconstructs it. Crucial to this study is the careful preparation of the dataset, including division into training, validation, and test sets, with explicit focus on balancing the representation of quiet Sun and active region data.  Normalization techniques, including min-max scaling for Stokes I and zero-mean scaling for Stokes V, are applied to the input data. The training process employs the Adam optimizer, with early stopping and learning rate reduction to optimize training efficiency.\n\n\n**3. Principal findings and results:**\n\nThe CAE model consistently outperforms the DAE model in reconstructing Stokes I and V profiles, demonstrating higher robustness and achieving reconstruction errors comparable to observational noise levels, even with significant variations in training set data balance.  The optimal bottleneck size was determined through experimentation, with 28 nodes yielding the best results for both models.  Significant improvement is demonstrated in reconstructing Stokes V, often more noisy than Stokes I.  Performance was evaluated using Root Mean Square Deviation (RMSD) and Chi-squared metrics over specific wavelength regions corresponding to key features in the spectra (absorption lines).  Results show that the CAE, especially, consistently maintains fidelity in reconstructing profiles across all tested data types, including quiet Sun, pores, and sunspot regions, even in the face of varying data balance during training.\n\n\n**4. Significance and implications:**\n\nThe paper presents a novel compression technique applicable to two-dimensional solar polarimetric spectra in both quiet Sun and active regions, a significant advancement over previous methods primarily focused on one-dimensional spectra. The CAE model's robust performance across varying data balance demonstrates its practical value in analyzing potentially complex and high-noise solar spectral data. The approach promises to be useful in various applications, including anomaly detection. The study suggests that the CAE model is a valuable tool for processing and analyzing increasingly large solar spectral datasets, potentially leading to improved discoveries of unusual spectral signals, enabling more comprehensive analyses of solar phenomena, and aiding in better understanding of the solar atmosphere's structure and magnetic fields. Future work should include the addition of Stokes Q and U parameters and broadening analysis to encompass regions beyond the solar disk center.\n",
        "insights": "This paper proposes and evaluates two deep learning-based compression methods (DAE and CAE) for Hinode SOT/SP solar polarization spectra, focusing on Stokes I and V parameters, demonstrating that CAE outperforms DAE in reconstructing both quiet Sun and active region spectra.\n\n**Key Insights and Lessons Learned:**\n\n* **CAE Model Superiority:** The 1D-convolutional autoencoder (CAE) consistently outperforms the deep autoencoder (DAE) in reconstructing solar spectra, achieving reconstruction errors comparable to observational noise levels, especially in the context of data imbalances.\n* **Data Imbalance Impact:**  DAE models are more sensitive to data imbalance (e.g., quiet Sun vs. active regions) during training.  CAE models exhibit greater robustness in handling variations in training set balance.\n* **Noise Handling:** Both models effectively reduce noise levels in the reconstructed spectra, especially for Stokes I and V in quiet Sun regions.\n* **Compression Effectiveness:** The models achieve a substantial dimensionality reduction (from 224 to 28 parameters), preserving critical spectral information for subsequent analysis.\n* **Bottleneck Size Optimization:**  The optimal bottleneck size for both models is 28, though larger bottleneck sizes may result in better performance for CAE models.\n\n\n**Questions for the Authors:**\n\n1.  What specific architectural design choices in the CAE model contributed to its superior performance, particularly regarding data imbalance robustness?\n2.  How does the choice of activation function (ELU) and normalization technique (batch normalization) impact the models' ability to capture subtle spectral features?\n3.  Could the methods used for normalization (min-max scaling for Stokes I and zero-mean scaling for Stokes V) be improved upon for better results, especially in active regions?\n4.  How could the proposed method be extended to include the Stokes Q and U parameters for a more complete representation of the solar polarization spectra?\n5. What are the potential computational limitations of applying this compression method to larger datasets or different wavelength ranges?\n\n\n**Suggestions for Related Topics or Future Research Directions:**\n\n1.  **Extension to Full Stokes Parameters:** Expand the analysis to include all four Stokes parameters (I, Q, U, V) to gain a more comprehensive understanding of the magnetic field and other physical properties.\n2.  **Comparison with Other Dimensionality Reduction Techniques:** Compare the performance of the proposed CAE and DAE methods with other dimensionality reduction techniques, such as Principal Component Analysis (PCA) or Variational Autoencoders (VAEs), to assess their effectiveness.\n3.  **Application to Different Solar Regions:** Evaluate the compression method's performance in different solar regions, such as the limb or different phases of the solar cycle, to determine its general applicability.\n4.  **Development of a Universal Model:** Develop a single universal model capable of compressing solar spectral data from a variety of regions and wavelengths.\n5.  **Anomaly Detection:** Apply the pre-trained CAE models to detect anomalous spectral signals (e.g., solar flares, jets, etc.).\n\n**Relevant References (from the field of study):**\n\n1.  **Asensio Ramos, A. et al. (2007).** The Intrinsic Dimensionality of Spectropolarimetric Data. *The Astrophysical Journal*, *660*(2), 1690.\n2.  **De Pontieu, B. et al. (2014).** The Interface Region Imaging Spectrograph (IRIS). *Solar Physics*, *289*(12), 2733–2779.\n3.  **Kosugi, T. et al. (2007).** The Hinode (Solar-B) mission: An overview. *Solar Physics*, *243*(1), 3–17.\n4.  **Lites, B.W. et al. (2013).** The Hinode Spectro-Polarimeter. *Solar Physics*, *283*(1), 579–599.\n5.  **Tsuneta, S. et al. (2008).** The Solar Optical Telescope for the Hinode Mission: An Overview. *Solar Physics*, *249*(1), 167–196.\n"
    },
    "http://arxiv.org/abs/2411.09292v1": {
        "summary": "**Summary of \"The rotation properties of δ Sct and γ Dor stars\"**\n\n**1. Main objective and motivation:**\n\nThe study aims to investigate the relationship between rotation and pulsation in δ Scuti (δ Sct) and γ Doradus (γ Dor) stars.  Specifically, the authors want to compare the rotational velocity distributions of these pulsating stars with those of normal main-sequence stars of similar mass and determine if pulsations have an influence on rotational evolution.  They hypothesize that differences in rotation properties between pulsating and non-pulsating stars might be driven by angular momentum transport related to the pulsation modes.\n\n**2. Key methods and approaches:**\n\n* **Data Acquisition:** A large sample of early-type main-sequence stars was compiled from LAMOST spectroscopic data and TESS time-series photometry.  This includes a sizable set of identified δ Sct, γ Dor, and hybrid (δ Sct|γ Dor and γ Dor|δ Sct) stars, plus candidate pulsators.\n* **Contaminant Removal:**  A meticulous process was employed to identify and exclude known contaminants (binaries, chemically peculiar stars, cluster members, etc.) from the data set to ensure a pure sample of normal stars.\n* **Pulsation Classification:** The Lomb-Scargle periodogram method was used to identify the dominant periods of pulsation, and further criteria were applied to classify the pulsating stars into δ Sct, γ Dor, and hybrid categories, with a focus on distinguishing hybrid stars based on the dominant pulsation mode (δ Sct|γ Dor or γ Dor|δ Sct).\n* **Rotational Velocity Analysis:**  Projected rotational velocities (v sin i) were corrected for inclination to derive equatorial rotational velocities.  Bootstrapping techniques were used to estimate uncertainties in these distributions.\n* **Statistical Analysis:** Kolmogorov-Smirnov (KS) tests were used to assess statistical significance of differences in rotational velocity distributions between pulsating and normal stars.  Comparison was made across mass and age ranges.\n\n\n**3. Principal findings and results:**\n\n* **Similar Rotational Properties of δ Sct and γ Dor Stars:**  The rotational velocity distributions of δ Sct and γ Dor stars are very similar, differing primarily in the low-velocity end of the distribution, potentially due to residual contaminants.  This similarity suggests that both types of pulsations may have similar effects on rotation.\n* **Different Rotation from Normal Stars:** The rotational velocity distributions of normal stars are more dispersed than those of δ Sct and γ Dor stars, particularly at the higher velocity end.  The peak rotational velocities of pulsating stars are approximately 10 km/s higher than those of normal stars in the studied mass range.\n* **Mass-Rotation Dependence:**  Rotation in normal stars shows a monotonic increase in peak velocity with mass between 1.8 and 2.5 M⊙, which is not observed in δ Sct stars. Their rotation is largely independent of mass.\n* **Evolutionary Effects:** Normal stars show acceleration in rotation during the late main sequence, whereas δ Sct stars show a deceleration.\n* **Amplitude-Rotation Correlation in δ Sct stars:** High-amplitude δ Sct stars are typically rotating slowly, contrasting with the broader rotational distribution of low-amplitude δ Sct stars. This suggests a strong relationship between pulsation amplitude and rotational velocity in δ Sct stars. No similar relationship is observed in γ Dor stars.\n\n**4. Significance and implications:**\n\nThe study provides evidence that stellar pulsations can affect the rotational evolution of stars, specifically by potentially transporting angular momentum from the interior to the surface. This is suggested by the different mass-rotation relationships between pulsating and non-pulsating stars, as well as the observed differences in evolutionary trends for rotation. The similarity in rotational velocity distributions between δ Sct and γ Dor stars supports the idea that p-mode and g-mode pulsations may have similar effects on stellar rotation.  Further study, ideally with larger, cleaner samples, will help solidify these conclusions and fully elucidate the mechanisms. The findings highlight the importance of accounting for pulsation effects when studying the rotation of stars, especially in the mass range covered by δ Sct and γ Dor stars.\n",
        "insights": "This paper analyzes the rotational velocity distributions of δ Sct and γ Dor stars, comparing them to those of normal stars to understand the influence of pulsation on stellar rotation.\n\n**Key Insights and Lessons Learned:**\n\n* **Similar Rotation:** δ Sct and γ Dor stars exhibit remarkably similar rotational velocity distributions, suggesting a shared impact of pulsation on rotation.\n* **Dispersed Rotation in Normal Stars:** Normal stars show a broader distribution of rotational velocities compared to pulsating stars, possibly due to the presence of various unclassified stars.\n* **Mass Independence:** The rotational velocity distribution of δ Sct stars is largely independent of mass, contrasting with the mass-dependent behavior observed in normal stars.\n* **Evolutionary Differences:** Normal stars accelerate rotation during late main sequence evolution, while δ Sct stars decelerate.\n* **Amplitude-Rotation Correlation:** In δ Sct stars, there's a correlation between photometric amplitude and rotation, with high-amplitude stars rotating slowly.\n* **Pulsation's Role in Angular Momentum Transfer:** Pulsation may facilitate the transfer of angular momentum from the stellar interior to the surface in δ Sct and γ Dor stars, resulting in higher peak rotational velocities compared to normal stars.\n\n**Questions for the Authors:**\n\n1.  What specific mechanisms might be responsible for the deceleration of rotation in δ Sct stars during the late main sequence?\n2.  Given the similar rotational properties of δ Sct and γ Dor stars, could the observed differences at the low-velocity end be attributed to systematic biases in the classification of contaminating stars?\n3.  How can the influence of rotation on the pulsation frequencies of δ Sct and γ Dor stars be better quantified and modeled?\n4.  Could the observed mass independence of rotation in δ Sct stars be related to specific mass-dependent differences in internal angular momentum transport?\n5.  What are the limitations in the current modeling techniques for estimating masses and ages of these stars, especially considering the complexity of rotation and pulsation?\n\n\n**Suggestions for Related Topics/Future Research:**\n\n1.  Investigate the relationship between the type of pulsation modes (radial vs. non-radial) and the impact on stellar rotation in δ Sct and γ Dor stars.\n2.  Further analyze the role of magnetic fields, if present, in influencing the rotation of δ Sct and γ Dor stars, potentially through dynamo-related processes.\n3.  Explore the behavior of rotation and pulsation in other types of variable stars, such as SX Phe stars, to establish general trends.\n4.  Investigate the angular momentum transport mechanisms (e.g., magnetic fields, convective motions) within the interior of δ Sct and γ Dor stars during their different evolutionary stages.\n5.  Refine the classification criteria for hybrid stars and conduct detailed studies on their rotational characteristics, considering potential contamination in existing samples.\n\n\n**Relevant References:**\n\n1.  Aerts, C., Christensen-Dalsgaard, J., & Kurtz, D. W. (2010). _Asteroseismology_.\n2.  Zorec, J., & Royer, F. (2012). _A&A, 537, A120_ (A comprehensive review of stellar rotation)\n3.  Sun, W., Duan, X.-W., Deng, L., & de Grijs, R. (2021a). _ApJ, 921, 145_.  (Study on early-type stars and rotation)\n4.  Sun, W., Duan, X.-W., Deng, L., et al. (2021b). _ApJS, 257, 22_. (LAMOST dataset analysis)\n5.  de Mink, S. E., Langer, N., Izzard, R. G., Sana, H., & de Koter, A. (2013). _ApJ, 764, 166_.  (Binary star influence on rotation)\n\n\n**Note:**  The provided paper is quite extensive, and a deeper summary requires a more in-depth review of the entire document.\n"
    },
    "http://arxiv.org/abs/2411.09272v1": {
        "summary": "**1. Main objective and motivation:**\n\nThe paper investigates the instability of a subsonic gas flow within a flat channel subjected to a transverse force field. This work is motivated by astrophysical applications, particularly the dynamics of astrospheric jets.  The authors aim to model the potential instability of such jets, which can be characterized by a mass force acting on the gas flow, mimicking the effect of a star's azimuthal magnetic field on plasma jets after a shockwave.  The study uses a simplified two-dimensional model of a flat channel to isolate and analyze this instability mechanism, avoiding the complexities of full astrophysical simulations.\n\n\n**2. Key methods and approaches:**\n\nThe authors use a two-dimensional, axisymmetric model of gas flow through a flat channel.  The governing equations are the Euler equations of ideal gas dynamics, accounting for a body force (mass force field) directed towards the channel axis.  This force is implemented as a function of position, either as a discontinuous or continuous field within a specified region of the channel.  A numerical solution method based on Godunov-type control volume methods (specifically, HLLC solvers) is employed on a Cartesian grid.  Important aspects of the numerical approach include the use of parallel processing (CUDA C++) for efficiency and the implementation of soft boundary conditions at the outlet to mitigate reflections and artifacts. To analyze asymmetric instabilities, small, periodic density disturbances are introduced at the inlet to break initial symmetry.\n\n\n**3. Principal findings and results:**\n\nThe study reveals that the presence of the transverse force field induces instability in the subsonic flow.  The nature of the instability depends strongly on the strength of the force field:\n\n* **Weak force field (F ≤ 2.5):**  The instability is symmetric with respect to the channel axis. It exhibits quasi-periodic oscillations with a fundamental period, which seems to correlate with the time for disturbances to propagate across the channel width. The flow pattern suggests a pressure maximum at the channel axis.\n* **Strong force field (F ≥ 4):**  The instability becomes asymmetric, leading to the formation of vortices and potentially more complex flow patterns including features resembling a Karman vortex street. The oscillation spectrum becomes more complex, featuring a mix of low-frequency and a broad spectrum of high-frequency components.\n* **Intermediate force field (F ≈ 3):**  The instability shows a gradual evolution, with parts of the channel exhibiting symmetric behavior and other parts manifesting as asymmetric instability.  This intermediate behavior suggests a transition from symmetric to asymmetric instability as the force increases.\n* **Continuous force field:** Instabilities are observed even with a continuously differentiable force field, demonstrating that the key element driving the instability is the localized pressure gradient, which can be caused by both discontinuous and continuous force functions.\n\nThe authors observe different oscillation patterns and frequencies based on force strength and force field characteristics. Key results are presented as numerical solutions, visualizations (streamlines, pressure, Mach number and vorticity isolines), and spectral analysis (Fourier decomposition) of the flow variables.\n\n\n**4. Significance and implications:**\n\nThis study provides a fundamental understanding of how a transverse force field can induce instability in gas flows, a phenomenon applicable to various scientific domains.  The results offer valuable insights into the dynamics of astrophysical jets. The findings show that even relatively simple models can exhibit complex, self-oscillating behavior under specific conditions, thereby highlighting the complexity of fluid flow.  This knowledge might help predict and interpret observed behaviors in astrophysical jets and potentially stimulate further research on the nonlinear interactions and feedback mechanisms that contribute to jet evolution. The paper also emphasizes the crucial role of numerical methods in tackling such complex fluid dynamics problems in astrophysics. Future research will likely investigate the detailed mechanisms of instability development,  consider more realistic models of the force field, and examine the effects of temperature and other thermodynamic variables.\n",
        "insights": "This paper numerically investigates the instability of subsonic gas flow in a flat channel subjected to a transverse force field, focusing on self-oscillations of the jet.\n\n**Key Insights and Lessons Learned:**\n\n* **Force Field Impact:** A transverse force field, acting only within a specific region, creates a pressure gradient that destabilizes the flow.\n* **Instability Types:**  Weak forces lead to symmetrical oscillations, while stronger forces produce asymmetric instabilities with vortices and a complex spectrum of frequencies.\n* **Quasi-Periodicity:** The flow exhibits quasi-periodic behavior with frequencies related to the time required for disturbances to travel across the channel.\n* **Feedback Mechanism:**  Reflection of disturbances from the channel walls creates a feedback mechanism responsible for self-oscillations, especially prominent with strong forces.\n* **Continuous vs. Discontinuous Forces:** The paper demonstrates that instability can occur even with continuously differentiable force fields.\n\n**Questions for the Authors:**\n\n1.  Could you elaborate on the specific astrophysical context that motivated this model? How does the pressure peak in the channel relate to the physical mechanisms you've observed in astrophysical jets?\n2.  What are the limitations of the flat channel model in representing a three-dimensional astrophysical jet?  Are there experimental or simulation studies that would allow further validation of your findings?\n3.  How do the observed oscillation frequencies and patterns vary with different Mach numbers? What is the role of the specific geometry (flat channel) in the onset and evolution of the instability?\n4.  How sensitive are the results to the specific form of the transverse force field? Could other force profiles or intensities alter the character of the instability?\n5. What further numerical methods (e.g., high-order solvers or adaptive mesh refinement) could provide a more accurate and efficient assessment of the instability behavior in the strong force field regime?\n\n**Related Topics/Future Research Directions:**\n\n1. **Three-dimensional modeling:** Extend the study to a three-dimensional model of an astrophysical jet to better represent the complex geometries and dynamics of real-world systems.\n2. **Effects of viscosity and heat transfer:**  Include viscosity and heat transfer effects in the model to explore the role of these phenomena on the stability and dynamics of the flow.\n3. **Comparison with MHD simulations:** Compare the results of this study with simulations of magnetohydrodynamic (MHD) jets to quantify the impact of the different force mechanisms.\n4. **Experimental validation:** Conduct experiments, if feasible, to validate the numerical results and further understand the underlying physics of the observed instabilities.\n5. **Analysis of other force fields:** Investigate the behavior of the flow under various force field configurations (e.g., different spatial distributions, time-dependent forces) to determine the critical parameters for the onset of instability.\n\n\n**Relevant References:**\n\n1. Parker, E. N. (1958). Dynamics of the Interplanetary Gas and Magnetic Fields. *Astrophysical Journal*, *128*(1), 664.\n2. Parker, E. N. (1961). The Stellar-Wind Regions. *Astrophysical Journal*, *134*(1), 20.\n3. Izmodenov, V. V., et al. (2017). Two-jet astrosphere model: effect of azimuthal magnetic field. *Monthly Notices of the Royal Astronomical Society*, *464*(1), 1065-1076.\n4. Korolkov, S. D., & Izmodenov, V. V. (2021). New unexpected flow patterns in the problem of the stellar wind interaction with the interstellar medium: stationary ideal-MHD solutions. *Monthly Notices of the Royal Astronomical Society*, *504*(3), 4589-4598.\n5. Korolkov, S. D., & Izmodenov, V. V. (2023). Interaction of the Supersonic Stellar Wind with Free Stream of the Interstellar Medium: the Effect of the Azimuthal Magnetic Field of the Star. *Fluid Dynamics*, *58*(1), 9-18.\n\n\n"
    },
    "http://arxiv.org/abs/2411.09195v1": {
        "summary": "**Summary of \"The origin channels of hierarchical binary black hole mergers in the LIGO-Virgo-KAGRA O1, O2, and O3 runs\"**\n\n**1. Main objective and motivation:**\n\nThe paper aims to determine the dominant formation channels (active galactic nucleus (AGN) disks and nuclear star clusters (NSCs)) for hierarchical binary black hole (BBH) mergers observed by the LIGO-Virgo-KAGRA (LVK) collaborations during their O1, O2, and O3 runs.  Previous work focused primarily on first-generation (1G) mergers, and this study seeks to investigate the contribution of repeated mergers (hierarchical mergers) and their associated astrophysical environments.  Hierarchical mergers are important because they can bridge the mass gap predicted by pair-instability supernovae and can explain the formation of intermediate-mass black holes.\n\n**2. Key methods and approaches:**\n\nA hierarchical Bayesian analysis is employed, using a parametric population model.  The model simulates hierarchical mergers in both AGN disks and NSCs, considering variations in population parameters like black hole mass distributions (PowerLaw+Peak model), spins, mass ratios, and importantly, the escape speed of the host environment (crucial for NSCs). Numerical relativity fits are used to determine the properties (mass, spin, and kick velocity) of the merger remnants.  The likelihood function incorporates the detectable fraction of mergers from each channel, considering the signal-to-noise ratio (SNR) thresholds of LVK detectors and observational biases.  A key component is evaluating the posterior distribution of the branching fractions for each formation channel, taking into account the five different BBH merger populations.\n\n**3. Principal findings and results:**\n\nThe analysis indicates that NSCs are the dominant origin channel for hierarchical mergers, accounting for a significant fraction (fNSC = 0.87−0.29+0.10 at 90% credible intervals).  AGN disks could contribute nearly half of the *detectable* hierarchical mergers (fdet,AGN = 0.34−0.26+0.38).  Several population parameters have a substantial impact on inferred branching fractions, including the mass spectral index, spin parameters, and mass ratio distributions.  The escape velocity of NSCs displays a moderate impact, but less so than the other key parameters.  Hierarchical mergers constitute at least 10% of the gravitational wave events detected by LVK during O1-O3.  Critically, the analysis highlights the difficulty in precisely inferring detailed properties of the host environment (e.g., escape velocity) when multiple formation channels are present and selection effects are accounted for.\n\n**4. Significance and implications:**\n\nThe study significantly advances our understanding of the formation pathways of hierarchical BBH mergers.  The dominance of NSCs in hierarchical merger rates underscores the importance of dense stellar environments in the formation of these events.  The analysis showcases the crucial role of population parameters, such as mass, spin, and mass ratio distributions, in distinguishing between different merger channels.  The paper further highlights the challenges in extracting precise information about host environments from gravitational wave observations, particularly when multiple formation channels contribute to the observed population.  The findings have implications for modeling the growth of black holes in various astrophysical environments, including galactic nuclei, and informing future LVK data analysis and interpretations.  Future work should aim to include a wider range of hierarchical merger branches and potentially integrate electromagnetic and neutrino observations to refine the picture of hierarchical merger origin.\n",
        "insights": "This paper uses a hierarchical Bayesian analysis to infer the formation channels of hierarchical black hole mergers observed by LIGO-Virgo-KAGRA, concluding that nuclear star clusters (NSCs) likely dominate the hierarchical merger rate, while active galactic nucleus (AGN) disks may contribute significantly.\n\n**Key Insights and Lessons Learned:**\n\n* **NSCs dominate hierarchical mergers:**  The analysis strongly suggests that nuclear star clusters are the primary formation site for hierarchical binary black hole mergers in the universe.\n* **AGN disks contribute significantly:** While NSCs are dominant, AGN disks are shown to potentially account for nearly half of the detectable hierarchical mergers.\n* **Formation channel inference is challenging:**  Distinguishing between multiple formation channels (like NSCs and AGN disks) becomes difficult when relying only on the characteristics of the mergers themselves.\n* **Mass, mass ratio, and spin are crucial:**  The mass, mass ratio, and spin of the black holes significantly influence the branching fractions for different channels.\n* **Escape velocity matters (somewhat):**  Escape velocity in NSCs is a factor in hierarchical formation, but its effect is less pronounced than other population parameters.\n* **Selection effects are important to consider:**  Careful consideration of selection effects is crucial to avoid biases in population analysis.\n\n\n**Questions for the Authors:**\n\n1.  How robust are your conclusions to the choice of the hierarchical merger branch models (e.g., NG+1G vs. NG+NG)? Could different branch assumptions significantly alter the inferred contributions of NSCs and AGN disks?\n2.  How sensitive are your results to the assumed prior distributions of the population parameters (e.g., mass, spin, mass ratio distributions)?  Could different prior choices lead to substantially different conclusions about the dominant formation channels?\n3.  Could you elaborate on the interplay between the escape velocity of the host cluster and the mass distribution of the black holes within the cluster in shaping the hierarchical merger rate?\n4.  What are the potential limitations of using a parametric population model to represent the complex dynamical processes in AGN disks and NSCs? How could future work improve the accuracy of the inference, especially considering the diversity of conditions across these environments?\n5.  Given the detected hierarchical mergers in GWTC-3, are there any specific events that highlight the significance of your findings, showing clear evidence of one channel over the other?\n\n\n**Suggestions for Related Topics/Future Research:**\n\n1. **Incorporating other formation channels:**  Investigate the contribution of other potential channels like globular clusters or young massive clusters to the hierarchical merger population.\n2. **Modeling the detailed dynamics:**  Develop more sophisticated models that incorporate the intricate dynamical interactions within AGN disks and NSCs to better understand hierarchical merger formation.\n3. **Multi-messenger observations:**  Explore the potential for combining gravitational wave data with electromagnetic or neutrino observations to further refine the inference of formation channels and host environment.\n4. **Expanding the parameter space:** Explore additional parameters, like the redshift distribution of the mergers, which might potentially refine the formation channel inference.\n5. **Self-consistent simulations:**  Develop self-consistent simulations of hierarchical mergers in both AGN disks and NSCs to validate and refine the predictions of the parametric population model.\n\n\n**Relevant References:**\n\n1.  Abbott, B. P., et al. (2023b). Physical Review X, 13(1), 011048. (This is a vital reference for understanding the current state of LIGO-Virgo-KAGRA data analyses)\n2.  Gerosa, D., & Fishbach, M. (2021). Nature Astronomy, 5(7), 749–754.  (Key paper on hierarchical mergers)\n3.  Mapelli, M. (2021). In Handbook of gravitational wave astronomy. Springer, Cham, (Review of various BH merger formation channels)\n4.  Mandel, I., & Farmer, A. (2022). Physics Reports, 955, 1–91. (Comprehensive review of binary compact object mergers)\n5.  Li, G.-P., Lin, D.-B., & Yuan, Y. (2023a). Physical Review D, 107(6), 063007. (Related work by the authors on hierarchical mergers.)\n"
    },
    "http://arxiv.org/abs/2411.09179v1": {
        "summary": "**Solar Energetic Particle Track Accumulation in Edgeworth-Kuiper Belt Dust Grains**\n\n**1. Main objective and motivation:**\n\nThe paper investigates whether Edgeworth-Kuiper Belt (EKB) dust grains can account for the high solar energetic particle (SEP)-induced track density observed in stratospherically collected interplanetary dust particles (IDPs) at 1 AU. This builds upon previous work that suggested EKB grains might transit to the inner solar system, but lacked explicit dynamical modeling incorporating all major perturbing forces. The motivation is to constrain the origin and lifetimes of these high-track-density IDPs.\n\n**2. Key methods and approaches:**\n\nThe study uses a dynamical model of interplanetary dust grain motion, incorporating solar gravity, the gravitational forces of the eight planets, solar radiation pressure, Poynting-Robertson drag, solar wind drag, and the electromagnetic Lorentz force.  The model initializes dust grains with orbital elements drawn from observed EKB object distributions.  A separate model estimates SEP track accumulation rates as a function of heliocentric distance.  The primary approach involves numerically integrating the dust grain trajectories and calculating the accumulated SEP tracks along those trajectories.  Crucially, the paper varies the assumed radial scaling of the SEP flux (r<sup>-α</sup>) to explore its impact on the track accumulation results. This allows comparison with previous work (Keller & Flynn 2022) and explores the influence of planetary perturbations.\n\n**3. Principal findings and results:**\n\nThe study finds that EKB grains can transit to 1 AU, though the probability decreases with increasing grain size.  However, assuming a standard SEP flux scaling with distance (r<sup>-1.7</sup>), the model predicts significantly lower track densities than the observed high-track-density grains.  This discrepancy is confirmed by comparing the dynamical model with an analytical model considering only Poynting-Robertson drag, which consistently predicts higher track densities.  Crucially, the paper demonstrates that planetary perturbations decrease the track density compared to a calculation without them. The presence of Mean-Motion Resonances (MMRs) with outer planets affects the amount of time grains spend at greater distances. With a shallower SEP radial distribution (r<sup>-1.0</sup>), the simulated track densities better match the observations.\n\n**4. Significance and implications:**\n\nThe study highlights the significant role of planetary perturbations in modifying the predicted SEP track accumulation in EKB grains.  The discrepancy between the model and observations under the assumed SEP radial distribution (r<sup>-1.7</sup>) underscores the need for more accurate knowledge of the radial distribution of high-Z SEPs.  The paper emphasizes the necessity of further research into the heliospheric propagation and distribution of these high-Z SEPs to constrain track accumulation in IDPs. The results also point to the potential importance of anomalous cosmic rays (ACRs) as an additional track formation source, particularly for grains from the outer EKB. Furthermore, the paper underscores the need for consideration of collisional processes in the EKB, which can affect grain lifetimes and the overall mass flux of EKB grains to 1 AU. This investigation, along with future research, is important for understanding the complex interplay between EKB dynamics, SEP propagation, and the formation of tracks in IDPs.\n",
        "insights": "This paper investigates whether Edgeworth-Kuiper Belt (EKB) dust grains can accumulate sufficient solar energetic particle (SEP) tracks to explain high-track-density interplanetary dust particles (IDPs) observed near Earth.\n\n**Key Insights and Lessons Learned:**\n\n* **EKB grains can reach Earth's orbit:**  Dynamical models show that grains of various sizes can transit from the EKB to 1 AU, although the probability decreases with size.  \n* **Planetary perturbations matter:** The inclusion of planetary perturbations in the dynamical model significantly affects the predicted track accumulation compared to models considering only Poynting-Robertson drag.  Trapping in mean-motion resonances with outer planets extends the time spent in the outer solar system, reducing track accumulation.\n* **SEP radial distribution is crucial:** The assumed radial distribution of high-Z SEPs (∝ r−1.7) does not fully account for the observed high track density IDPs. A shallower distribution (∝ r−1.0) yields better agreement with observations.\n* **Need for improved SEP model:** The paper highlights the critical need for a more accurate model of the radial distribution of high-Z SEPs in the heliosphere to better constrain the track accumulation in IDPs.\n\n**Questions for the Authors:**\n\n1.  What are the primary uncertainties in your SEP track accumulation model, and how might they be addressed in future studies?\n2.  Could anomalous cosmic rays (ACRs) contribute significantly to track accumulation in EKB grains, and how would this affect your results?\n3.  What are the implications of grain-grain collisions on the observed track density distributions, and how could you incorporate these collisions in future modeling efforts?\n4.  What are the potential contributions of high-track density IDPs from other sources (e.g., Oort Cloud comets) compared to those from the EKB?\n5.  How sensitive are your results to variations in the initial conditions of the EKB grains (e.g., initial size distribution, ejection velocity, composition)?\n\n**Suggestions for Related Topics/Future Research Directions:**\n\n1. **Incorporation of grain-grain collisions:** Develop a model that considers collisional evolution of EKB grains during their transit.\n2. **Refinement of SEP models:**  Investigate the radial dependence of the high-Z SEP flux using in-situ measurements and advanced heliospheric models.  Specifically, look at differences between proton and high-Z SEPs.\n3. **Inclusion of other high-energy particle sources:**  Quantitatively assess the contribution of galactic cosmic rays and anomalous cosmic rays to track formation in EKB grains.\n4. **Dynamical simulations including a broader range of orbital elements:** Extend the dynamical simulations to include a broader range of orbital elements for EKB grains to better represent the diversity of grain populations.\n5. **Comparison with other EKB dust influx models:**  Compare your results with other models of EKB dust influx to Earth, especially those that account for collisional processes.\n\n**Relevant References:**\n\n1.  Keller, L. P., & Flynn, G. J. (2022). Nature Astronomy, 6(7), 731–736.\n2.  Liou, J.-C., Zook, H. A., & Dermott, S. F. (1996). Icarus, 124(2), 429–448.\n3.  Moro-Mart´ın, A., & Malhotra, R. (2003). Astrophysical Journal, 125(2), 2255–2271.\n4.  Poppe, A. R. (2016). Icarus, 264, 369–381.\n5.  Poppe, A. R., Lisse, C. M., Piquette, M., et al. (2019). Astrophysical Journal Letters, 881(1), L17.\n\n\nThese references provide relevant work on interplanetary dust dynamics, SEP interactions, and the EKB, directly supporting the current study.  Additional references are readily available within the referenced literature.\n"
    },
    "http://arxiv.org/abs/2411.09112v1": {
        "summary": "**Summary of \"On the non-dissipative orbital evolution of a binary system comprising non-compact components with misaligned spin and orbital angular momenta\"**\n\n**1. Main objective and motivation:**\n\nThis paper extends previous work by Ivanov and Papaloizou (2021, 2023a,b) on the non-dissipative tidal evolution of binary systems with misaligned spin and orbital angular momenta.  The primary objective is to analyze the evolution of such systems where *both* components are non-compact and possess spin angular momentum. This allows for a more realistic modeling of binary systems like DI Her, where both stars are not point masses and their spins are significantly misaligned with the orbital angular momentum.  The motivation is to understand how tidal interactions influence orbital and spin evolution in these systems, particularly the libration or circulation of the apsidal angle near critical curves where the precession rate is zero.\n\n**2. Key methods and approaches:**\n\nThe authors develop a theoretical framework extending previous work to include two non-compact components.  They define a system of equations (25-29 and 30) governing the evolution of orbital angular momentum, spin angular momenta, and angles describing their orientations.  Key methods include:\n\n* **Formalism for non-dissipative tidal evolution:**  The formalism accounts for the effects of inertia and Coriolis forces on the tidal response, leading to a dependence of the torque on the apsidal line orientation.\n* **Analytic approximation for small spin-orbit misalignments:**  Simplifying assumptions are made for the case where the spin angular momenta are small compared to the orbital angular momentum, allowing for an approximate analytic solution. This involves averaging over short timescales.\n* **Numerical simulations:**  The theoretical framework is validated via numerical simulations using the Python SciPy routine *odeint* to solve the differential equations. This allows for exploration of a wider range of parameter space, including cases where the analytic approximations break down.\n* **Modeling of DI Her:**  The authors use stellar models derived from MESA simulations to quantify the tidal interactions in a system analogous to DI Her, providing a crucial practical application.\n\n\n**3. Principal findings and results:**\n\nThe authors find that:\n\n* **Critical curves:**  Critical curves in the parameter space exist where the time-averaged apsidal precession rate is zero, and the spin-orbit inclination remains stationary.  These curves are influenced by the misaligned spins of both components, and their location is calculated numerically.\n* **Libration and circulation:** Systems close to critical curves exhibit librational or circulatory behavior of the apsidal angle, oscillating between prograde and retrograde states, a possibility found in previous studies, but now with greater generality.\n* **Timescales:**  Different timescales govern the evolution, namely those related to apsidal precession, parallel tidal torque evolution, and perpendicular torque-induced variations of spin-orbit angles.  The relative importance of these timescales is analyzed, providing insights into the observed behavior.\n* **DI Her analysis:**  Numerical simulations, applied specifically to DI Her, demonstrate good agreement with theoretical predictions near critical curves. The simulations, however, highlight deviations from the simplified theory for parameters far from critical curves.\n\n\n**4. Significance and implications:**\n\nThe paper makes significant contributions to our understanding of binary systems with misaligned spins. The implications are:\n\n* **Improved theoretical framework:**  It presents a more comprehensive theory for non-dissipative evolution by considering two non-compact components, improving upon previous work.\n* **Insight into DI Her:**  The application to DI Her provides a case study that potentially can inform analysis of this system and similar others.\n* **Identifying critical curves:**  The identification of critical curves and the demonstration of libration/circulation behavior provides a crucial framework for understanding the dynamics of these systems, potentially explaining some observed behaviors.\n* **Future research:**  The paper paves the way for further studies, specifically, by exploring the transition from non-dissipative to dissipative tidal interactions in these complex systems, a critical area often missing from analysis of misaligned binary systems.\n\n\nThe authors successfully extend the theoretical framework, providing insights into the complex dynamics and, in particular, the behavior near critical curves, of misaligned binary systems. The results offer a valuable tool for interpreting observations like those in DI Her and offer directions for future research.\n",
        "insights": "This paper extends previous work on the non-dissipative tidal evolution of binary systems with misaligned spin and orbital angular momenta by allowing both components to be non-compact, accounting for their respective spins.\n\n**Key Insights and Lessons Learned:**\n\n* **Non-dissipative torques are present even without dissipation:**  Inertia and Coriolis forces in the tidal response create torques that influence the orbital evolution.\n* **Both rotational distortion and tidal distortion contribute:**  The evolution of spin-orbit inclination angles is driven by torques from both sources.\n* **Critical curves exist for retrograde rotation:**  When spin is small compared to orbital angular momentum, these curves exist only for systems with at least one retrograde-rotating component.\n* **Libration of the apsidal angle near critical curves:** Solutions close to critical curves can lead to oscillations between prograde and retrograde states.\n* **Complexity increases with non-compact components:**  The introduction of the second spin angular momentum makes the dynamical system more complex, requiring both analytical and numerical approaches.\n* **Different timescales govern evolution:**  The evolution is characterized by several timescales, including those related to apsidal precession, parallel torques, and perpendicular torques.\n* **Libration and circulation occur near critical curves:**  Numerical simulations show transitions between librating and circulating behavior of the apsidal angle near critical curves.  The behavior depends on the location of the system in parameter space.\n\n**Questions for the Authors:**\n\n1.  Could you elaborate on the implications of the different timescales identified for the long-term stability and evolution of the systems?\n2.  How does the relative magnitude of the spin angular momentum (compared to the orbital angular momentum) affect the observed patterns of libration and circulation?\n3.  Could the model be extended to include dissipative effects? If so, what are the implications for the evolution of the system near the critical curves?\n4.  What is the range of applicability of your simplified analytic treatment in relation to the full numerical simulations?  What are the assumptions and limitations of the analytical model?\n5.  How sensitive are the critical curves and the observed behaviors to variations in the parameters (e.g., mass ratios, stellar radii) of the binary system?\n\n**Suggestions for Related Topics/Future Research Directions:**\n\n1.  Investigate the role of general relativistic effects on the evolution of misaligned, eccentric binaries.\n2.  Extend the analysis to include the effect of magnetic fields on the spins of the stars.\n3.  Develop a detailed stability analysis for systems near critical curves, exploring the potential for chaotic behavior.\n4.  Compare the predicted evolution of spin-orbit misalignment with observations of known binary systems to test the model's accuracy.\n5.  Explore the implications of this research for understanding the formation and evolution of exoplanetary systems with misaligned planetary orbits.\n\n\n**Relevant References:**\n\n1.  Albrecht et al. (2014). *ApJ*, 785, 11\n2.  Ivanov & Papaloizou (2021).  (Original paper on misaligned binaries with one compact component).\n3.  Ivanov & Papaloizou (2023a). (Previous work extending the analysis).\n4.  Barker & O’Connell (1975). *Phys. Rev. D*, 12, 329 (Potential tidal torque paper).\n5.  Paxton et al. (2011, 2013, 2015, 2018, 2019). *ApJS* (Papers dealing with stellar models using the MESA code).\n\n\n**Note:** The provided paper's references should be consulted for more specific details and context of the referenced work.\n"
    },
    "http://arxiv.org/abs/2411.11840v1": {
        "full_text": "# Mass Transfer in Eccentric Orbits with Self-consistent Stellar Evolution\n\nKyle Akira Rocha,1, 2, 3 Rachel Hur,1, 4 Vicky Kalogera,1, 2, 3 Seth Gossage, Konstantinos Kovlakas,9, 10 Jeff J. Andrews,5, 6 Simone S. Bavera,7, 8 Max Briel,7, 8 Tassos Fragos,7, 81, 3 Meng Sun,1 Zoheyr Doctor,1 Matthias U. Kruckow,7, 8 Devina Misra,7, 11 Zepei Xing,7, 8 and Emmanouil Zapartas12, 13\n\n1Center for Interdisciplinary Exploration and Research in Astrophysics (CIERA), 1800 Sherman, Evanston, IL 60201, USA\n\n2Department of Physics & Astronomy, Northwestern University, 2145 Sheridan Road, Evanston, IL 60208, USA\n\n3NSF-Simons AI Institute for the Sky (SkAI), 172 E. Chestnut St., Chicago, IL 60611, USA\n\n4The Department of Physics, 5720 South Ellis Avenue, Chicago, IL 60637\n\n5Department of Physics, University of Florida, 2001 Museum Rd, Gainesville, FL 32611, USA\n\n6Institute for Fundamental Theory, 2001 Museum Rd, Gainesville, FL 32611, USA\n\n7Départment d’Astronomie, Université de Genève, Chemin Pegasi 51, CH-1290 Versoix, Switzerland\n\n8Gravitational Wave Science Center (GWSC), Université de Genève, CH1211 Geneva, Switzerland\n\n9Institute of Space Sciences (ICE, CSIC), Campus UAB, Carrer de Magrans, 08193 Barcelona, Spain\n\n10Institut d’Estudis Espacials de Catalunya (IEEC), Carrer Gran Capità, 08034 Barcelona, Spain\n\n11Institutt for Fysikk, Norwegian University of Science and Technology, Trondheim, Norway\n\n12Institute of Astrophysics, FORTH, N. Plastira 100, Heraklion, 70013, Greece\n\n13IAASARS, National Observatory of Athens, Vas. Pavlou and I. Metaxa, Penteli, 15236, Greece\n\n# ABSTRACT\n\nWe investigate Roche lobe overflow mass transfer (MT) in eccentric binary systems between stars and compact objects (COs), modeling the coupled evolution of both the star and the orbit due to eccentric MT (eMT) in a self-consistent framework. We implement the analytic expressions for secular rates of change of the orbital semi-major axis and eccentricity, assuming a delta function MT at periapse, into the binary stellar evolution code MESA. Two scenarios are examined: (1) a simplified model isolating the effects of eMT on stellar and orbital evolution, and (2) realistic binary configurations that include angular momentum exchange (e.g., tides, mass loss, spin-orbit coupling, and gravitational wave radiation). Unlike the ad hoc approach of instant circularization that is often employed, explicit modeling of eMT reveals a large fraction of binaries can remain eccentric post-MT. Even binaries which naturally circularize during eMT have different properties (donor mass and orbital size) compared to predictions from instant circularization, with some showing fundamentally different evolutionary outcomes (e.g., stable versus unstable MT). We demonstrate that a binary’s initial mass ratio and eccentricity are predictive of whether it will remain eccentric or circularize after eMT. These findings underscore the importance of eMT in understanding CO-hosting binary populations, including X-ray binaries, gravitational wave sources, and other high-energy transients.\n\n# Keywords\n\nAstronomical simulations (1857); Binary stars (154); Close binary stars (254); Compact binary stars (283); Interacting binary stars (801); Compact objects (288); Black holes (162); Neutron stars (1108); Gravitational wave sources (677); Stellar evolutionary models (2046); Stellar populations (1622)\n\n# 1. INTRODUCTION\n\nBinary stellar interactions produce a wide array of high-energy astrophysical phenomena, including supernova explosions, X-ray binaries (XRBs), gravitational wave (GW) sources, and exotic stellar objects such as blue stragglers, hot subdwarfs and barium stars (for reviews see; e.g., Bailyn 1995; Heber 2009; Langer 2012; Tauris & van den Heuvel 2023; Marchant & Bodensteiner 2024; Wang & Ryu 2024). Primary among these interactions is mass transfer (MT) via Roche-lobe overflow (RLO), which has long been understood as integral.\n\n# 2\n\nin determining the evolution and ultimate fate of bi- nary systems (Kuiper 1941; Paczy´nski 1971; Eggleton 1983; Webbink 1984). The exchange of energy and an- gular momentum during RLO MT drives orbital evolu- tion, producing a plethora of complex evolutionary se- quences and phenomena (e.g., Lubow & Shu 1975; Kolb & Ritter 1990). It is through this lenses that we in- terpret Low- and High-mass XRBs (e.g., Bahramian & Degenaar 2023; Kretschmar et al. 2019; Fornasini et al. 2023), binary compact object (CO) mergers detected by the LIGO-Virgo-KAGRA collaboration (Abbott et al. 2023), transients such as supernovae with evidence for circumstellar interaction (e.g., Moriya et al. 2015; Zhu et al. 2024), wide binaries hosting quiescent COs dis- covered with Gaia (e.g., Andrews et al. 2022; El-Badry et al. 2022, 2023a,b; Gaia Collaboration et al. 2024), and gravitation wave sources which will be detectable by the Laser Interferometer Space Antenna (LISA) mission (e.g., Lamberts et al. 2019; Tang et al. 2024). Although extensively studied for over five decades, numerical mod- els for binary evolution due to RLO MT have primar- ily considered circular orbits, neglecting eccentricity, a fundamental orbital property for many binary systems observed in nature.\n\nEccentric orbits are abundantly observed in both pre- and post-MT binary systems; understanding how ec- centric orbits may evolve through RLO MT is then paramount to understanding the nature of such systems. During main sequence (MS) evolution, many binaries are observed to have significantly eccentric orbits, which may provide both clues to their formation mechanisms and have consequences for their future evolution (Math- ieu 1994; Geller et al. 2019; Mu˜noz & Lithwick 2020; D’Orazio & Duffell 2021; Hwang et al. 2022; Lubow 2022; Bashi et al. 2023; Lai & Mu˜noz 2023; Siwek et al. 2023; Hu et al. 2024). Just prior to the onset of MT, el- lipsoidal variables in the Large Magellanic Clouds retain significant eccentricity, in tension with standard tidal theory (e.g., Nie et al. 2017). High-mass X-ray binaries (HMXBs) hosting COs are observed in eccentric orbits (e.g., Raguzova & Popov 2005; Neumann et al. 2023; Fortin et al. 2023) and are expected to evolve into RLO MT when the donor leaves the MS evolution while still eccentric (van den Heuvel 2019). Finally, post-MT bi- naries hosting blue stragglers, barium, S-type stars and some post-AGB systems are observed to be in eccen- tric orbits (e.g., Geller et al. 2009; Milliman et al. 2014; Gosnell et al. 2015; Milliman et al. 2016; Van der Swael- men et al. 2017; Oomen et al. 2018; Geller et al. 2021; Escorza & De Rosa 2023; Nine et al. 2024; Linck et al. 2024), suggesting that a number of systems may gain or retain their eccentricity through RLO MT.\n\nAlthough well motivated by observations, eccentric RLO MT is not trivially implemented into standard bi- nary evolution calculations due to: (i) the commonly adopted Roche lobe model used to determine MT condi- tions (Eggleton 1983; Ritter 1988; Kolb & Ritter 1990) may not apply in an eccentric orbit, as the resulting MT interactions may require adoption of results from hydrodynamical simulations (e.g. non-conservative MT and re-accretion; Lajoie & Sills 2011; Saladino & Pols 2019), (ii) the quantitative effects of RLO MT events on the long-term (secular) orbital evolution are challenging to calculate, depend on assumptions for MT conditions along the orbit, and analytical expressions are needed for population studies (e.g., Sepinsky et al. 2007b, 2009; Dosopoulou & Kalogera 2016; Hamers & Dosopoulou 2019, and references therein). Therefore, in detailed bi- nary evolution simulations eccentricity is often not ac- counted for in MT phases. Instead, binary orbits are either assumed to be circular at the Zero Age Main Se- quence (ZAMS) of the binary system or, if later in the evolution MT is encountered (at periapse) for eccentric binaries, then an ad hoc assumption of instantaneous circularization is made (e.g., Hurley et al. 2002; Naoz et al. 2016; Ivanova et al. 2005; Eldridge et al. 2017; Giacobbo et al. 2018; Sun & Arras 2018; Breivik et al. 2020; Marchant et al. 2021; Sun et al. 2021; Rodriguez et al. 2022; Fragos et al. 2023; Simaz Bunzel et al. 2023; Sun & Mathieu 2023; Andrews et al. 2024; Sun et al. 2024, and others).\n\nIn this work, we model the secular effects of eccentric mass transfer (eMT) on binary orbital evolution, using the 1D stellar evolution code Modules for Experiments in Stellar Astrophysics (MESA, version 11701) (Paxton et al. 2011, 2015, 2013, 2018, 2019) along with the MESA software development kit (version 20190503) (Townsend 2020). We also include other factors that impact mass and angular momentum evolution, such as tides, stellar winds, magnetic braking, and gravitational waves. Pre- vious theoretical work involved deriving the proper secu- lar effects of RLO MT in eccentric binary systems with- out the simultaneous evolution of the stellar compan- ion (e.g., Sepinsky et al. 2007b; Hamers & Dosopoulou 2019). We expand on this work, modeling the simulta- neous evolution of both the star and orbit due to eMT.\n\nIn Section 2 we detail our choices for orbital evolution due to eccentric MT and implementation into MESA. In Section 3 we present a small parameter study with sim- plified models, to isolate the effects of eccentric MT. In Section 4 we present our fiducial eccentric MT models with astrophysical initial conditions. Finally, in Sec- tion 5 we discuss our findings and summarize with con- cluding remarks.\n\n# 2. METHODS\n\n# 2.1. Treatment of Eccentric Mass Transfer\n\nWe consider a binary with primary mass M1, a secondary mass M2, an orbital semi-major axis a, and an eccentricity e. The total orbital angular momentum, Jorb, is:\n\nJorb = M1M2 G a (1 - e2), (1)\n\nwhere G is the gravitational constant. The binary orbital period, Porb, is related to the semi-major through Kepler’s third law. The time derivative of Equation 1 can be written as:\n\nJ˙orb = ˙M1 M1 + ˙M2 M2 - 2M1 ˙M1 + M2 + 2a-1 - e2. (2)\n\nIn the classical case of a circular orbit with fully conservative RLO MT (where all transferred mass is accreted), the total mass is conserved with ˙M2 = - ˙M1; and the total orbital angular momentum is conserved, with J˙orb = 0. Then, Equation 2 can be solved explicitly for the rate of change in the semi-major axis:\n\n˙a = 2a(q - 1) ˙M1, where we define q = M1/M2 as the mass ratio. As expected, the orbit shrinks when q > 1 and expands when q < 1.\n\nIn the case of an eccentric orbit, more complex methods are required to derive expressions for the secular rate of change of orbital elements ˙a and ˙e. Such derivations have been carried out using variations of different formalisms (e.g., Sepinsky et al. 2007b, 2009, 2010; Dosopoulou & Kalogera 2016; Hamers & Dosopoulou 2019, and references therein). In this study, we incorporate the formalism from Sepinsky et al. 2009 which is only analytical treatment currently available that can account for non-conservative MT and can be applied to large-scale detailed binary evolution simulations.\n\nWe adopt Equations (18) and (19) from Sepinsky et al. (2009) which provide the secular rates of change for the semi-major axis a and eccentricity e as follows:\n\ndasec = (1 - e2)1/2 M0 ˙M0 dt = πM1(1 - e) r|A1,P| + γq r|A2| cos ΦP + (γq - 1)(1 - e2) + (1 - γ)(μ + 2)(1 - e2) + 1, (3)\n\nIn this study, we model CO accretors for which we assume A2/a ≪ 1 which implicitly accounts for ΦP, following the simplified cases described in Sepinsky et al. 2007b. Instead of assuming the star is exactly Roche-filling at all times during MT, we explicitly calculate the MT rate (Section 2.3.1). The MT efficiency γ is assumed to be conservative up to the Eddington limit which is also explicitly calculated during evolution (Section 2.3).\n\nThe advantage of these secular evolution equations is that they are analytical while also accounting for non-conservative MT, and they are derived under the following simplifying assumption: RLO MT occurs as a delta function at periapse with a MT rate ˙M1 = ˙M0 δ(υ), where ˙M0 is the instantaneous MT rate, δ is the Dirac delta function, and υ is the true anomaly. For a complete derivation and a list of all assumptions and their implications, we refer the reader to Sepinsky et al. 2007b, 2009.\n\nWe note that while Hamers & Dosopoulou 2019 extend beyond the delta function MT approximation with a phase dependent MT rate, their formalism is limited to conservative RLO MT only. Therefore, we use the equations by Sepinsky et al. 2009, as many binary systems are expected to undergo phases of non-conservative MT which significantly impacts their evolution (e.g., Marino et al. 2017; Ziolkowski & Zdziarski 2018).\n\n# 2.2. Implementation in MESA\n\n# 2.3. MESA Binary and Stellar Evolution Physics\n\nWe incorporate the equations of secular orbital evolution due to eccentric MT into MESA by combining individual sinks (e.g. mass loss) and sources (e.g. mass accretion) of angular momentum transport. These are assumed to be decoupled, such that *J˙orb* can be determined by a linear combination of individual effects (Paxton et al. 2015):\n\n*J˙orb = J˙gr + ˙ml + J˙mb + J˙ls* (5)\n\nwhere subscripts denote angular momentum changes due to gravitational wave radiation (*˙gr), mass loss (˙ml), magnetic braking (J˙mb), and spin-orbit coupling (J˙ls). Within J˙ml, are contributions from circular non-conservative RLO MT and wind mass loss. We replace the contribution from circular non-conservative RLO MT, with the contribution from eccentric MT by reparameterizing ˙eMT and ˙eMT* in terms of the orbital angular momentum via Equation 2.\n\nSimilar to Equation 5, we calculate the rate of change of orbital eccentricity, *˙orb*, as a linear combination of decoupled effects:\n\n*e˙orb = ˙gr + ˙tidal + ˙eMT* (6)\n\nwhere *˙gr is from gravitational wave radiation, ˙tidal indicates tidal circularization, and ˙eMT is due to non-conservative eMT from Equation 4. Models which circularize (e = 0) have ˙eMT = 0* since the equations of Sepinsky et al. 2009 are formally invalid in this regime.\n\n# 2.3.1. Calculating the Mass Transfer Rate\n\nIn the secular orbital evolution equations, we must determine the magnitude of the delta function MT rate at periapse: *˙0*. We use the eccentric orbit-averaged MT rate adapted from Ritter (1988); Kolb & Ritter (1990) as implemented in the MESA binary module (Paxton et al. 2015). The MT rate is calculated at instantaneous points along the orbit assuming the standard Roche geometry (Eggleton 1983):\n\n*RL = D(υ)0.6q2/3 + ln(1 + q1/3)* (7)\n\nwhere *D(υ) = a(1 − e2)/(1 + e cos υ) is the distance between the mass centers of the two objects as a function of the mean anomaly. Although deviations from this Roche geometry are known to occur in eccentric orbits, Sepinsky et al. 2007a showed they are relatively small on the order of a few percent for a large range of q*. Additionally, other hydrodynamical effects may complicate the picture in determining an accurate MT rate in eccentric orbits (e.g., Lajoie & Sills 2011; Davis et al. 2013; Saladino & Pols 2019), as well as detailed MT stream trajectories (Sepinsky et al. 2010). Due to these uncertainties, we leave more complex treatments of the MT to future work. We discuss this more in Section 5.\n\n# 2.4. POSYDON Binary Population Synthesis Physics\n\nTo obtain astrophysically motivated parameters for binaries hosting COs, we perform an astrophysically motivated BPS simulation with the state-of-the-art POSYDON framework (Fragos et al. 2023; Andrews et al. 2024). Our treatment of BPS physics closely follows that of Rocha et al. 2024, which showed agreement with many observed properties of the Galactic Be X-ray binary population. However, we make one major change to their input physics, using the supernova (SN) remnant prescription of Sukhbold et al. 2016 which allows for the formation of low-mass BHs. Additionally, we assume a burst (instead of constant) star formation history and evolve all binaries to 10 Gyr to sufficiently explore the range of binary configurations which experience eMT. In the following, we reiterate the other key physics assumed in our POSYDON BPS model, and refer a reader to Rocha et al. 2024 for a complete description.\n\nInitial binary component masses and orbital configurations are drawn from observationally motivated distributions: primary masses are drawn from a Kroupa power-law (Kroupa 2001) with α = 2.3 with M1/M⊙ ∈ [7−120], secondary masses are drawn uniformly q ∈ [0, 1] (Sana et al. 2013) with a minimum of 1 M⊙, initial Porb/d ∈ [1 − 103.5] following a flat-in-log distribution in the range [1-0.35] days following Fragos et al. 2023, and eccentricities are all initially zero with stellar spins synchronized to the orbital period.\n\nCommon envelope evolution is modeled with the αCE − λCE formalism (Webbink 1984; Livio & Soker 1988), where we set the fraction of orbital energy used to unbind the envelope αCE = 1 and the binding energy parameter λCE is calculated directly from stellar profiles from our binary MESA simulations in POSYDON.\n\nSupernovae explosions are modeled using the remnant prescription of Sukhbold et al. 2016 for core-collapse SNe (CCSNe), and the remnant prescription of Podsiadlowski et al. 2004 for electron-capture SNe (ECSNe) for He core masses between 1.4–2.5 M⊙. NSs are given natal kicks resulting from the SN explosion drawn from a Maxwellian with a dispersion of σCCSNe = 265 km s−1 (Hobbs et al. 2005), and a dispersion of σECSNe = 20 km s−1 (Giacobbo & Mapelli 2019). BHs receive natal kicks with the same dispersion σCCSNe, scaled by the BH mass MBH with 1.4 M⊙/MBH, following Fragos et al. (2023).\n\n# 2.4.1. Selecting Eccentric Binary Initial Conditions\n\nSince some fraction of binaries hosting COs may naturally circularize from tidal evolution before initiating eMT, we select a subset of binaries from our POSYDON BPS model (Fragos et al. 2023; Andrews et al. 2024). We take binary parameters (M1, M2, Porb, and e) at the onset of RLO (oRLO)1 for systems with e > 0.05 (representing orbits that we consider as “eccentric”) as initial conditions for our eMT MESA simulations to further investigate their evolution. Within POSYDON, oRLO in an eccentric orbit is determined when the star’s radius is 95% of the Roche lobe radius Equation 7. We implicitly account for the evolutionary state of the donor at oRLO in POSYDON (e.g. during post-MS expansion) within the setup of our MESA simulations (see Section 2.3).\n\nIn practice, the population of CO and star binaries undergoing eMT will depend strongly on the prior MT physics and SN model used in the BPS. Therefore, the comparison in this work between eMT and the standard modeling choice adopted in BPS (Section 2.5) serves as a concrete analysis of the impact of eMT modeling on CO-hosting binaries.\n\n# 2.5. Comparison to Instant Circularization\n\nBinaries which initiate MT in eccentric orbits are almost always assumed to efficiently circularize due to strong tides that are expected in tight orbits or with evolved, radially extended stellar components (e.g., Verbunt & Phinney 1995).\n\nThus, the ad hoc assumption of instantaneous circularization has been adopted throughout binary evolution simulations, where the initially eccentric orbit (with semi-major axis a and eccentricity e) is instantly made circular with either: (i) the new orbital separation, ac, being set equal to the periapse separation of the original orbit ac = a(1 − e), or (ii) applying conservation of orbital angular momentum ac = a(1 − e2).\n\nTo estimate the impact of our self-consistent treatment of eMT, we run a set of MESA simulations in both the original eccentric orbital configuration using Equations 3 and 4, and the instantly circularized approximation (i), using the periapse separation ac = a(1 − e). We present these comparisons in Section 4.\n\n# 3. PARAMETER STUDY WITH SIMPLIFIED ECCENTRIC MASS TRANSFER\n\nTo isolate the effects of eMT, we first run a suite of MESA simulations with neglecting certain physical effects compared to our default evolutionary models (described in Section 2.3; see also Fragos et al. 2023; Andrews et al. 2024). These simplified eccentric mass transfer (s-eMT) simulations neglect: (1) donor rotation, (2) tidal cou-\n\n1 We choose a threshold between circular and eccentric binaries of e = 0.05 since this more closely resembles the precision of observational measurements to distinguish such systems (e.g., Fortin et al. 2023).\n\n# 6\n\n|Case A|Case A/B|Case A/B/C|Case A/B/C/BB|Case B/Cei|\n|---|---|---|---|---|\n|Stable MT|Unstable MT|Initial RLOF|Initial Conditions|Not converged|\n\nModel: s-eMT\n\n0.8\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n2 4 6 8 10 12 14\n\nPorb,i [d]\n\neFigure 1. Results from our s-eMT binary simulations with 20 M⊙ donors and 10 M⊙ BHs in various orbital configurations in the Porb−e plane, where all orbital evolution is due to the effects of non-conservative eMT (Section 3). The left panel shows the characteristic MT history of our binary simulations (see legend and text), and the right panel shows the time evolution of a subset of models where thick (thin) lines correspond to the MS (post-MS) evolution of a given model (time evolution of gray models are not shown for clarity). After MT, systems with circularized orbits (e = 0) are shown in blue, while those with non-zero eccentricities are shown in orange.\n\npling between the star and orbit, (3) tidal circulariza- dergo multiple phases of RLO are denoted by multiple letters separated by slashes (e.g. we denote Case A followed by Case B as Case A/B) as introduced in Fragos et al. (2023).\n\nIn the left panel of Figure 1, all systems in our simplified model grid go through multiple phases of stable MT (indicated by squares), except for the circular model at Porb,i = 1 day which becomes dynamically unstable (shown by a diamond) while on the MS. Systems which have small initial periapse separations (ei ≳ 0.2 or Porb,i ≲ 10 days) go through Case A MT, often followed by a second phase of Case B MT initiated by post-MS expansion of the donor, and in systems with the highest eccentricity, Case C into Case BB MT with an evolved helium-rich donor. These MT phases are consistent with other work investigating similar mass ratios in circular configurations (e.g., Qin et al. 2019; Marchant et al. 2021; Gallegos-Garcia et al. 2021), although the orbital evolution is altered due to our accounting for eMT.\n\nIn the right panel of Figure 1 we show how binaries with different initial conditions evolve during eMT. We identify two types of evolutionary sequences based off the final orbital configuration of the simulations (prior to the core-collapse of the donor): (1) binaries which circularize due to RLO MT (blue), (2) binaries which remain eccentric post-MT (orange). Systems with ini-\n\n# Figure 2\n\nTime evolution from oRLO of the orbital period (first row), eccentricity (second row), mass ratio (third row), RLO MT rate (fourth row), the periapse separation normalized by the value at oRLO (fifth row), and the donor and CO masses (last row), for a subset of our s-eMT models with a 20 M⊙ donor and 10 M⊙ BH shown in Figure 1. The colors in the left column indicate various initial eccentricities and various initial orbital periods in the right column. In the mass ratio (q = M1/M2) we have indicated with horizontal lines at q = 1 (black) and q = 0.76 (gray dashed) approximate transition points in the sign of a˙eMT from Equation 8 and ˙eMT from Equation 9. Red points in the q panels denote when each model reaches TAMS (thick to thin line transitions in Figure 1), which occurs at different times due to the different rp,i for each model.\n\nInitial eccentricities lower (higher) than e ≃ 0.35, end up circularizing (remain eccentric) by the end of the simulation. We note this circularization is due to the dynamics of eMT, as tides are not included in these simplified runs. In our parameter study this bifurcation between circularized or eccentric orbits post-MT is primarily a function of ei, although we expect this behavior may be sensitive to the mass ratio and Porb,i.\n\nIt may also be seen with the time evolution in the Porb−e plane that all models follow a similar qualitative behavior: MT initially drives the orbit to shrink (and circularize), but may be followed by a phase of orbital expansion and increasing eccentricity, appearing as a “hook” in the right panel of Figure 1. This behavior can be understood primarily through the evolution of the mass ratio, which has a significant impact on the sign of both ˙eMT and ˙eMT. In the limit of conservative eMT, Sepinsky et al. 2007b showed the transitional mass ratio, qcrit, separating positive and negative rates of change for orbital parameters were found to be well approximated by their Equation (41) for ˙eMT:\n\nqcrit ≃ 1 − 0.4e + 0.18e2,\n\nand their Equation (42) for ˙eMT:\n\nqcrit ≃ 0.76 + 0.012e.\n\nTo demonstrate this, in Figure 2, we show the time evolution of our s-eMT simulations from oRLO of Porb, e, q, MT rate ( ˙M), rp normalized by the periapse separation at oRLO (rp,oRLO), and the component masses (Md solid lines, MCO dashed lines), for models with varying initial eccentricity (left panel) and initial orbital period (right panel). The line color emphasizes different initial.\n\n# 4. FULL ECCENTRIC MASS TRANSFER BINARY SIMULATIONS\n\nWith the characteristic effects of eMT alone established in Section 3, we now run a suite of binary simulations taking into account an expanded set of physical effects, as considered in the POSYDON models: stellar rotation, tidal coupling between the stellar spin and orbital motion, mass and angular momentum loss via stellar winds, as well as angular momentum loss from magnetic braking and gravitational wave radiation.\n\nWe consider a population of two hydrogen-rich stars with relatively massive primaries with typical initial conditions (see Section 4.1) which evolves through to the formation of the population’s first COs (NSs or BHs). Following CO formation, most surviving binaries have eccentric orbits due to both mass loss and potential natal kicks imparted to the COs at core collapse. We follow the evolution of systems through their detached phase (details in, Fragos et al. 2023; Andrews et al. 2024) until RLO is initiated at periapse. At this point we simulate the population in two different ways for comparison: (i) through eMT but this time accounting for the expanded set of physics as aforementioned, and we call these models full eccentric mass transfer (f-eMT) models, and (ii) with the standard BPS ad hoc assumption of instant circularization. This allows us to assess the impact of f-eMT on a realistic, typical population of binaries harboring one compact object and a non-degenerate companion and compare results with the instant circularization assumption that is often made.\n\nFor our analysis, we separate f-eMT binaries into two broad outcomes: the population that remains eccentric post-MT in Section 4.2 and those that naturally circularize in Section 4.3. The former outcome is clearly not produced in BPS to date, as systems are forced into circularization. The latter outcome produces circularized systems through eMT; we directly compare these to the circular population from the instant-circularization simulations (Section 2.5).\n\n# 4.1. Eccentric Binary Population Properties\n\nFrom our astrophysical POSYDON BPS simulation (Section 2.4), we select models which are instantaneously circularized in POSYDON with a non-degenerate star and CO companion in eccentric orbits during their detached phase post-SN (Section 2.4.1). From our initial binary population of 4 × 106 binaries, 16% survive interactions.\n\n# Initial Conditions\n\n# Ecc. ef > 0.05NNFinal ValuesCirc. ef < 0.05\n\n|250|Model: f-eMT|200|↑ 872|300|\n|---|---|---|---|---|\n|200| |150| |200|\n|150| |100| |50|\n|100| |50| |100|\n|50| |0| |0|\n|0|0|10|20|30|\n|40|0|0|10|20|\n|30|0|−1|0|1|\n\n# Figure 3\n\nOne-dimensional distributions of donor star mass (top left), CO mass (top middle), mass ratio between donor and CO mass (top right), orbital period (bottom left), eccentricity (bottom middle), and periapse distance (bottom right) for initial binary parameters (filled histograms) and final values (empty histograms) from our binary f-eMT MESA simulations, including secular orbital evolution due to eMT, with self-consistent determination of the MT rate, and additional sources of angular momentum loss (stellar winds, tides, magnetic braking, and gravitational wave radiation; see Section 2.3). Binaries which remain eccentric post-MT are shown in orange and naturally circularized systems in blue, where initial conditions are drawn from an astrophysical POSYDON BPS model (see Section 2.4.1). The end of a binary simulation can be triggered by the donor’s imminent SN, WD formation, or the onset of unstable MT (not shown). The eccentric post-MT binaries constitute 33% of all our astrophysically sampled models.\n\nFrom the primary’s SN to form binaries containing a CO and a star, hosting either NSs or BHs. Of all the CO-hosting binaries, we find 81% enter RLO at some point in their evolution. About 3/4 (72%) of these RLO systems have residual eccentricity at oRLO (e > 0.05, Section 2.4.1), which may be considered nominally as eccentric orbits (we take a total of 1791 pair models for direct comparison between f-eMT and instant-circularization). Thus, a majority of detached binaries which subsequently undergo MT between a CO and a star in our fiducial BPS model would be subjected to the ad hoc treatment of instantaneous circularization at oRLO, neglecting eMT outcomes.\n\nIn Figure A1 we show one-dimensional distributions of the binary population which undergo eccentric RLO from POSYDON (black), and the initial 2000 systems we randomly sample for our MESA models with f-eMT (orange). Our binary models cover a wide range of donor masses (Md/M⊙ ∈ [1−50]), CO masses with NSs and BHs (MCO/M⊙ ∈ [1.1−34]), and orbital configurations (Porb/d ∈ [2−10]). The top right panel shows the resulting range of mass ratios with two prominent peaks at q ≃ 1 − 2 from predominantly BH-hosting binaries, and q ≃ 3 − 8 with NS-hosting binaries. The most common configuration for a CO and star binary to initiate eMT has a Porb of 10 days, a modest eccentricity e ≃ 0.15, with a 1.2 M⊙ NS and 7 M⊙ donor. The overlap of our samples and the underlying astrophysical population show good agreement within the Poisson errors (vertical bars), verifying that our subset of MESA models is representative of the astrophysical BPS.\n\n# 4.2. Binaries that Remain Eccentric Post-MT\n\nWe first focus on binaries which remain eccentric post-MT with ef > 0.05, as such systems cannot form under the assumptions of instantaneous circularization. These systems demonstrate that tides and/or eMT itself do not efficiently circularize all binaries. In Figure 3, we...\n\nshow the initial conditions (filled histogram) and final properties (empty histograms) of this eccentric post-MT population in orange, comprising 33% of the astrophysical population. In all these binaries, the MT remains stable, with most of them (95%) initiating MT during the donor’s post-MS evolution (Case B MT).\n\nThis population has low qi (upper right panel, orange filled histogram), and is therefore dominated by BH-hosting binaries with high mass donors (Md > 10 M⊙). Binaries with low mass ratios require less MT to reach the regime where e˙eMT changes sign from negative to positive (q ≃ 0.76, Equation 9), thereby entering a regime where their eccentricity increases rather than reduces, avoiding circularization. Since MT is initiated post-MS, it proceeds rapidly (on a thermal timescale) leading to non-conservative MT (inefficient accretion), explaining the relatively small changes in CO masses (top center panel of Figure 3). This MT history produces stripped, helium-rich donors with two peaks in the final mass distribution: Md ≲ 1 M⊙ forming white dwarfs (WDs), and a wider peak around Md ≃ 6 M⊙, which are massive enough to experience core collapse.\n\nThe orbital configurations of the eccentric post-MT population are characterized by wider orbits (Porb,i/d ≃ 10 − 104, and log10(rp/R⊙) > 1.5) with a nearly flat initial eccentricity distribution. At the population level, there is relatively little change between the initial and final orbital parameter distributions, although individual binaries can experience significant evolution in both Porb and e over time.\n\nTo demonstrate this, we show in Figure 4 the correlated evolution in the Porb−e plane (bottom three panels), selected by their initial mass ratio (corresponding grey bins in the top panel), where orange and blue lines correspond to the eccentric and circularized populations, respectively (as in Figure 3) with starting points of evolution for BH- and NS- hosting binaries marked by circles and pluses, respectively. Similar to the evolutionary sequences identified for our simplified s-eMT models in Section 3, the f-eMT models exhibit phases of both orbital expansion/shrinking and eccentric circularization/pumping primarily understood through the evolution in q.\n\nWe find that binaries with low qi ≃ 1 (predominantly BH-hosting), remain eccentric throughout their evolution, even post-MT. The reason is that at these mass ratios the values of ˙eMT and ˙eMT promptly turn positive with very little MT, leading to movement toward the upper right corner of the Porb−e plane. This correlated movement causes BH-binaries to end their evolution at larger orbital periods (Porb ≃ 102 − 104 days) with more eccentric (e ≃ 0.2 − 0.8) orbits. Binaries with larger qi ≳ 2 − 3 (similar to the s-eMT models in Figure 1) initially have negative ˙eMT and ˙eMT, with only highly eccentric binaries escaping complete circularization.\n\n# 4.3. Binaries that Naturally Circularize\n\nlarization. We note that overall, binaries which remain eccentric post-MT but have large qi end their evolution in both tighter and wider orbits, but generally experience eccentricity dampening, where the end of MT influences ef (see binaries with “hook” evolution in the center Porb−e panel of Figure 4).\n\nTo understand how models that remain eccentric post-MT (ef > 0.05, shown as orange data in Figures 3 and 4) increase or decrease their eccentricity, in Figure 5 we present the distribution of fractional changes in e from initial to final values through eMT, (ef − ei)/ei, for binaries hosting BHs (gray) and NSs (purple). The fractional change here is meant to quantify the degree to which a binary system’s eccentricity falls above or below its initial value in our f-eMT models.\n\nBinned by their initial eccentricity, we identify a correlation in BH-hosting systems where low ei trends towards greater positive fractional changes (i.e., trends towards ef > e). Moving towards greater e, we see this fractional change decreases towards zero and slightly negative at the greatest initial eccentricities (ei ≳ 0.8).\n\nchanges in their eccentricity through eMT. The variance in the fractional change in e decreases significantly with increasing e, with 90% of binaries having fractional changes ≲ ±25% for ei > 0.8. NS-hosting binaries trend toward smaller eccentricities post-MT (i.e., ef < e), which may be seen in the marginal distributions showing the overall trends for BH- and NS-hosting binaries on the right side of Figure 5. This is expected from the larger qi of NS-hosting systems, but a few eccentric pumping outcomes (i.e., ef > e) occur at moderate eccentricities for this subpopulation. NS-hosting binaries which remain eccentric post-MT are more prevalent at higher ei ≳ 0.6, as they can undergo more MT before circularization (q thresholds from Equation 9).\n\nMotivated by the trends identified in the Porb−e plane (Figure 4), we investigate the role of the initial mass ratio, q, on determining outcomes of f-eMT simulations. We show in Figure 6 our eMT models in the q−ei plane, where we find a clear bifurcation between the eccentric and circularized post-MT populations. We perform a polynomial fit to this bifurcation, characterized as an eccentricity, ecrit, that is a function of the mass ratio q:\n\necrit ≃ − 0.210 − 0.729 q − 0.1444 q2 − 0.0093 q3 (10)\n\nderived from simulations in the range qi ∈ [0, 5.5]. Separating the CO populations, 64% of the BH-hosting binaries remain eccentric post-MT compared to only 5% for NS-hosting binaries.\n\nThe bifurcation in qi−ei is evidence that the evolution of our f-eMT models is primarily impacted by the secular orbital evolution from eMT (from Equation 3 and Equation 4) compared to the other sources of angular momentum exchange (stellar winds, tides, magnetic breaking, and gravitational waves). Applying Equation 10 to our s-eMT models (Section 3) with qi = 2, the predicted bifurcation eccentricity ecrit ≃ 0.4 agrees reasonably well with the results in Figures 1 and 2. The shape of Equation 10 can be understood to first order, as determined by the competing timescales of changes in eccentricity (τe ≃ e/ ˙) and mass ratio (τMT ≃ M/ ˙ ,e M which can be seen in the prefactor of Equation 4). Binaries with higher ei can undergo more MT before complete circularization, reaching low enough q values to exhibit eccentric pumping (the “hook” evolution in the Porb−e plane from Figure 4). Although, analytically deriving this relation is non-trivial due to the inclusion of non-conservative MT and other effects simultaneously evolved within MESA. The few outlier BH models that remain eccentric post-MT but lie in the high qi ≃ 3 regime (expected to circularize), remain eccentric due to extremely strong stellar winds from high mass donors (≳ 20 M⊙), which significantly alter their orbit and mass ratio.\n\n# 4.3.1. Divergent Evolution\n\neief < 0.05 (circ.) BH Model: f-eMT ef > 0.05 (ecc.) NS\n\n1.0\n\n0.8\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n0 2 4 6 qi\n\nFigure 6. Initial conditions for our f-eMT models in initial q − e plane, color-coded by models that either naturally circularize (blue) or remain eccentric (orange) post-MT as described in Figure 3. Markers indicate binaries hosting BHs (circles) and NSs (pluses). A bifurcation eccentricity, ecrit, which distinguishes binaries that circularize from those that remain eccentric post-MT, is indicated by the black line. A corresponding fitting function is provided in Equation 10. For BH-hosting binaries, 64% end up remaining eccentric post-MT, while 36% naturally circularize.\n\nWe now investigate the subset of binaries that naturally circularize due to eMT (blue distribution in Figure 3), which make up 66% of all our binary simulations sampled with astrophysical initial conditions. These systems are those that can be directly compared to the circular systems produced in the standard BPS population through ad hoc instant-circularization. These naturally circularized binaries from the f-eMT models generally have large initial mass ratios (qi ≳ 4, which are predominantly NS-hosting binaries), lower ei (BH-hosting binaries with small natal kicks), or a combination of both features. This is evident in the Porb−e evolution in Figure 4 and in the q−ei plane from Figure 6. The effects which cause binaries to circularize are described in detail by the evolution in the Porb−e plane in Figure 4 and the bifurcation in the qi − ei plane in Figure 6.\n\nFirst, we consider the MT histories of the models (as in the left panel of Figure 1), which are summarized in Table A1. We find 96% of models agree in their MT history (both evolving through stable or entering dynamically unstable MT) with the remaining 4% having completely divergent evolution. For pair models which agree, we also find that MT cases between models are consistent. In other words, the type of MT (e.g., Case A, Case B, and Case C) is the same when running the instantly circularized MESA binary model versus f-eMT. Finally, for the pair models which diverge, our f-eMT treatment results in more stable MT (∼ 72%) compared to the instant circularization treatment leading to unstable MT (i.e., common envelope evolution; ∼ 21%). This preference for stability is due to the rp evolution seen in Figure 2, which effectively widens the binary while residual eccentricity remains in the orbit.\n\nWe also consider the differences in final properties of our naturally circularized models and their corresponding models which were instantly circularized (Section 2.5). Our binary MESA simulations are stopped based on a variety of criteria related to the formation of a WD, the imminent core collapse of the primary, and the onset of dynamically unstable MT (for details, see Fragos et al. 2023; Andrews et al. 2024). Thus, we compare the final outcomes of a quantity x between our f-eMT simulations (xeMT) and their equivalent instantly circularized MESA models (xinstant circ) by computing the fractional changes between the two cases which we denote with δ:\n\nδx = xeMT − xinstant circ, (11)\n\nxinstant circ\n\nwhere we compute the differences relative to the instantly circularized case, as this is the standard assumption in binary stellar evolution. For clarity, we only compute differences between models with matching MT histories (both stable or unstable MT, see Table A1).\n\nIn Figure 7, we present one-dimensional histograms for the fractional differences in final donor mass δMd, orbital period δPorb, and orbital separation δa, separated by stable or unstable MT. The binaries undergoing stable MT may go on to experience the donor’s core collapse or WD formation, while binaries undergoing unstable MT enter common envelope evolution.\n\nOur naturally circularized f-eMT simulations predict similar donor masses to the instantly circularized case, with 90% of models having δMd ≲ ±20%, with medians at about ≲ ±5%. The stable MT binaries have smaller δMd and are positively skewed compared to unstable MT models which have larger absolute δMd skewing negative. Additionally, f-eMT simulations overwhelmingly predict δPorb > 0, for both stable and unstable MT distributions, with much larger fractional changes (90% from δPorb ≃ 50 − 100% and δa ≃ 25 − 55%). Therefore, even binaries which naturally circularize during eMT have different parameters compared to the ad hoc instant circularization approach for both unstable and stable MT systems.\n\n# Figure 7\n\nFor models which naturally circularize in our f-eMT simulations (blue in Figure 3): fractional change (Equation 11) in donor mass (left panel), orbital period (center panel), and semi-major axis (right panel) relative to the instantaneously circularized treatment at the end of each simulations. Positive (negative) values indicate increases (decreases) in a given parameter when using f-eMT compared to instant circularization. Colors indicate simulations where both models undergo stable (purple) or unstable MT (green), where the distribution median, 68%, and 90% percentiles are shown near the top of each histogram (as described in Figure 5).\n\n# Figure 8\n\nIn Figure 8, we show three example binaries that exhibit completely divergent evolution (i.e. one model has stable MT while the other becomes dynamically unstable) when modeled with f-eMT (colored lines) compared to the equivalent instantly circularized approximation (black). The f-eMT simulations often exhibit lower peak M˙ due to the increase in rp, while circular binaries always initially shrink when q > 1.\n\nThe left column of Figure 8 shows a binary with a high mass donor (Md ≃ 13 M⊙) and a low-mass BH (MCO ≃ 4 M⊙) with high ei ≃ 0.9, undergoing stable Case A/B MT. In this case, the lower peak ˙ in the M f-eMT model results in the BH accreting approximately 0.5 M⊙. The corresponding instantly circularized binary evolves similarly until log10( ˙M /M⊙ yr−1) ≳ −6, at which point the shrinking separation drives a runaway increase in the MT rate. The original binary with Porb,i ≃ 102 d is significantly impacted by the instant circularization treatment, which arbitrarily reduces the initial orbit to Porb,circ ≃ 3 d.\n\nThe middle column of Figure 8 shows a binary hosting a massive donor Md ≃ 25 M⊙, but with a more massive BH (MCO ≃ 13 M⊙) and lower ei ≃ 0.2. Shortly after Case A MT begins, the f-eMT model naturally circularizes. However, due to the larger orbital period of the f-eMT model (since instant circularization reduces the semi-major axis, ac = a(1 − e)), the post-MS Case B evolution (at t − toRLO ≃ 3 × 105 yr) is stable, whereas the instantly circularized model is deemed to enter dynamically unstable MT due to L2 overflow, which occurs when the donor star radius exceeds the second Lagrangian point.\n\nThe final column of Figure 8 shows a binary containing a low-mass donor Md ≃ 3 M⊙ and a 1.3 M⊙ NS with moderate eccentricity (ei ≃ 0.5), where the f-eMT simulation eventually becomes unstable during Case B MT, while the instantly circularized model remains stable. The sharp increase in MT near log10( ˙M /M⊙ yr−1) ≳ −5 occurs when the increase of rp (see Section 3) ceases abruptly at e = 0, where further MT rapidly shrinks the orbit in a runaway process. Before this sharp spike in MT, rp decreases due to strong spin-orbit coupling, which spins up the donor. The instantly circularized model artificially escapes a runaway MT episode due to the higher average ˙ throughout the MT phase, reaching a low enough q to switch from orbital shrinking to expansion.\n\n# 5. DISCUSSION AND CONCLUSIONS\n\nWe have implemented the secular orbital evolution equations for non-conservative eMT from Sepinsky et al. 2009, into self-consistent stellar evolution calculations for the first time using MESA. Our focus is on binaries containing COs and non-degenerate donors. Our investigation is divided into two parts: (i) a small parameter study with simplified physics where all orbital evolution is restricted to that induced by non-conservative eMT (Section 3); and (ii) a full-physics grid with astrophysical initial conditions drawn from a POSYDON BPS.\n\n# Figure 8. Time series evolution of three binaries which have divergent evolution between f-eMT (colored lines) and their equivalent instantly circularized evolution (black) with initial conditions of the original eccentric orbit at the top of each column. Instantly circularized models are adjusted such that ac = a(1 − e). The majority of models which have divergent evolution are biased toward stable MT in the eccentric case (72%), and unstable in the instantly circularized case (21%). In the first binary (left), the trend of increasing rp allows the f-eMT model to remain stable. The second (center) binary naturally circularizes e = 0 but the larger Porb,i compared to the instant circularization allows the eccentric model to survive Case B MT. The last binary (right) becomes unstable once e = 0 due to the lack of increasing rp once this limit is hit, while the instantly circularized model transfers enough mass to avoid runaway MT.\n\n# of CO-hosting binaries that are found to initiate MT\n\n# while eccentric (Section 4). The key findings from this\n\n# modeling are as follows:\n\n1. s-eMT model: In the s-eMT simulations containing a 10 M⊙ BH and 20 M⊙ donor, we find novel behavior when including self-consistent modeling of the MT rate from a MESA stellar evolution model in combination with the orbital evolution due to eMT.\n2. For binaries proceeding on the nuclear timescale for systems experiencing Case A MT. For the highly eccentric models, the lower MT rate allows some BHs to accrete more conservatively.\n\n|Md,i = 13.6 M|Porb,i = 116.8|Md,i = 25.3 M|Porb,i = 10.2|\n|---|---|---|---|\n|Md,i = 3.6 M|Porb,i = 27.8−1˙elog( M /Myr)r/rpp,oRLO10M[M ]d,CO log(P/d)qorb10MCO,i = 3.8 Me= 0.91|i MCO,i = 12.9 Me= 0.20|i MCO,i = 1.3 Mei = 0.46|\n\n# f-eMT: Stable Case A/B\n\n# f-eMT: Unstable Case B\n\n# instant circ.: Unstable Case A\n\n# instant circ.: Stable Case B\n\n|1.4|1.5|\n|---|---|\n|2| |\n|1| |\n|0.8|0.5|\n|1.0|1.0|\n|0.5|0.5|\n|0.0|0.0|\n\n# 3r/r˙−1pp,oRLO2log(P/d)elog( M /Myr)orbM[M ]1010d,CO 3q\n\n|2|1|\n|---|---|\n|1| |\n|−2|−2|\n|−4|−4|\n|−6|−6|\n|−8|−8|\n\n# Donorlog(P/d)elog( M /Myr)orb1010M[M ]qd,CO COCO\n\n|10|20|15|2|\n|---|---|---|---|\n|5|10|1| |\n\n# t − toRLO [yr]\n\n102\n103\n104\n105\n106\n102\n103\n104\n105\n106\n102\n104\n106\n108\n\n# 15\n\nvatively, nearly doubling their mass before the donor’s core-collapse episode.\n\n# 2) f-eMT model:\n\nThe majority of evolutionary effects identified in our s-eMT simulations also persist in our f-eMT simulations. The initial conditions of our f-eMT simulations were drawn from an astrophysical BPS model, where > 70% of all interacting CO-hosting binaries initiated eMT, suggesting eMT may strongly impact CO binary populations. Most binaries from our astrophysical population initiate post-MS MT (Case B or Case C MT), due to the wider orbital separations of binaries which experience eMT. We find that about one-third of binaries remain eccentric post-MT, while the remaining two-thirds naturally circularize during eMT, with this division depending strongly on the assumed BPS physics. While the eccentric post-MT population categorically diverges from the ad hoc treatment of instantaneous circularization (the ubiquitously adopted approximation), even models which naturally circularize through eMT see notable differences in their final properties (with the 90% distributions around δMd ≃ −20% and δPorb ≃ 100%). A smaller fraction of binaries (about 5% of the naturally circularized binaries) exhibit completely divergent evolution (compared to the instantly circularized approach), with eMT generally predicting MT stability over instability in 80% of cases.\n\n# 3) A bifurcation in orbital evolution outcomes:\n\nTo determine which binaries are likely to remain eccentric post-MT or become naturally circularized, we find these outcomes are strikingly well separated in the q−ei plane. We have provided a fitting function in Equation 10 so that other studies (e.g. BPS simulations) may estimate the impact of eMT to first-order on different subpopulations such as gravitational wave sources and X-ray binary populations. However, as we have shown, even models which are naturally circularized through eMT can be significantly misrepresented by the ad hoc approach of instant circularization in the predicted donor masses and orbital configurations prior to SN or common-envelope.\n\n# 4) Behavior of systems containing a BH:\n\nApproximately 60% of all BH-hosting binaries in the f-eMT models remain eccentric post-MT. Due to their low q,i BH-hosting binaries are more likely to remain eccentric post-MT than NS-hosting binaries which predominantly circularize. These BH-hosting binaries are also likely to undergo eccentric pumping and orbital expansion, with Porb ≳ 102 days and 0.2 ≲ e ≲ 0.8. This type of evolution may be relevant to some of the wide Gaia BH systems in recent discoveries (El-Badry et al. 2023a,b; Gaia Collaboration et al. 2024), although our models would be relevant to BH companions that have been affected by MT. Future work incorporating eMT into MESA to simulate interactions between two non-degenerate stars will provide more direct comparisons to the wide Gaia binaries hosting COs.\n\nThis investigation into the effects of eMT on binary populations indicates that a wide range of CO populations may be impacted by this new treatment. For example, LMXB populations with wide circular orbits, or potential X-ray binary populations with eccentric and moderately wide orbits which may exhibit very low X-ray duty cycles (approximately tperi/Porb). These binaries primarily initiate post-MS MT, leading to a short-lived X-ray transient stage followed by a detached quiescent phase with stripped helium donors at all eccentricities and wide periods (10 to 104 days). Given the selection effects that strongly bias against detecting wide binaries and helium stars (Götberg et al. 2018; Drout et al. 2023), it is unsurprising that no such binary has yet been discovered. However, future studies with detailed models for the X-ray emission from binaries undergoing eMT are necessary for drawing more robust conclusions.\n\nIn addition to XRBs, eccentric binaries containing BHs have been proposed to explain a special subclass of transient with late time non-thermal emission: fast luminous blue optical transients (e.g., Lazzati et al. 2024). Our results suggest an increased prevalence of these peculiar transients compared to standard binary stellar evolution models as we have shown that BH-binaries are more likely to remain eccentric post-MT.\n\nOne key assumption of our model for eMT assumes all MT occurs in a delta function at periapse. Although hydrodynamical studies have shown the MT rate in eccentric binaries resembles a Gaussian profile as a function of the true anomaly (e.g. with FWHM ∼ 0.12 Porb Lajoie & Sills 2011), simulations often cover a single binary configuration and/or resolve too few orbits to determine secular orbital evolution (Lajoie & Sills 2011; Davis et al. 2013; Saladino & Pols 2019). Analytic work extending beyond the assumption of delta function MT are presently unable to account for non-conservative MT (Hamers & Dosopoulou 2019), which is important for binaries hosting COs (Marino et al. 2017; Ziolkowski & Zdziarski 2018, e.g.,). Other secular effects such as those introduced by circumbinary disks from the aforementioned non-conservative accretion (e.g., Valli et al. 2024) or more detailed treatment of tides in eccentric orbits (e.g., MacLeod et al. 2022; Sciarini et al. 2024) may lead to more complex behavior.\n\nWhile including eMT within the POSYDON framework is our ultimate goal, simply including another dimension into our detailed binary grids is currently too computationally expensive. Nevertheless, exploring more dimensions in binary stellar evolution such as eccentricity is important for our interpretation of modern astrophysical populations (e.g., de S´a et al. 2024). Machine learning algorithms like active learning may be necessary to facilitate expansions to higher dimensions within the POSYDON framework (Rocha et al. 2022).\n\nCombining all results from our f-eMT simulations, we conclude eMT is important to consider for the evolutionary history of CO-hosting binaries (e.g. low-mass/high-mass X-ray binaries, binary black hole mergers, gamma-ray burst progenitors) which are thought to have at least one phase of RLO MT. In future work we will implement the eMT formalism into MESA to simulate interactions between two non-degenerate stars. In this regime, we plan to investigate the large population of wide post-interaction binaries observed to contain stripped donors and WDs.\n\n# ACKNOWLEDGMENTS\n\nKAR, SG, and MS are supported by the Gordon and Betty Moore Foundation (PI Kalogera, grant awards GBMF8477 and GBMF12341) and CIERA’s Riedel Family Fellowship in Data Science. DM and KAR thank the LSSTC Data Science Fellowship Program, which is funded by LSSTC, NSF Cybertraining Grant No. 1829740, the Brinson Foundation, and the Moore Foundation; their participation in the program has benefited this work. KAR is also supported by the NASA grant awarded to the Illinois/NASA Space Grant Consortium, and any opinions, findings, conclusions, or recommendations expressed in this material are those of the author and do not necessarily reflect the views of NASA. JJA acknowledges support for Program number (JWST-AR-04369.001-A) provided through a grant from the STScI under NASA contract NAS5-03127. VK was partially supported through the D.I.Linzer Distinguished University Professorship fund. S.B., M.B., T.F., M.K., and Z.X. acknowledge support by the Swiss National Science Foundation (PI Fragos, project number CRSII5 213497). KK and EZ were partially supported by the Federal Commission for Scholarships for Foreign Students for the Swiss Government Excellence Scholarship (ESKAS No. 2021.0277 and ESKAS No. 2019.0091, respectively). KK is supported by a fellowship program at the Institute of Space Sciences (ICE-CSIC) funded by the program Unidad de Excelencia María de Maeztu CEX2020-001058-M. Z.X. was supported by the Chinese Scholarship Council (CSC). Support for M.Z. was provided by NASA through the NASA Hubble Fellowship grant HST-HF2-51474.001-A awarded by the Space Telescope Science Institute, which is operated by the Association of Universities for Research in Astronomy, Incorporated, under NASA contract NAS5-26555.\n\nThe computations were performed at Northwestern University on the Trident computer cluster (funded by the GBMF8477 award). This research was supported in part through the computational resources and staff contributions provided for the Quest high performance computing facility at Northwestern University which is jointly supported by the Office of the Provost, the Office for Research, and Northwestern University Information Technology. We thank Monica Gallegos-Garcia for assisting in the BPS setup for this work and Chase Kimball for helpful comments on the manuscript.\n\nSoftware: NumPy (van der Walt et al. 2011), SciPy (Virtanen et al. 2020), Astropy (Astropy Collaboration et al. 2013, 2018, 2022), matplotlib (Hunter 2007), pandas (pandas development team 2020), POSYDON (Fragos et al. 2023; Andrews et al. 2024), MESA (Paxton et al. 2011, 2015, 2013, 2018, 2019)\n\n# REFERENCES\n\nAbbott, R., Abbott, T. D., Acernese, F., et al. 2023, Physical Review X, 13, 011048, doi: 10.1103/PhysRevX.13.011048\n\nAndrews, J. J., Taggart, K., & Foley, R. 2022, arXiv e-prints, arXiv:2207.00680, doi: 10.48550/arXiv.2207.00680\n\nAndrews, J. J., Bavera, S. S., Briel, M., et al. 2024, arXiv e-prints, arXiv:2411.02376, doi: 10.48550/arXiv.2411.02376\n\nAsplund, M., Grevesse, N., Sauval, A. J., & Scott, P. 2009, ARA&A, 47, 481, doi: 10.1146/annurev.astro.46.060407.145222\n\nAstropy Collaboration, Robitaille, T. P., Tollerud, E. J., et al. 2013, A&A, 558, A33, doi: 10.1051/0004-6361/201322068\n\nAstropy Collaboration, Price-Whelan, A. M., Sipocz, B. M., et al. 2018, AJ, 156, 123, doi: 10.3847/1538-3881/aabc4f\n\nAstropy Collaboration, Price-Whelan, A. M., Lim, P. L., et al. 2022, ApJ, 935, 167, doi: 10.3847/1538-4357/ac7c74\n\n# References\n\nBahramian, A., & Degenaar, N. 2023, in Handbook of X-ray and Gamma-ray Astrophysics, 120, doi: 10.1007/978-981-16-4544-0 94-1\n\nBailyn, C. D. 1995, ARA&A, 33, 133, doi: 10.1146/annurev.aa.33.090195.001025\n\nBashi, D., Mazeh, T., & Faigler, S. 2023, MNRAS, 522, 1184, doi: 10.1093/mnras/stad999\n\nBreivik, K., Coughlin, S., Zevin, M., et al. 2020, ApJ, 898, 71, doi: 10.3847/1538-4357/ab9d85\n\nDavis, P. J., Siess, L., & Deschamps, R. 2013, A&A, 556, A4, doi: 10.1051/0004-6361/201220391\n\nde Sá, L. M., Bernardo, A., Rocha, L. S., Bachega, R. A. R., & Horvath, J. E. 2024, MNRAS, doi: 10.1093/mnras/stae2388\n\nD’Orazio, D. J., & Duffell, P. C. 2021, ApJL, 914, L21, doi: 10.3847/2041-8213/ac0621\n\nDosopoulou, F., & Kalogera, V. 2016, ApJ, 825, 70, doi: 10.3847/0004-637X/825/1/70\n\nDrout, M. R., Götberg, Y., Ludwig, B. A., et al. 2023, Science, 382, 1287, doi: 10.1126/science.ade4970\n\nEggleton, P. P. 1983, ApJ, 268, 368, doi: 10.1086/160960\n\nEl-Badry, K., Conroy, C., Quataert, E., et al. 2022, MNRAS, 516, 3602, doi: 10.1093/mnras/stac2422\n\nEl-Badry, K., Rix, H.-W., Quataert, E., et al. 2023a, MNRAS, 518, 1057, doi: 10.1093/mnras/stac3140\n\nEl-Badry, K., Rix, H.-W., Cendes, Y., et al. 2023b, MNRAS, 521, 4323, doi: 10.1093/mnras/stad799\n\nEldridge, J. J., Stanway, E. R., Xiao, L., et al. 2017, PASA, 34, e058, doi: 10.1017/pasa.2017.51\n\nEscorza, A., & De Rosa, R. J. 2023, A&A, 671, A97, doi: 10.1051/0004-6361/202244782\n\nFornasini, F. M., Antoniou, V., & Dubus, G. 2023, arXiv e-prints, arXiv:2308.02645, doi: 10.48550/arXiv.2308.02645\n\nFortin, F., García, F., Simaz Bunzel, A., & Chaty, S. 2023, A&A, 671, A149, doi: 10.1051/0004-6361/202245236\n\nFragos, T., Andrews, J. J., Bavera, S. S., et al. 2023, ApJS, 264, 45, doi: 10.3847/1538-4365/ac90c1\n\nGaia Collaboration, Panuzzo, P., Mazeh, T., et al. 2024, A&A, 686, L2, doi: 10.1051/0004-6361/202449763\n\nGallegos-Garcia, M., Berry, C. P. L., Marchant, P., & Kalogera, V. 2021, ApJ, 922, 110, doi: 10.3847/1538-4357/ac2610\n\nGeller, A. M., Leigh, N. W. C., Giersz, M., Kremer, K., & Rasio, F. A. 2019, ApJ, 872, 165, doi: 10.3847/1538-4357/ab0214\n\nGeller, A. M., Mathieu, R. D., Harris, H. C., & McClure, R. D. 2009, AJ, 137, 3743, doi: 10.1088/0004-6256/137/4/3743\n\nGiacobbo, N., & Mapelli, M. 2019, MNRAS, 482, 2234, doi: 10.1093/mnras/sty2848\n\nGiacobbo, N., Mapelli, M., & Spera, M. 2018, MNRAS, 474, 2959, doi: 10.1093/mnras/stx2933\n\nGosnell, N. M., Mathieu, R. D., Geller, A. M., et al. 2015, ApJ, 814, 163, doi: 10.1088/0004-637X/814/2/163\n\nGötberg, Y., de Mink, S. E., Groh, J. H., et al. 2018, A&A, 615, A78, doi: 10.1051/0004-6361/201732274\n\nHamers, A. S., & Dosopoulou, F. 2019, ApJ, 872, 119, doi: 10.3847/1538-4357/ab001d\n\nHeber, U. 2009, ARA&A, 47, 211, doi: 10.1146/annurev-astro-082708-101836\n\nHobbs, G., Lorimer, D. R., Lyne, A. G., & Kramer, M. 2005, MNRAS, 360, 974, doi: 10.1111/j.1365-2966.2005.09087.x\n\nHu, Z., Zhu, W., Dai, F., et al. 2024, arXiv e-prints, arXiv:2409.18296, doi: 10.48550/arXiv.2409.18296\n\nHunter, J. D. 2007, Computing in Science Engineering, 9, 90, doi: 10.1109/MCSE.2007.55\n\nHurley, J. R., Tout, C. A., & Pols, O. R. 2002, MNRAS, 329, 897, doi: 10.1046/j.1365-8711.2002.05038.x\n\nHut, P. 1981, A&A, 99, 126\n\nHwang, H.-C., Ting, Y.-S., & Zakamska, N. L. 2022, MNRAS, 512, 3383, doi: 10.1093/mnras/stac675\n\nIben, Icko, J. 1991, ApJS, 76, 55, doi: 10.1086/191565\n\nIvanova, N., Belczynski, K., Fregeau, J. M., & Rasio, F. A. 2005, MNRAS, 358, 572, doi: 10.1111/j.1365-2966.2005.08804.x\n\nKolb, U., & Ritter, H. 1990, A&A, 236, 385\n\nKretschmar, P., Fürst, F., Sidoli, L., et al. 2019, NewAR, 86, 101546, doi: 10.1016/j.newar.2020.101546\n\nKroupa, P. 2001, MNRAS, 322, 231, doi: 10.1046/j.1365-8711.2001.04022.x\n\nKuiper, G. P. 1941, ApJ, 93, 133, doi: 10.1086/144252\n\nLai, D., & Muñoz, D. J. 2023, ARA&A, 61, 517, doi: 10.1146/annurev-astro-052622-022933\n\nLajoie, C.-P., & Sills, A. 2011, ApJ, 726, 67, doi: 10.1088/0004-637X/726/2/67\n\nLamberts, A., Blunt, S., Littenberg, T. B., et al. 2019, MNRAS, 490, 5888, doi: 10.1093/mnras/stz2834\n\nLanger, N. 2012, ARA&A, 50, 107, doi: 10.1146/annurev-astro-081811-125534\n\nLazzati, D., Perna, R., Ryu, T., & Breivik, K. 2024, ApJL, 972, L17, doi: 10.3847/2041-8213/ad70ba\n\nLinck, E., Mathieu, R. D., & Latham, D. W. 2024, AJ, 168, 205, doi: 10.3847/1538-3881/ad6b1a\n\nLivio, M., & Soker, N. 1988, ApJ, 329, 764, doi: 10.1086/166419\n\n# References\n\n- Lubow, S. H. 2022, MNRAS, 516, 5446, doi: 10.1093/mnras/stac2636\n- Lubow, S. H., & Shu, F. H. 1975, ApJ, 198, 383, doi: 10.1086/153614\n- MacLeod, M., Vick, M., & Loeb, A. 2022, ApJ, 937, 37, doi: 10.3847/1538-4357/ac8aff\n- Marchant, P., & Bodensteiner, J. 2024, Annual Review of Astronomy and Astrophysics, doi: https://doi.org/10.1146/annurev-astro-052722-105936\n- Marchant, P., Pappas, K. M. W., Gallegos-Garcia, M., et al. 2021, A&A, 650, A107, doi: 10.1051/0004-6361/202039992\n- Marino, A., Di Salvo, T., Gambino, A. F., et al. 2017, A&A, 603, A137, doi: 10.1051/0004-6361/201730464\n- Mathieu, R. D. 1994, ARA&A, 32, 465, doi: 10.1146/annurev.aa.32.090194.002341\n- Milliman, K. E., Leiner, E., Mathieu, R. D., Tofflemire, B. M., & Platais, I. 2016, AJ, 151, 152, doi: 10.3847/0004-6256/151/6/152\n- Milliman, K. E., Mathieu, R. D., Geller, A. M., et al. 2014, AJ, 148, 38, doi: 10.1088/0004-6256/148/2/38\n- Moriya, T. J., Liu, Z.-W., Mackey, J., Chen, T.-W., & Langer, N. 2015, A&A, 584, L5, doi: 10.1051/0004-6361/201527515\n- Muñoz, D. J., & Lithwick, Y. 2020, ApJ, 905, 106, doi: 10.3847/1538-4357/abc74c\n- Naoz, S., Fragos, T., Geller, A., Stephan, A. P., & Rasio, F. A. 2016, ApJL, 822, L24, doi: 10.3847/2041-8205/822/2/L24\n- Neumann, M., Avakyan, A., Doroshenko, V., & Santangelo, A. 2023, A&A, 677, A134, doi: 10.1051/0004-6361/202245728\n- Nie, J. D., Wood, P. R., & Nicholls, C. P. 2017, ApJ, 835, 209, doi: 10.3847/1538-4357/835/2/209\n- Nine, A. C., Mathieu, R. D., Schuler, S. C., & Milliman, K. E. 2024, ApJ, 970, 187, doi: 10.3847/1538-4357/ad534b\n- Oomen, G.-M., Van Winckel, H., Pols, O., et al. 2018, A&A, 620, A85, doi: 10.1051/0004-6361/201833816\n- Paczyński, B. 1971, ARA&A, 9, 183, doi: 10.1146/annurev.aa.09.090171.001151\n- pandas development team, T. 2020, pandas-dev/pandas: Pandas, latest, Zenodo, doi: 10.5281/zenodo.3509134\n- Paxton, B., Bildsten, L., Dotter, A., et al. 2011, ApJS, 192, 3, doi: 10.1088/0067-0049/192/1/3\n- Paxton, B., Cantiello, M., Arras, P., et al. 2013, ApJS, 208, 4, doi: 10.1088/0067-0049/208/1/4\n- Paxton, B., Marchant, P., Schwab, J., et al. 2015, ApJS, 220, 15, doi: 10.1088/0067-0049/220/1/15\n- Raguzova, N. V., & Popov, S. B. 2005, Astronomical and Astrophysical Transactions, 24, 151, doi: 10.1080/10556790500497311\n- Rasio, F. A., Tout, C. A., Lubow, S. H., & Livio, M. 1996, ApJ, 470, 1187, doi: 10.1086/177941\n- Ritter, H. 1988, A&A, 202, 93\n- Rocha, K. A., Andrews, J. J., Berry, C. P. L., et al. 2022, ApJ, 938, 64, doi: 10.3847/1538-4357/ac8b05\n- Rocha, K. A., Kalogera, V., Doctor, Z., et al. 2024, ApJ, 971, 133, doi: 10.3847/1538-4357/ad5955\n- Rodriguez, C. L., Weatherford, N. C., Coughlin, S. C., et al. 2022, ApJS, 258, 22, doi: 10.3847/1538-4365/ac2edf\n- Saladino, M. I., & Pols, O. R. 2019, A&A, 629, A103, doi: 10.1051/0004-6361/201935625\n- Sana, H., de Koter, A., de Mink, S. E., et al. 2013, A&A, 550, A107, doi: 10.1051/0004-6361/201219621\n- Sciarini, L., Ekström, S., Eggenberger, P., et al. 2024, A&A, 681, L1, doi: 10.1051/0004-6361/202348424\n- Sepinsky, J. F., Willems, B., & Kalogera, V. 2007a, ApJ, 660, 1624, doi: 10.1086/513736\n- Sepinsky, J. F., Willems, B., Kalogera, V., & Rasio, F. A. 2007b, ApJ, 667, 1170, doi: 10.1086/520911\n- —. 2009, ApJ, 702, 1387, doi: 10.1088/0004-637X/702/2/1387\n- —. 2010, ApJ, 724, 546, doi: 10.1088/0004-637X/724/1/546\n- Simaz Bunzel, A., García, F., Combi, J. A., & Chaty, S. 2023, A&A, 670, A80, doi: 10.1051/0004-6361/202245081\n- Siwek, M., Weinberger, R., & Hernquist, L. 2023, MNRAS, 522, 2707, doi: 10.1093/mnras/stad1131\n- Sukhbold, T., Ertl, T., Woosley, S. E., Brown, J. M., & Janka, H. T. 2016, ApJ, 821, 38, doi: 10.3847/0004-637X/821/1/38\n- Sun, M., & Arras, P. 2018, ApJ, 858, 14, doi: 10.3847/1538-4357/aab9a4\n- Sun, M., Levina, S., Gossage, S., et al. 2024, ApJ, 969, 8, doi: 10.3847/1538-4357/ad47c1\n- Sun, M., & Mathieu, R. D. 2023, ApJ, 944, 89, doi: 10.3847/1538-4357/acacf7\n- Sun, M., Mathieu, R. D., Leiner, E. M., & Townsend, R. H. D. 2021, ApJ, 908, 7, doi: 10.3847/1538-4357/abd402\n\n# References\n\nTang, P., Meyer, R., & Eldridge, J. 2024, arXiv e-prints, arXiv:2411.02563, doi: 10.48550/arXiv.2411.02563\n\nTauris, T. M., & van den Heuvel, E. P. J. 2023, Physics of Binary Star Evolution. From Stars to X-ray Binaries and Gravitational Wave Sources, doi: 10.48550/arXiv.2305.09388\n\nTownsend, R. 2020, MESA SDK for Linux, 20.3.1, Zenodo, doi: 10.5281/zenodo.3706650\n\nValli, R., Tiede, C., Vigna-G´omez, A., et al. 2024, A&A, 688, A128, doi: 10.1051/0004-6361/202449421\n\nvan den Heuvel, E. P. J. 2019, in IAU Symposium, Vol. 346, High-mass X-ray Binaries: Illuminating the Passage from Massive Binaries to Merging Compact Objects, ed. L. M. Oskinova, E. Bozzo, T. Bulik, & D. R. Gies, 1–13, doi: 10.1017/S1743921319001315\n\nVan der Swaelmen, M., Boffin, H. M. J., Jorissen, A., & Van Eck, S. 2017, A&A, 597, A68, doi: 10.1051/0004-6361/201628867\n\nVerbunt, F., & Phinney, E. S. 1995, A&A, 296, 709\n\nVirtanen, P., Gommers, R., Oliphant, T. E., et al. 2020, Nature Methods, 17, 261, doi: 10.1038/s41592-019-0686-2\n\nWang, C., & Ryu, T. 2024, arXiv e-prints, arXiv:2410.10314, doi: 10.48550/arXiv.2410.10314\n\nWebbink, R. F. 1984, ApJ, 277, 355, doi: 10.1086/161701\n\nZahn, J. P. 1977, A&A, 57, 383\n\nZhu, J.-P., Liu, L.-D., Yu, Y.-W., et al. 2024, ApJL, 970, L42, doi: 10.3847/2041-8213/ad63a8\n\nZi´olkowski, J., & Zdziarski, A. A. 2018, MNRAS, 480, 1580, doi: 10.1093/mnras/sty1948\n\n# APPENDIX\n\n# A. SUPPLEMENTARY MATERIAL\n\nTo obtain realistic initial conditions for our eMT simulations with binaries hosting a BH or NS, we take properties from a POSYDON BPS of systems which initiate MT in a nominally eccentric orbit (e > 0.05). In Figure A1, we show this binary population in black, while the samples used for running our f-eMT MESA simulations are shown in orange with Poisson error bars. Error bars on the astrophysical population would be too smaller than the line width. The binary evolution physics prior to oRLO (MT, SN, common envelope evolution, tides) will impact the inferred distribution of binaries which initiate eMT. Other uncertainties in binary evolution, such as the birth eccentricity distribution of MS binaries and the initial mass function will also impact this population.\n\nIn our f-eMT simulations, we find a population of binaries which naturally circularize during eMT. We then compare these systems to MESA simulations run with the instantly circularized configuration Section 2.5. The data in Table A1 summarize the MT outcomes of our simulations, comparing the f-eMT models with the instantly circularized ones.\n\n|Samples|Astro. population|\n|---|---|\n|0.15|0.5|\n|0.10|0.3|\n|0.05|0.2|\n|0.00|0.0|\n\nFigure A1. One-dimensional distributions of binary parameters from our POSYDON binary population synthesis at the moment a non-degenerate donor star initiates RLO with a BH or NS companion in an eccentric orbit (e > 0.05; see Section 2.4.1). The astrophysical binary population (black) is well reproduced by the subset of 2000 samples we simulate with f-eMT in MESA (orange) where vertical lines indicate Poisson errors.\n\n# Table A1. Mass transfer outcomes for our f-eMT MESA simulations run with the eccentric MT formalism (ei ̸= 0), and their associated instantly circularized simulations.\n\nThis table only shows models which circularize naturally through RLO MT (ef < 0.05), which constitute about 2/3 of all our astrophysically sampled models (see §4.3. For each simulation pair, we show the top three most numerous joint MT cases (reported fractions may not sum to unity). A large fraction (96%) of all models agree in their MT histories, with 4% of models exhibiting completely divergent evolution (i.e. stable vs. unstable MT). For models which agree on the qualitative outcome, they also see good agreement between their detailed MT cases (e.g. both Case B).\n\n|Outcome|N models|Eccentric MT (ef < 0.05)|Instantaneous Circ. (ei = 0)|Fraction|\n|---|---|---|---|---|\n|Stable MT|328 (28%)|Case B|Case A/B|52.8%|\n| | |Case A/B|Case A/B|45.6%|\n| | |Case B|Case A/B|0.6%|\n|Unstable|790 (68%)|Case A|Case A|7.4%|\n| | |Case B|Case A|0.4%|\n| | |Stable Case B & Case B/BB|Unstable Case B|64.1%|\n|Mixed TFs|47 (4%)|Stable Case A/B|Unstable Case A & Case A/B|14.1%|\n| | |Unstable Case B|Stable Case B|12.5%|",
        "summary": "**Summary of \"Mass Transfer in Eccentric Orbits with Self-consistent Stellar Evolution\"**\n\n**1. Main objective and motivation:**\n\nThe paper aims to investigate the impact of eccentric mass transfer (eMT) on the evolution of binary systems containing stars and compact objects (COs), such as neutron stars and black holes.  It addresses the crucial gap in existing binary evolution models that typically assume instantaneous circularization during mass transfer, ignoring the significant influence of eccentricity.  The motivation stems from the prevalence of eccentric orbits observed in many binary systems, and the observed connections to various astrophysical phenomena like X-ray binaries, gravitational wave sources, and supernovae with circumstellar interactions.\n\n**2. Key methods and approaches:**\n\nThe authors integrate analytical expressions for the secular rates of change of orbital semi-major axis and eccentricity during eMT into the Modules for Experiments in Stellar Astrophysics (MESA) code.  These expressions, derived from previous work (specifically Sepinsky et al., 2009), account for non-conservative mass transfer and are implemented within a self-consistent framework.  The mass transfer rate is calculated based on the Roche lobe model in the eccentric orbit, considering the distance between stars as a function of the orbital phase.  MESA is further extended to include other angular momentum loss mechanisms like tides, stellar winds, magnetic braking, and gravitational wave radiation.  The study uses a binary population synthesis (BPS) code (POSYDON) to generate astrophysically realistic binary systems as input for the MESA simulations.  Results are compared to models that adopt the common, but often simplifying, assumption of instantaneous circularization.\n\n**3. Principal findings and results:**\n\nThe study demonstrates that a significant fraction of binaries hosting COs will retain their eccentricity after mass transfer, contrary to the assumption of instant circularization.  The initial mass ratio (q) and eccentricity (e) of the binary system are critical predictors of whether the orbit remains eccentric or becomes circularized.  A fitting function (Equation 10) quantifies the bifurcation between these outcomes in the q-e plane.\n\nThe study reveals diverse evolutionary sequences, including stable and unstable mass transfer.  In stable eMT, the orbital separation may evolve in a complex manner, sometimes expanding while eccentricity is pumped up.  In contrast, systems modeled with instant circularization often exhibit qualitatively different outcomes.  The inclusion of eMT influences final binary properties, especially donor masses and orbital periods, even for systems that initially appear to circularize, deviating substantially from the predictions of instantaneous circularization.\n\nSignificant differences are observed between the models incorporating eMT and the instant circularization approach, specifically in donor masses, orbital periods, and mass transfer stability for binaries which naturally circularize.  Divergent evolutionary paths are documented, showcasing that the self-consistent modeling of eMT is crucial for understanding the detailed evolution of CO-hosting binaries.\n\n**4. Significance and implications:**\n\nThe findings highlight the necessity of accounting for eMT in binary evolution models to accurately predict the properties of CO-hosting binary populations.  This improved understanding has implications for understanding the demographics of X-ray binaries, gravitational wave sources, and other high-energy transients. The study quantifies the extent to which standard binary evolution models neglecting eMT might underestimate or overestimate the populations of specific subclasses of binaries, such as systems with eccentric and moderately wide orbits. The results also have implications for the interpretation of existing observations of wide binaries hosting COs (e.g. some Gaia results).  The inclusion of self-consistent eMT in future population synthesis models will improve the accuracy of predictions and provide insights into their formation mechanisms.  Future work is necessary to extend the model to incorporate more complex hydrodynamical treatments of mass transfer in eccentric systems.\n",
        "insights": "This paper investigates the impact of eccentric mass transfer (eMT) on binary stellar evolution, using a self-consistent model implemented in the MESA stellar evolution code.\n\n**Key Insights and Lessons Learned:**\n\n* **eMT significantly affects binary evolution:**  The traditional assumption of instantaneous circularization during mass transfer is inaccurate for many systems.  This paper shows that a substantial fraction of binaries can remain eccentric after mass transfer.\n* **Initial conditions predict evolution:**  Initial mass ratio and eccentricity are crucial in determining whether a binary will remain eccentric or circularize following mass transfer.\n* **Non-conservative eMT matters:**  The model, which accounts for non-conservative mass transfer, reveals that orbital parameters and mass transfer histories can differ substantially from the instant circularization assumption.\n* **BH-hosting systems more likely to remain eccentric:**  Binaries containing black holes are more likely to remain eccentric after mass transfer than those containing neutron stars.\n* **eMT leads to diverse outcomes:** The model, in comparison to the standard method, shows that binaries can experience both stable and unstable mass transfer, impacting the eventual fates of the stars.\n\n**Questions for the Authors:**\n\n1.  What are the key limitations of the delta function approximation used for mass transfer at periapse? How might the results change if a more realistic, phase-dependent mass transfer model is employed?\n2.  How sensitive are your results to the chosen initial binary population parameters (e.g., mass ratios, eccentricity distributions) generated by POSYDON? Could you elaborate on the parameter space that POSYDON covers?\n3.  Could you quantify the impact of other physical effects, such as stellar winds, tides, and magnetic braking, on the overall outcome of eMT simulations?  How do these effects contribute to the bifurcation in the q-ei plane?\n4.  What are the potential observational signatures that could distinguish between binaries evolving under eMT and those evolving via instant circularization?\n5.  What are the next steps for modeling more complex mass transfer scenarios, such as those involving non-conservative mass transfer with phase-dependent rates, and the influence of circumbinary disks?\n\n\n**Suggestions for Related Topics/Future Research Directions:**\n\n1.  Investigate the impact of eMT on the observed properties of X-ray binaries and gravitational wave sources. This would involve detailed comparisons to observational data and population synthesis models to verify the model's accuracy.\n2.  Extend the model to include interactions between two non-degenerate stars in eccentric orbits. This could improve the understanding of common envelope evolution.\n3.  Develop a more sophisticated model for mass transfer that is not restricted to a delta function at periapse.  Including phase-dependent MT rates, especially in the context of non-conservative MT, would refine the analysis significantly.\n4.  Explore the formation scenarios for systems with high eccentricities.  This may involve exploring dynamical interactions, mergers and potential formation in dense stellar environments.\n5.  Perform detailed numerical simulations resolving the hydrodynamical details of mass transfer in eccentric orbits, to more precisely model the rate of mass transfer and its effect on orbital evolution, and incorporate results from such simulations into a self-consistent binary stellar evolution code.\n\n\n**Relevant References:**\n\n1.  Hurley, J. R., Tout, C. A., & Pols, O. R. (2002). *MNRAS*, *329*(4), 897.  (Classic binary evolution code)\n2.  Paxton, B., Bildsten, L., Dotter, A., et al. (2011). *ApJS*, *192*(1), 3. (MESA stellar evolution code)\n3.  Sepinsky, J. F., Willems, B., & Kalogera, V. (2007). *ApJ*, *660*(2), 1624.  (Eccentric mass transfer formalism)\n4.  Fragos, T., Andrews, J. J., Bavera, S. S., et al. (2023). *ApJS*, *264*(1), 45. (POSYDON population synthesis code)\n5.  Eggleton, P. P. (1983). *ApJ*, *268*(1), 368. (Roche lobe model)\n"
    },
    "http://arxiv.org/abs/2411.11831v1": {
        "full_text": "# Let there be neutrons! Hadronic photoproduction from a large flux of high-energy photons\n\nMatthew R. Mumpower1, 2, Tsung-Shung H. Lee3, Nicole Lloyd-Ronning2, 4, Brandon L. Barker†, 2, 4, Axel Gross1, 2, Samuel Cupp1, 2, and Jonah M. Miller2, 4\n\n1Theoretical Division, Los Alamos National Laboratory, Los Alamos, NM 87545, USA\n\n2Center for Theoretical Astrophysics, Los Alamos National Laboratory, Los Alamos, NM 87545, USA\n\n3Physics Division, Argonne National Laboratory, Argonne, Illinois 60439, USA\n\n4Computational Division, Los Alamos National Laboratory, Los Alamos, NM 87545, USA\n\n(Revised November 19, 2024)\n\nSubmitted to ApJ\n\n# ABSTRACT\n\nWe propose that neutrons may be generated in high-energy, high-flux photon environments via photo-induced reactions on pre-existing baryons. These photo-hadronic interactions are expected to occur in astrophysical jets and surrounding material. Historically, these reactions have been attributed to the production of high-energy cosmic rays and neutrinos. We estimate the photoproduction off of protons in the context of gamma-ray bursts, where it is expected there will be sufficient baryonic material that may be encompassing or entrained in the jet. We show that typical stellar baryonic material, even material completely devoid of neutrons, can become inundated with neutrons in situ via hadronic photoproduction. Consequently, this mechanism provides a means for collapsars and other astrophysical sites containing substantial flux of high-energy photons to be favorable for neutron-capture nucleosynthesis.\n\n# Keywords\n\nGamma-ray bursts (629), Nuclear astrophysics (1129), Nucleosynthesis (1131), R-process (1324), Compact objects (288)\n\n# 1. INTRODUCTION\n\nThe formation of the heaviest elements relies on astrophysical environments with a copious amount of neutrons (Burbidge et al. 1957). Neutrons can be found in the cosmos bound in atomic nuclei or in medium under extreme pressure. Free neutrons are rare, owing to a half-life of less than 15 minutes, see Wietfeldt & Greene (2011); Serebrov & Fomin (2011) and references therein.\n\nIn stellar interiors free neutrons are produced via low energy nuclear reactions, 13C + α → 16O + n, and 22Ne + α → 25Mg + n (Meyer 1998; Gallino et al. 1998; Fowler & Hoyle 2002). Neutrons comprise the bulk of neutron stars, owing to the process of neutronization where the Fermi energy of electrons becomes high enough to energetically favor capture with protons via inverse beta decay (Oppenheimer & Volkoff 1939; Bethe & Brown 1995). An ample supply of neutrons make the merger of compact objects (neutron star-neutron star or neutron star-black hole) viable candidate sites for the rapid neutron capture (r process) nucleosynthesis (Lattimer & Schramm 1974; Freiburghaus et al. 1999; Rosswog et al. 2018).\n\nGamma-ray bursts (GRBs) may also be promising heavy element factories. As mentioned above, so-called short GRBs, ‘sGRBs’, (GRBs with the prompt emission lasting less that about two seconds) are believed to originate from the merger of two neutron stars (Abbott et al. 2017) or a neutron star-black hole merger; the extremely neutron-rich material present in these merger events is conducive to a robust r process. In the context of so-called long GRBs, ‘lGRBs’, (GRBs with prompt gamma-ray emission lasting more than about two seconds), the picture is less clear. These GRBs are believed to originate from the collapse of a mas-\n\nMumpower et al.\n\nsive star (Woosley 1993; MacFadyen & Woosley 1999) which forms an accretion disk engine around a compact object that launches a relativistic jet. Here we focus on a central black hole, in the so-called collapsar model.1 Several studies have suggested the presence of r process nucleosynthesis in the disk around the newly born remnant black hole (Fujimoto et al. 2007; Siegel et al. 2019; Anand et al. 2024), while others have suggested that the r-process is severely suppressed in these systems (e.g. Miller et al. 2020; Just et al. 2022; Blanchard et al. 2024).\n\nThe presence of conditions suitable for nucleosynthesis in the GRB jet, cocoon (hot area encompassing the jet), and stellar envelope region remains relatively unexplored. Although the baryon density in GRB jets is necessarily very low in order to accelerate these jets to their inferred ultra-relativistic velocities, the baryon density in the stellar material surrounding a lGRB central engine, as well as the cocoon region created as the jet traverses this stellar envelope, have much higher baryon density. Additionally, dense shells ejected near the end of the massive star’s life may provide yet another potential site for heavy element production, when the γ-rays from the jet interact with these regions.\n\nThe interaction between light and matter in and around these regions can lead to extreme conditions that may be suitable for nucleosynthesis. High-energy, high-flux photon interactions with baryonic matter are relevant for nucleosynthesis in two ways. First, high energy photons have sufficient energy to break apart existing atomic nuclei via the process of photodisentigration. Second, for a range of high-energy photons, hadronic photo-interactions may transmute neutrons to protons or vice versa.\n\nIn this work, we investigate a neutron production mechanism associated with a high flux of high-energy photons. We explore this possibility in the context of lGRBs associated with collapsars. In Section 2 we provide an overview of the physical picture of lGRBs and how photohadronic processes can create neutrons relevant for nucleosynthesis. In the remaining sections, we provide the models and details which support this picture. Section 3 covers the production of jet photons. Section 4 covers the photoproduction of neutrons. Section 5 covers the dynamical interactions between regions of interest to the problem. We simulate nucleosynthesis based on our model parameters in Section 6. In Section 7 we investigate other sites where photo-hadronic processes may emerge and assess their capacity for nucleosynthesis. We end with a discussion of potential observational signatures and concluding remarks.\n\n# 2. PHYSICAL PICTURE\n\nGamma-ray burst jets are readily launched in black hole-disk systems (created when a massive star collapses) through the Blandford-Znajek (BZ) process (Blandford & Znajek 1977; MacDonald & Thorne 1982). Frame-dragging effects around a rapidly rotating black hole wind up magnetic fields (present in the disk, near the black hole horizon) and create a strong Poynting flux along the spin axis of the black hole (for a brief discussion of the BZ process in the context of GRBs see Lloyd-Ronning et al. 2019, and references therein).\n\nAs this energetic jet is launched, a “fireball” forms—a radiation-dominated volume of plasma that is optically thick to pair production, typically containing a small amount of baryons. The fireball is accelerated, with Lorentz factor Γ ∝ r, where r is the distance of the jet head from the center of the star/central engine. For 107 cm ≲ r ≲ 1010 cm, the radiation energy in the fireball is converted to kinetic energy of the baryons. In the matter-dominated phase at r ≳ 1010 cm, the jet coasts with approximately constant ultra-relativistic velocity, with Γ ≳ 100. It may still be optically thick to pair production at this point, up until the opacity drops below the pair production threshold in the frame of the jet2, which is expected to be at r ≳ 1010 cm.\n\nThe flow is still optically thick to electron scattering until about r ≳ 1012 cm, at which point the photons—particularly the γ-rays produced in internal dissipation processes such as shocks or magnetic reconnection events—can escape freely from the region. This is the so-called prompt emission phase of a GRB, at 1012 cm ≲ r ≲ 1015 cm, where synchrotron and inverse-Compton processes produce the initial highly variable “burst” of γ-rays, lasting tens of seconds and peaking at about 500 keV (in the observer’s frame). Beyond this radius, the “afterglow” phase begins: this is the point where the front of the jet has swept up enough of the external medium such that the rest mass energy of the swept up material equals the kinetic energy of the jet, and the jet decelerates. Piran (1999) contains a comprehensive summary of this general picture, including the relevant physical states and radii (see their Table 2) of the GRB jet. For additional reviews, see Piran (2004); Zhang &\n\nWe note that the optical depth to pair production is reduced by a factor of ∼ 1/Γ6 in the frame of the jet (Lithwick & Sari 2001).\n\n# Let there be neutrons!\n\nM´esz´aros (2004); M´esz´aros (2006); Gehrels et al. (2009); Kumar & Zhang (2015); Levan et al. (2016).\n\nThe jet has to travel through stellar material surrounding the central engine (material from the progenitor star that has not circularized into the disk around the black hole)—we term this stellar material the “envelope”. As it does so, it forms a cocoon—a hot, relatively dense (compared to the jet) region around the jet with a thermal X-ray spectrum (Ramirez-Ruiz et al. 2002; Nakar & Piran 2017; De Colle et al. 2018; De Colle et al. 2022). In addition to these interactions in the envelope and cocoon regions, the jet photons can also interact with dense shells of matter ejected before the end of the progenitors lifetime.\n\nThe regions of interest in a lGRB are shown in Figure 1. The jet head is the contact interface between the jet and the stellar envelope. It is in this region that existing baryonic material is exposed to a large flux of high-energy photons; the surrounding cocoon is therefore the most likely place for nucleosynthesis to develop.\n\nAt the interface of light and matter in the jet head region, a large flux of high-energy photons enables exceedingly fast transmutation reactions between protons and neutrons while simultaneously producing mesons. These so-called photo-pion reactions have been traditionally associated with high-energy cosmic rays and neutrinos (Berezinskii & Smirnov 1975; Mannheim 1995; Waxman & Bahcall 1998; Murase et al. 2013).\n\nRelativistic Lorentz contraction results in an effective compression of the stellar density as light interacts with matter; this process creates relatively high density (maximally: 2√2Γρenv) in the jet head region as compared to the existing stellar density (ρenv). Here Γ is the Lorentz factor of the shock front in the frame of the star. In order for this higher density material to become active for nucleosynthesis, it must escape the jet head into the cocoon. Coincidentally, as the jet head plows through the star, it moves the transformed material out of the way at relativistic speeds.\n\nRelatively strong magnetic fields are expected to be generated in the jet environment (Piran 2005; Zhang & Yan 2011; Harrison & Kobayashi 2013) and will confine charged particles (protons and pions) along the axis of the jet with little chance of escape. Neutrons on the other hand have no charge, and therefore have a chance to escape; these particles are expected to escape at roughly the speed of the fluid velocity of the material that is being pushed out of the way of the jet. Conservation of baryon number reduces the baryon density in the jet head while the baryon density in the cocoon increases. The jet acts as its own sieve to filter out neutrons into the cocoon.\n\nFinally, the escape of a profusion of neutrons (at high density) mixing with relatively lower density material of the stellar envelope enables the cocoon region to become neutron rich. With a plethora of free neutrons, nucleosynthesis will proceed with haste. The efficiency with which baryons escape from the jet head plays a crucial role in determining the initial electron fraction (Ye), which is a key parameter governing nucleosynthesis in the cocoon. Furthermore, the continuous mixing of material within the cocoon affects the temporal evolution of both temperature and density. Variations in temperature and density can alter the synthesis of different isotopes thereby influencing the extent of nucleosynthesis.\n\n# 3. JET PHOTONS\n\nIn order to reach the bulk Lorentz factors inferred from observations, which lie in the range of 10 ≲ Γ ≲ 1000, the baryon number density in the jet is expected to be in the range 10−5 cm−3 ≲ nb ≲ 10−3 cm−3 (e.g. Piran 2004). If baryonic loading of the jet is higher than this, the jet cannot be effectively accelerated and efficient production of high-energy photons is unlikely (Piran 2004). Hence, it is unlikely that there is significant hadronic interactions within this jet region.\n\n# 3.1. Functional form of the jet photon flux\n\nWe model the photon flux of the jet using a jointly assembled power law, motivated by the phenomenological fit to observed GRB spectra (Band et al. 1993). The functional form of the piecewise power law is\n\nN(Eγ) =\n\nA Eγ\nfor Eγ < Ebreak\n\nC Eγ\nfor Eγ ≥ Ebreak\n\nwhere Eγ is the photon energy (keV), A is a normalization constant to make the units (photons/cm2/s/keV), Epivot is the pivot energy (keV), α is the low-energy photon index, β is the high-energy photon index and E0 is the break energy (keV). The constant C is not independent, it is determined from a combination of the above parameters. The behavior of this power law at high photon energies depends on β.\n\nWe note the very high magnetic field that launched the jet at the central engine site has decreased significantly at the radii where we suggest neutron production to emerge.\n\nThe variability of the prompt gamma-ray emission light curve combined with its non-thermal (optically thin) spectrum puts a constraint on the bulk Lorentz factor.\n\n# Mumpower et al.\n\n# Figure 1. Schematic of the upper hemisphere of a GRB\n\nthat highlights regions of interest. Each region is associated with different baryon and photon properties. Initially the jet head plows through existing stellar material in the envelope forming a cocoon. The jet may also encounter more dense regions or have baryonic loading which produces additional shocks. Once beyond the envelope, the jet may interact with ejected material in the shell region. With high photon flux and photon energy, the jet head could be a location for hadronic photoproduction. Subsequent nucleosynthesis could occur in the cocoon or shell regions; escaping high energy photons is key for forming heavy elements. Proportions shrunken or exaggerated for the purpose of visualization.\n\n# Figure 2. Schematic showing the range of relative decrease in photon flux\n\nas a function of photon energy depending on the parameter β; β = −1.5 shown in black. The grey hatched region is of interest for hadronic photoproduction.\n\nFigure 2 shows the range of behavior for β ∈ (−3.0, −0.5) with a normalization constant A = 1, α = −0.1, Epivot = 100.0 (keV) and E0 = 300 (keV). The region of interest for hadronic photoproduction is indicated by the grey hatched region and extends in photon energy approximately between 105 keV to 2 × 106 keV.\n\nWe use the normalization constant, A, to explore the photon flux in the regions of interest. When A ≠ 1, we change notation N (Eγ ) → Φ(Eγ ).\n\n# 3.2. (Source) photon flux through the jet head\n\nWe would like to estimate the γ-ray flux in the regions discussed in the previous section, particularly the flux impinging on the stellar envelope material at the jet head.\n\nFor distances of r ∼ 1010 cm, the fireball is expected to still be in the optically thick regime. However, many studies Pe’er et al. (2006); Beloborodov (2010); Vurm et al. (2011); Bromberg et al. (2011); Ahlgren et al. (2019) have shown that the spectrum in the sub-photospheric region can undergo dissipation processes that create a pronounced high energy “non-thermal-like” γ-ray tail. These spectra can in principle be very hard, with power-law indices much harder than both a thermal spectrum and the typical β ∼ −2.5 high energy index. Additionally, inverse Compton processes in the sub-photospheric region can lead to a copious number of even higher energy photons (Ahlgren et al. 2019).\n\nIf one assumes that the prompt γ-ray spectrum is made in this photospheric region (or, alternatively, that the jet becomes optically thin and creates non-thermal photons while still in the stellar envelope region), we can estimate the photon flux at the jet head interaction region. Drawing on Figure 2 of Ahlgren et al. (2019), the observed photon flux at 106 keV is about 5 × 10−3 ph/cm2/s/keV. We can parameterize this γ-ray spectrum with a peak at 10 keV at a normalization of 10 ph/cm2/s/keV with a high energy power-law photon index of −1.\n\nIn order to estimate the photon flux at the source, we need to multiply by a factor of (d/rjh)2, where dl is the luminosity distance and rjh is the radius where the jet head is interacting with the envelope. If we assume a typical GRB distance of dl ≈ 1028 cm and the jet interaction radius of rjh ≈ 1010 cm, we find the photon flux at the peak of the spectrum is A = 1037 ph/cm2/s/keV, whereas the flux at 106 keV (according to our extrapolation above from Ahlgren et al. 2019), is on the order of Φγ ∼ 1033 ph/cm2/s/keV. We note that jet head\n\n# Let there be neutrons!\n\ninteracts with this envelope region over a timescale of 10’s to 100’s of seconds (from 1010 cm < r < 1012 cm or even longer for more extended envelopes). The spectrum has energy injection from the jet so photon production should be sustained on this timescale.\n\n# 3.3. Additional high-energy photons from the cocoon\n\nWe again note that the cocoon is expected to primarily emit a thermal spectrum, with a temperature that falls in the X-ray range Ramirez-Ruiz et al. (2002); Lazzati et al. (2015); De Colle et al. (2018). However, (De Colle et al. 2018) pointed out that the thermal X-ray photons from the cocoon region can stream into the relativistic jet region and be inverse Compton (IC) scattered, potentially contributing to the high energy photons in the jet region. They calculate this IC spectrum, shown in their Figures 11 and 12 for two different scenarios of the jet initial conditions. If we assume a radius of rIC ≈ 1013 cm where the cocoon photons interact with the energetic electrons in the jet, we estimate an IC photon flux of ∼ 1022 ph/cm2/s/keV at 106 keV.\n\n# 3.4. Photon flux through previously ejected shells\n\nAs the GRB jet collides with previously ejected shells, it is expected to be in its optically thin phase, possibly just at the time of onset of the afterglow, so there is both the prompt and afterglow high energy γ-ray flux that will interact with the baryons in this shell. The photon flux in this region is expected to be A ∼ 1029 ph/cm2/s/keV at the peak of the spectrum (∼ 500 keV in the observer’s frame). If we take a typical prompt emission power-law index of β = −2, the photon flux at 106 keV (where the cross sections for hadronic photoproduction reaches a maximum) is roughly Φγ ∼ 4 × 1021 ph/cm2/s/keV.\n\n# 4. CREATING NEUTRONS\n\nHigh energy photons on the (order of 105-106 keV) incident on protons and neutrons produces hadrons (baryons and mesons). These processes are often referred to as photo-meson or photo-pion processes due to the production of pions. Dominant interactions include both direct and resonant (single pion) production, and multiple pion production (M¨ucke et al. 1999). Single meson production processes include:\n\n- γ + p → π+ + n,\n- γ + n → π− + p,\n- γ + n → π0 + n,\n- γ + p → π0 + p.\n\nThe first process creates neutrons and the second process destroys neutrons. The latter two processes...\n\n# Mumpower et al.\n\ncoupled-channel equations:\n\nTβ,α(pβ, pα; W ) = Vβ,α(pβ, pα; W ) + XZ + n + p + p + + n\n\np2, dpVβ,γ(pβ, p; W )\n\n× Gγ(p; W )Tγ,α(p, pα; W )\n\n(8)\n\nwith\n\nVβ,α(pβ, pα; W ) = vβ,α(pβ, pα) + XΓN∗(pβ)ΓN∗,α(pα)\n\nW − MN\n\n(9)\n\nwhere α, β, γ = πN, ηN, πΔ, σN, ρN, KΛ, KΣ;\n\nGγ0∗ is the bare mass of the excited nucleon state N∗; (p; W ) is the Green’s function of the channel γ;\n\nMN vβ,α(pβ, pα) is defined by meson-exchange mechanisms derived from effective Lagrangians, and the vertex interaction ΓN∗,α(pα) define α → N∗ transition.\n\nThe results from the ANL-Osaka model are finalized in Kamano et al. (2013). The predicted reaction amplitudes and the formula for using these amplitudes to calculate the cross sections of γN, πN → πN, ηN, KΛ, KΣ, ππN are given in Kamano et al. (2019). The robust results are particularly adept at describing experimental data from photoproduction experiments, such as those conducted at Jefferson Lab and other high-energy facilities (Garcia-Recio et al. 2019).\n\nTheoretical predictions from the model aid in the interpretation of experimental results and the design of new experiments aimed at probing the excitation spectrum of nucleons (Nakamura et al. 2020) and offers insight into how hadronic properties evolve in different nuclear environments (Oset & Ramos 2021).\n\nIn this work we use the aforementioned information to compute cross sections of the hadronic photoproduction processes (2-5) using the methodology outlined in Kamano et al. (2019). The Appendix provides additional details.\n\nCross section for the photoproduction processes (2-5) are shown in Figure 3. Transmutation cross sections between neutrons and protons are designated by solid lines with scattering cross sections are indicated by broken lines. The cross section for process (2) matches well with experimental data with small uncertainty (not shown). The cross section for processes (3 and 4) are purely theoretical predictions as neutron targets do not exist.\n\nAll cross sections peak around Eγ = 300 MeV owing to the Δ(1232) resonance of nucleons (Particle Data Group et al. 2022). Proton creation from photons incident on neutrons dominates from threshold to approximately Eγ ∼ 700 MeV. Higher energy photons, those with Eγ ≳ 700 MeV, favor neutron production. All cross sections tend towards zero above Eγ ∼ 1800 MeV.\n\nThe creation rate of neutrons depends on the photon flux (Φ), proton number density (np) and the cross section for process (2). The neutron production rate is defined by\n\nrn = np ∫0∞ Φ(Eγ)σγp(Eγ)dEγ = nprp,\n\n(10)\n\nwhere the integral runs over all possible photon energies. The units for Eq. 10 are given in number of particles (neutrons) per unit volume per second. It is also convenient to write this in terms of abundance, by dividing by the total baryonic density (Yx = total ),\n\nRn = Yp ∫0∞ Φ(Eγ)σγp(Eγ)dEγ = Yprp.\n\n(11)\n\nHadronic photoproduction of protons from neutrons (3) follows a similar form,\n\nrp = nn ∫0∞ Φ(Eγ)σγn(Eγ)dEγ = nnrn,\n\n(12)\n\nand in terms of abundance,\n\nRp = Yn ∫0∞ Φ(Eγ)σγn(Eγ)dEγ = Ynrn.\n\n(13)\n\nDepending on the baryonic content of the material under consideration, one rate may dominate over the other, or a quasi-equilibrium may arise.\n\n# Let there be neutrons!\n\n# 4.3. Inverse (meson collision) processes\n\nThe hadronic processes (2-3) which create or destroy neutrons also have inverse processes when a neutron or proton collides with a charged pion,\n\nπ+ + n → γ + pπ− + p → γ + n\nThe short half-life of charged pions (T1/2 ∼ 10−8 s), and relatively slow interaction compared to forward processes limits these inverse processes. Below we show that the number of interactions is small compared to the forward rates.\n\nConsider a low energy (Eπ < 100 MeV) charged pion incident on a nucleon with kinetic energy Eπ = 20 MeV. The cross section for this reaction is on the order of σ ∼ 20 (mb) (Longo & Moyer 1962). The mean free path is\n\nλ = bσn\nwhere nb is the number density of the nucleons. The mean propagation distance before decay of the pion is\n\nd = vγT1/2\nwhere v is the pion velocity, γ is the Lorentz factor, and T1/2 the laboratory half-life. To estimate the number of pion interactions, take the ratio of these two quantities,\n\nnints = λ .π d\nThe rest mass of a charged pion is approximately 140 MeV. With K = 20 MeV the Lorentz factor is γ ∼ 1.143, which translates into a velocity of vπ = 0.484c. The propagation distance before decay of the pion is then d ∼ 0.484 × 1.143 × 1.8 × 10−8c ≈ 298.7 cm. At low number density is nb = Mn ≈ 6 × 1023, the baryonic mass densities, ρb ∼ 1 g/cm3 6×1023×21.0×10−26 ≈ 8.3 × 10−10. The mean free path is λ ∼ 2 cm. Therefore the number of interactions is nints ∼ .3×108 298.72 ≈ 3.56.\n\nFor higher energy pions the Δ resonance plays a role, increasing the cross section. For the sake of argument, a factor of 1000 increase in cross section is still not sufficient to compete with the forward processes, (2) and (3). If sufficiently large baryonic densities—for instance, those near nuclear saturation density—accompany the regions where hadronic photoproduction processes are operating, the inverse mesonic reactions will play a more substantial role. However, given the nature of the jet and stellar material considered here, we do not suspect that this type of density will be achievable.\n\nConsult the Appendix (Sec. 9) for particle spectra associated with the forward reactions.\n\n# 4.4. Hadronic photoproduction\n\nTo follow the population of relativistic particles one can use the kinetic equation formulated by Ginzburg & Syrovatskii (1964). The most general form of these coupled equations track the evolution of the particle number as a function of phase space (position and momentum) and time. In a single zone network, one may reduce the equations to a function of energy, and further down to particle number density by integration over the spectrum. This last option takes the simple form,\n\n∂nx∂t = Sx + Lx\nwhere n is the number density, the subscript x indicates a hadron (baryon or meson) or lepton, Sx indicates a source term that creates particle x and Lx is a loss term that destroys particle x. For relativistic particles, an entire suite of appropriate reactions should be considered.\n\n# 4.5. Interactions in the jet head\n\nHere we simplify the hadronic reaction network by only considering transmutation reactions between protons, neutrons, and charged pions in the jet head and escaped neutrons outside the jet head region. This reduced set of possibilities provides an estimation for the interactions occurring at the jet head. The ordinary differential equations describing the population of these species are as follows\n\n∂np∂t = nnrn + nnn - nprp + nnnπvπσπ - npnπvπσπ∂nn∂t = nprp - nnτdecay - τescnn - nnrn∂nnesc∂t = nn - nnnπvπσπ + npnπvπσπ∂nπ∂t = nprp + nnrn - npnπvπσπ - nnnπvπσπ - nπ\nwhere np is the proton number density in the jet head, nn is the neutron number density in the jet head, nnesc are the neutrons that escape the jet head region corresponding to a timescale τesc, τdecay is the neutron decay lifetime, nπ is the pion number density in the jet head, vπ is the relative velocity of pions to nucleons and σπ is an estimation of the cross section of pions with nucleons, and t is time.\n\n# 4.6. Baryonic escape of the jet head material\n\n# 4.7. A hadronic reaction network for the jet head\n\nThe proton and pions do not escape the collimated jet due to the magnetic confinement of charged particles along the direction of the photon flux (τesc ≈ τesc ≫ τesc). To see this, consider a charged particle in a magnetic field. One of the faster estimates for the escape time is Bohmian diffusion (Bohm 1949)\n\nτesc ≈ L2\n\n(24) D\n\nwhere L is the perpendicular distance that must be traveled to exit the jet and D is the diffusion coefficient. The diffusion coefficient can be approximated by\n\nD ≈ vλ\n\n(25)\n\nwhere v is the particle velocity and λ is the mean free path. For particles spiraling in a magnetic field the mean free path is related to the gyro or Lamor radius,\n\nλ ≈ ζrL\n\n(26)\n\nwith the gyroradius,\n\nrL = qB, γmv\n\n(27)\n\nwhere ζ describes the turbulence of the magnetic field (effectively giving an uncertainty in the diffusion coefficient of a factor of a few (Spitzer 1960)), γ is the Lorentz factor of the particle, m is the particle mass, q is the particle charge, and B is the magnetic field strength. As discussed previously, we expect a significant magnetic field is generated and sustained in the fireball plasma with values B ∼ 104 − 1010 G (Piran 2005; Zhang & Yan 2011; Harrison & Kobayashi 2013).\n\nThe escape timescale for protons is then\n\nτesc ≈ qBL2\n\n(28) ζγmpv2\n\nThe perpendicular crossing distance is L = r tan(θ) where θ is the half opening angle of the jet and r is the radial distance from the compact object, as in Figure 1. Using fiducial numbers for the above quantities, a 300 MeV proton (γ = 1.32) at r = 108 cm with ζ = 1/3, q = 1.6 × 10−19 C, B = 106 G, gives an escape time of τesc ∼ 4.3 × 103 s.\n\nIn contrast, the neutron escape timescale is estimated from calculating the average distance over the velocity of the fluid, tesc ≈ v L. At a radius of r = 108 cm, this is around tesc ∼ 10n. At larger radial distances, there will be larger perpendicular distances to cross, and the neutrons will have a longer escape time on average.\n\n# Let there be neutrons!\n\nLognumber density (#/cm³)\n\n|Neutrons|Protons|Escaped Neutrons|Charged Pions|\n|---|---|---|---|\n|25.0| | | |\n|24.5| | | |\n|24.0| | | |\n|23.5| | | |\n|23.0| | | |\n|22.5| | | |\n|22.0| | | |\n|21.5| | | |\n|21.0| | | |\n\nTime (s)\n\nFigure 4. A simplified hadronic reaction network starting with 100% protons (yellow). Neutrons (red) and pions (green) are produced nearly instantaneously. Baryon number is conserved (solid black line), despite neutrons escaping to another zone (blue); Meson number is not a conserved quantity (green).\n\nNucleosynthesis with electron fractions in this range would be proton-rich. Assuming the photon flux dissipated, under near symmetric conditions the initial conditions generated from the quasi-equilibrium would result in elements like Ni (Z = 28). In more extreme conditions, an overabundance of protons could yield some form of rapid proton capture nucleosynthesis (Schatz et al. 2001). For neutron-rich nucleosynthesis to happen, the neutrons must escape the jet head region as previously discussed.\n\n# 5. DYNAMICAL INTERACTIONS BETWEEN THE JET, ENVELOPE, AND COCOON, AND BETWEEN THE JET AND PREVIOUSLY EJECTED SHELLS\n\nIf 4He, or heavier nuclei (such as 12C), instead comprise the initial composition, these nuclei will be photodissociated into free protons and neutrons as their binding energies are much less than the high-energy γ-rays. Under these starting assumptions, the only change to the dynamics is that the timescale for neutron production and transmutation is faster owing to pre-existing (bound) neutrons.\n\nThe lowest flux at Eγ ∼ 106 keV suitable for considerable neutron escape is Φγ ∼ 1025 ph/cm2/s/keV. This is the minimal flux for an escape timescale of tesc ∼ 10−4 s. Below this nominal value, the timescale for neutron production becomes longer than that of the neutron escape time limiting the possibility of neutron-rich nucleosynthesis. As the jet widens during its progression through the stellar material (recall Figure 1) it will lengthen the neutron escape time. Concurrently, the photon flux (Φγ) is evolving from the interaction of the jet head with stellar material as well as from continual photon injection. It is therefore prudent for future simulations to study the balance of these two timescales.\n\nThe shock interface can be described by the relativistic Rankine-Hugoniot jump conditions (Taub 1948). In the frame of the star, the post-shock jet head baryonic density is Lorentz contracted. For an ultra-relativistic shock, the maximum value it can reach is:\n\nρheadmax = 2√2Γρenv\n\nwhere Γ is the Lorentz factor of the jet (shock) and ρenv is the baryonic density of the (pre-shock) envelope (Blandford & McKee 1976). In actuality, there will be some efficiency in which relativistic hydrodynamical processes increase the density of the jet head. We parameterize this efficiency via ϵ, which ranges between 1 and 2√2Γ,\n\nρhead = ϵρenv.\n\n# 4.8. Quasi-equilibrium\n\nFigure 4 shows a quasi-equilibrium between the neutron production (2) and neutron destruction processes (3). We expect this to supervene in the jet head region.\n\n# 5.1. Functional form of the jet Lorentz factor\n\nThe behavior of Γ(r) for a lGRB can be written\n\nΓ(r) =\n{ R0r                 Acceleration Phase: R0 ≤ r ≤ Rs\n{ η                     Coasting Phase: Rs ≤ r ≤ Rd\n{ η r       − 2/3      Deceleration Phase: r ≥ Rd\n\nwhere R0 is the starting radius of the jet, Rs sets the coasting phase, Rd sets the deceleration phase and η represents the maximum of Γ for a given burst. For continuity between the different phases, the coasting radius is constrained to Rs = ηR0.\n\n# 5.2. Functional form of the stellar density\n\nStandard practice treats the baryonic mass density of the envelope region as a power law in radius which can be derived from a polytropic equation of state (Woosley et al. 2002). It has recently been shown by Halevi et al. (2023) that the baryonic density of the envelope region of a collapsing massive star can be written as\n\nρenv(r) = ρ0 r         −δ 1 − r         3\nRg               R∗\n\nwhere r is the radial distance, ρ0 is a scaling distance, Rg is the gravitational radius of the compact object, and R∗ is the radius of the star. We take values of ρ0 = 2 × 109 g/cm3, δ = 1.5, Rg = 6.3 × 105 cm, and R∗ = 1012 cm for these parameters. We are only interested in densities at r > 107 cm once the jet has formed, so values of the density r < 107 cm are not considered.\n\n# 5.3. Interaction of the jet and envelope\n\nWe set the jet parameters to R0 = 108 cm (ten times launching point), η = 100 (maximum Lorentz factor), and Rd = 1013 cm (interaction with previously ejected shell material). After the launch of the jet, relevant quantities are ρenv(r) ∼ 3 × 107 g/cm3 and Γ(r) = 1 at a distance of r = 108 cm. As the jet accelerates, it interacts with less dense material. At r = 109 cm, ρenv(r) ∼ 3 × 1023 and Γ(r) = 10. At r = 1010 cm, ρenv(r) ∼ 9 × 104 g/cm3 and Γ(r) = 100, entering the coasting phase.\n\nFigure 5 shows the stellar envelope density and jet Lorentz factor as a function of radial distance. The product of these quantities yields the effective head density (recall Eqs. 30 and 31). Depending on the dynamics,\n\nρhead(t)Vheadc2 < Lj ∆t\n\nwhere Lj is the power in the jet, ∆t is the timescale over which the jet head pushes on the plowed region and Vhead is the volume of the plowed region. The volume can be written as:\n\nVhead = πrcone∆x = π(rjhtan(θ))2∆x\n\n# Let there be neutrons!\n\nwhere again rcone is the radius of the conical opening at the jet head, rjh is the radius of the jet from the central engine, θ is the half-opening angle of the jet, and ∆(x) is the thickness of the plow region. We note that our assumption of a conical jet is conservative, and we expect that nucleosynthesis is even more likely for jets that are collimated by the surrounding stellar material.\n\nUsing ρhead(t) = 2√2Γρenv(t), we find that an upper limit to the thickness of this plowed region can be approximated as:\n\n∆x &lt; 2√2Γρenv(t)π(rjhtan(θ))2c2,Lj ∆t (36)\n\nor:\n\n∆x &lt; 5 × 107cm(ρenv(Lj /103gcm−1)(∆t/10s)cm)2,(t)/1050ergs3)(rjh/1010 (37)\n\nwhere we have used a Γ of 10, and a half opening angle of 5 degrees.\n\n# 5.5. Setting the initial electron fraction for nucleosynthesis\n\nThe electron fraction of the material is difficult to ascertain due to its dependence on the dynamics. In the most extreme case, all baryons in the jet head are converted to neutrons, escape, and this neutron gas in turn mixes with material in the cocoon. The maximum ratio of the jet head number density (all neutrons) to the pre-existing stellar envelope density (all protons) is\n\nnhead / nenv = 2√2Γρenvmp / ρenvmn = 2√2Γ mnmp = YpYn. (38)\n\nConsidering only a population of neutrons and protons, the electron fraction is\n\nYe = Yp = Yn / Yp + 1 .1 (39)\n\nYn + Yp\n\nThe minimum electron fraction for a dense neutron gas streaming into a less dense gas of protons is then a function of Γ,\n\nYe min = 2√2 mn / mp (Γ + 1) . (40)\n\nThis value becomes the initial electron fraction of the cocoon. For Γ = 1, Ye min ∼ 0.26 and a Γ = 10 yields Ye min ∼ 0.034. If the stellar envelope instead consists of helium, the extreme case of total neutron conversion gives a minimum electron fraction of\n\nYe min ≈ 4√2( mn / mp + 1)Γ + 1 . (41)\n\nFor Γ = 1, Ye min ∼ 0.081 and for Γ = 10, Ye min ∼ 0.0088.\n\nIf achieved in nature, these excessively low electron fractions provide a natural explanation for the universality of the r-process pattern above Z ≳ 50 (Cowan et al. 1999; Sakari et al. 2018; Farouqi, K. et al. 2022).\n\nFor less extreme cases, some smaller fraction of neutrons will escape, shifting the electron fraction higher towards more equilibrium like conditions, Ye ∼ 0.5. The density of the escaped neutrons may also be reduced via dynamical processes. Therefore, depending on the complex dynamics that develops between the jet head, the stellar envelope and the cocoon, a wide range of electron fractions might be possible as the jet plows through the star. Using Eq. 31 and starting from free protons, the initial electron fraction for nucleosynthesis under the assumption of perfect mixing and full escape of all neutrons is then\n\nYe = ϵ mn / mp + 1 . (42)\n\n# 5.6. Temporal evolution of the cocoon density for nucleosynthesis\n\nThe evolution of density also plays a key role for nucleosynthesis as nuclear reactions depend on the square of this quantity (Kippenhahn et al. 2012). Expansion into free space under homologous (r = v × t) assumptions yields a density evolution that depends on t−3. Expansion of a shell of material depends on t−2. Below we argue that the density emitted from the jet head first obeys a t−1 evolution followed by a steeper evolution as the material expands.\n\nConsider a system consisting of two gases where the first gas is more dense than the second. As the first gas moves into the second, it picks up mass,\n\ndm1/dx = ρ2S , (43)\n\nwhere m1 is the mass of the first gas, ρ2 is the density of the second gas and S is the cross sectional area traversed over distance dx. As a function of distance, the mass of the first gas is\n\nm1(x) = m1 + ρ2Sx , (44)\n\nwhere m1 is the initial mass of gas 1. Let the gases be mixed once m1(x = L) = 2m1. The mixing length is\n\nL = m1 / ρ2S . (45)\n\nThe mixing timescale is\n\nτmix = vL . (46)\n\nwhere the velocity, v of the fluid is a substantial fraction of the speed of light; here we assume v = 0.8c. The mass density of gas 1 as a function of time is then\n\nρ1(t) = ρ1vt = ρ1t, (47)\n\nwhere ρ1 is the initial density of gas 1.\n\nAs the gas continues to mix it opens more degrees of freedom in spatial directions, on a different timescale leading to a steeper power law. The density evolution in time for nucleosynthesis can be modeled as\n\nρ(t) = ρ0 (1 + τ)1 + ξ t−1, (48)\n\nwhere ξ > 1.\n\nAs an example, for a ρ2 = 4 × 104 g/cm3, m1 = 1020 g, and S = 106 cm2, the first timescale can be estimated to be around τ1 = τmix ∼ 3.5 × 10−2 s. In what follows we treat τ1, τ2, and ξ as adjustable parameters.\n\nBecause the cocoon is hot (relative to the stellar envelope), the density of gas in this region is expected to be smaller than in the jet head-envelope interaction region. The cocoon density may mix with the stellar envelope on relatively fast or slow timescales. For the latter case, simulations of the cocoon have shown an average mass density of ρc ∼ 1 g/cm3 (or corresponding baryon number density nb ∼ 1024 cm−3) that remains relatively constant from about rcocoon ∼ 109 − 1011 cm over timescales on the order of ∼ 10’s to 100’s of seconds (Salafia et al. 2020; Suzuki & Maeda 2022; De Colle et al. 2022; Gottlieb et al. 2022). Beyond this timescale, the cocoon has expanded and its density drops off steeply (see, e.g. Suzuki & Maeda 2022). In the Section 6 we consider the case of moderately and slowly expanding material using Eq. 48 in the context of nucleosynthesis.\n\n# 5.7. Jet interaction with previously ejected shells\n\nIn the case of a choked jet, the burst does not have enough power to continually plow through the star to reach the outer envelope nor to previously ejected shells of material. It is unclear how much nucleosynthesis could result, but it is likely to be less than the case when the jet plows full steam ahead. Consequently, because of the ‘hidden’ nature of such an event, nucleosynthesis could ensue without producing a measurable γ-ray signal to an outside observer. Instead, neutrinos may be used as potential messengers (Mészáros & Waxman 2001; Murase & Ioka 2013; Senno et al. 2016; Denton & Tamborra 2018).\n\nNear the end of a massive star’s life, the star can undergo episodic eruptions of shells of material (Smith & Owocki 2006; Mesler et al. 2012; Herwig et al. 2014; Fuller & Ro 2018; Mauerhan et al. 2018). These shells can have masses that lie in the range between 0.1M⊙ to a few M⊙ (e.g., Moriya et al. 2017; Morozova et al. 2018). Depending on when in the massive star’s life cycle they were ejected and at what velocity, they are typically located anywhere from r ∼ 1013 cm - 1020 cm away from the center of the star. The widths of the shells typically range from 1013 cm < Rshell < 1015 cm.\n\nIf we consider a 1 M⊙ shell at a distance of r ∼ 1015 cm with a width of Rshell ∼ 1014 cm, this leads to a baryon number density of nb ∼ 10.\n\n# 6. NEUTRON-RICH NUCLEOSYNTHESIS\n\n# Let there be neutrons!\n\nIn this work we focus the discussion of nucleosynthesis to neutron-rich outcomes in the cocoon region where it is believed the bulk of the nucleosynthesis will transpire. Based off the discussion in previous sections, the electron fraction in this region can become exceedingly neutron-rich. A well resolved magnetohydrodynamical simulation for the distribution of Ye is the subject of further investigation.\n\nWe simulate nucleosynthesis using version 1.6.0 of the Portable Routines for Integrated nucleoSynthesis Modeling (PRISM) reaction network (Sprouse et al. 2021). This network includes all relevant low-energy nuclear reactions (Mumpower et al. 2024), including those necessary to track nuclear fission (Sprouse et al. 2020). It should also be noted that the timescale for neutrons to thermalize from their high energy production (En ≳ 300 MeV) is thought to be fast due to the relatively large density of the spawning material in the jet head region. Therefore, neutron-induced reactions may be described by Maxwellian averaged cross sections that are functions of the local temperature, as is standard practice.\n\nAbundance, Y(A)A = 170. The second r-process peak at A = 130 arises due to the N = 82 shell closure.\n\nUnder scenario (c), neutron capture is not as rapid, but persists for a longer time as compared to the previous cases. Photodissociation reactions do not play much of a role because the temperature starts and remains relatively low. Instead, there is a quasi-equilibrium between β-decay and neutron capture, much like a ‘cold’ r-process of Wanajo (2007). Due to the long duration of neutron capture, the pattern looks markedly different from the solar residuals and the peaks are off-set to higher mass numbers. The behavior of nucleosynthesis in (c) is more like that of the i-process or intermediate neutron capture process than an r-process (Cˆot´e et al. 2018; Choplin et al. 2021). However, it is not a contemporary i-process believed to halt around the lead region.\n\nWe model three interesting cases of outflow material in the cocoon region. For simulation (a) we follow inefficiently mixed material that expands like a shell at late times. The parameters are T0 = 2 GK, ξ = 2, and r = 109 cm, with a pessimistic mixing ϵ = 2.0. The initial density is ρ0 = 3.2 × 104 g/cm3, and timescales are set to τ1 = τ2 = 3.5 × 10−2 s with a starting Ye = 0.334. For simulation (b) we take the same starting radius, except now we use the maximal mixing epsilon (ϵ = 2√2 × 10 ∼ 28.3). The initial density is then ρ0 = 8.9 × 105 g/cm3 and the starting Ye is 0.034. The remainder of the parameters are the same. The higher density neutron region may interact in the cocoon region for some time. To explore this possibility we consider a third simulation (c), where we take r = 5.3 × 1011 cm, ρ0 −4 s, τ2 = 10−1 s with a starting Ye = 0.0035 = 6.5 × 103 g/cm3 (ϵ = 282.8), T0 = 0.1 GK, τ1 = 10 and ξ = 3.5.\n\nThe resultant nucleosynthesis for the three cases is shown in Figure 7. Under scenario (a), weak r-process conditions are found creating nuclei up to the second r-process peak (mass number A ∼ 130). Compare this outcome with simulation (b) — the case of efficient mixing with all else equal to simulation (a) — where a robust r-process is possible that produces a substantial amount of actinides. This simulation undergoes fission recycling producing a relatively flat pattern between A = 100 and 170. The integration of all three scenarios generates an abundance pattern that closely aligns with the full range of solar r-process residuals, encompassing the first, second.\n\n|Sim. (a)|Sim. (b)|Sim. (c)|Solar|\n|---|---|---|---|\n|103|104|105|60|\n|80|100|120|140|\n|160|180|200|220|\n|240|260|280| |\n\nFigure 7. Resultant neutron-rich nucleosynthesis simulated with different condition sets (see text for details) at 4 × 108 seconds. Black dots indicate the solar r-process residuals.\n\n# 6.1. Ejection of material\n\nIt is important to point out that any nucleosynthesis that occurs in the cocoon region is expected to be “ejected” or eventually gravitationally unbound from the central engine (Lazzati et al. 2015; Salafia et al. 2020). Therefore the imprint of any nuclear processes that happens in this region will be present in the surrounding circumstellar region.\n\nWhen the jet deposits enough energy in the cocoon to roughly equal the binding energy of the star—f Lj ∆t ∼ Ebind where f is the fraction of jet energy deposited into the cocoon, Lj is the power in the jet, ∆t is the timescale for this limit to be reached, and Ebind ∼ GM ∗ 2/R∗ is the binding energy of the star—the cocoon (and surrounding matter) will be unbound and able to travel into the circumstellar medium. At this stage, any elements made in the cocoon will be ejected into the interstellar medium. We estimate this timescale to be:\n\n∆t ≈ 2 × 103s(f /0.01)(R/1010cm)(Lj /1050erg/s) .(M/20M⊙)2\n\nIn other words, the cocoon should unbind on the order of about 2000 seconds for typical values of a GRB progenitor mass M ∼ 20M⊙, radius of interaction R ∼ 1010 cm, and luminosity of the jet Lj ∼ 1050 erg/s, and if we assume roughly one percent of the jet energy is transferred to the cocoon.\n\nTo estimate the amount of material ejected from the cocoon region, consider the conical area plowed by the jet. The amount of mass is\n\nM = 2π(1 − cos(θ0)) ∫R0R* ρenv(r)r2dr.\n\nUsing previous values for these quantities we estimate that M ∼ 0.58 M⊙ between R0 = 108 cm and R* = 1012 cm. Because the jet emits a bipolar distribution at both 0 and 180 degree angles a factor of two is needed, resulting in an estimate of 1.16 M⊙. If the jet starts ramping up at larger radii, less mass will be impacted. A lower bound for R0 is R0 = 107 cm in which case the total conical mass is 3.2 M⊙; this value can be considered an upper bound. Therefore, somewhere between 0.1 to ∼ few M⊙, will become unbound from the central engine remnant. This estimate aligns with observational constraints on the cocoon ejected mass for the very special case where spectroscopic evidence of a cocoon was detected (Izzo et al. 2019). Even a small portion of this ejecta undergoing nucleosynthesis would be impactful for the chemical enrichment of galaxies.\n\n# 7. POSSIBLE ASTROPHYSICAL SITES\n\nTable 1 provides a list of other astrophysical phenomena with jets, where we might ask if the hadronic photoproduction processes discussed in this paper are possible. We provide some fiducial numbers for the density in the jet regions, the expected high energy gamma-ray flux, and the relevant mass scale involved. We note that for objects like X-ray binaries and AGN disks, the regions around the jet—in contrast to GRBs—are generally very tenuous (the higher density regions are in the accretion disks themselves).\n\nWe have not included in this table the traditional sites considered for the r process, like double neutron star (Hotokezaka et al. 2018) or neutron star-black hole mergers (Curtis et al. 2023) or accretion induced collapse of white dwarfs (Chi-Kit Cheong et al. 2024).\n\n# 8. POTENTIAL OBSERVATIONAL SIGNATURES\n\nHere we list and discuss possible observable signatures of neutron production associated with GRBs.\n\n- If neutron creation is robust, and there is sufficient density in surrounding material, GRBs may be associated with r-process nucleosynthesis. Subsequent interaction between the radioactively decaying material and emitted light can produce a kilonova (Metzger 2019). An extended duration of kilonova afterglow, particularly in the red spectrum, would indicate the presence of actinides (Zhu et al. 2021; Barnes et al. 2021); such a scenario has not yet been observed.\n- Alternatively, γ-ray lines stemming from nuclear transitions can also be used to diagnose the production of heavy elements (Korobkin et al. 2020). A line which would indicate the production of gold is the Eγ 208Tl. Depending on the observational timescale of this line, it can be associated with a complete r process that produces actinides (Vassh et al. 2024). Other characteristic nuclear lines.\n\n# Let there be neutrons!\n\n# Table 1. Astrophysical Sites of Potential Interest for Hadronic Photoproduction\n\n|Site|nb (cm−3)|Φγ at 106 keV (ph/cm2/s/keV)|nucleosynthesis (Y/N)|Ejected Mass M⊙|\n|---|---|---|---|---|\n|GRB jet/stellar envelope|1015 − 1027|1020 − 1020|Y|0.1 ∼ 3|\n|AGN jet/CGM environment|10 − 1020| |N|&lt; 0.01|\n|Compact Object Jets in AGN|1010 − 1018|Pulsar Wind Nebulae|Protostellar jets|1010 − 104|\n| |109 − 1012|10−3 − 100 − 102|N|&lt; 0.01|\n|X-ray Binary Jets|15 − 10|10|N|&lt; 0.01|\n| |− 10|??|—|&lt; 0.01|\n\nNote: Fiducial numbers for baryon number density and photon flux at 106 keV in different astrophysical environments with jets, where high energy gamma-rays may be produced. The photon flux Φγ is estimated at the source. Note this table does not include traditionally considered r-process sites like double neutron star mergers Hotokezaka et al. (2018) or accretion induced collapse of white dwarfs (Chi-Kit Cheong et al. 2024).\n\nexist—for example, neutron capture on protons to create deuterium, n + p → d + γ could lead to signature γ-ray emission with Eγ = 2.223 MeV. Observable gamma-ray lines may be challenging to detect due to broadening effects, which arise from the Doppler shift caused by the relative velocity of the ejected material with respect to the observer.\n\n- Robust conditions that produce substantial nuclear fission are found to be plausible, in accordance with recent observational hints of fission in the cosmos (Roederer et al. 2023). As a result, signatures of fission may also be associated with GRBs in future observations (Wang et al. 2020). The production of 254Cf, or other relatively long-lived heavy species undergoing fission may also provide a smoking gun signature of a complete r-process; this signature may be observable with the James Webb Space Telescope (Zhu et al. 2018).\n- If neutron creation is moderate coupled with a slowly evolving density, GRBs can be associated with an intermediate (i-process) nucleosynthesis. A full i-process may reach Pb (or beyond), yielding a signature of 208Tl (Vassh et al. 2024). As shown here, this process also produces lanthanides, making it difficult to distinguish between kilonova with a red spectral component that has been traditionally associated with the r-process.\n- If sufficient neutrons are created and sustained along the front of the jet head, or if there is sufficient neutron production as the jet interacts with previously ejected shell material, a neutron precursor event (Metzger et al. 2014) could be associated with GRBs.\n- Neutron-deficient conditions (not explored here), those in which the proton production channel (3) is favored or sustained in some way, may yield the production of elements like 56Ni that have distinguishable light curves (Colgate & Petschek 1980).\n- A high-energy ‘pion bump’ could be associated with GRB spectra if relevant photo-hadronic processes occur in an optically thin region that escapes further processing (Yang et al. 2018).\n- High-energy pions will decay to produce high-energy neutrinos, which are easier to detect than low-energy neutrinos (Valera et al. 2022). Future neutrino detections connected with GRBs will provide a telltale signature of the proposed hadronic interactions and therefore provide a multimessenger signal for constraining heavy element formation.\n\n# 9. CONCLUSION\n\nWe have estimated the production of protons and neutrons via photo-hadronic interactions from a large flux of high-energy photons. The production of neutrons via the process, γ + p → π+ + n, is pertinent to the astrophysical origin of the heavy elements. Rather relying on pre-existing neutrons this physical mechanism produces neutrons rapidly and in situ. For this process to be relevant for nucleosynthesis, baryonic material must be present surrounding an astrophysical jet and the jet must contain charged particles on a longer timescale than it does neutrons. These two conditions provide strict limits on viable locations in the universe.\n\nAs there is a wide range of GRBs, from short to long, one can naturally postulate that there will also be a range of resultant nucleosynthesis processes that can be associated with these jets. Long GRBs are of particular interest as they plow through a mass of dense stellar material for extended durations allowing ample time for photo-hadronic processes to prevail.\n\n# Mumpower et al.\n\nWe have explored a few interesting cases of neutron-rich nucleosynthesis in this work. Based on the initial population of protons or He in the stellar envelope, we believe that the cocoon is a promising region for neutron-rich nucleosynthesis. We have considered that nucleosynthesis in this region is capable of creating a complete rapid neutron capture (r-process) pattern as well as producing conditions viable for slower neutron capture, akin to the intermediate capture process (i-process). The final abundance patterns that arise from these two cases are drastically different and warrant further investigation.\n\nMulti-scale, multi-physics modeling is required to accurately model astrophysical transients. Our work reinforces this perspective and provides a new incentive to add medium/high energy phenomenon to the modeling of these complex and interesting environments.\n\n# APPENDIX: ANL-OSAKA MODEL OF HADRONIC SPECTRA\n\nThe ANL-Osaka model generates the differential cross sections in the center of mass (CM) frame of the initial γN and the final πN states. In this notation, N represents a nucleon (proton or neutron) and π represents a charged or neutral pion. For the process γ(qc) + N (−qc) → π(kc) + N (−kc), the differential cross section is of the following form (omitting the spin and isospin indices):\n\ndσc(W, θc)(W) = (4π)²ρπN(W)ργN(W)| &lt; kc|TπN,γN(W, θc)|qc &gt; |²\n\ndΩc\n\nwhere θc is the scattering angle defined by cosθ = kˆc · ˆ, the amplitude &lt; kc|TπN,γN(W, θ)|qc &gt; is calculated from the multiple amplitudes EL±(W) and ML±(W) listed on the ANL-Osaka Website (Lee 2019), and the invariant mass W and the phase space factors are:\n\nW = |qc| + EN(qc) = Eπ(kc) + EN(kc),\n\nρπN(W) = π |kc|Eπ(kc)EN(kc),\n\nργN(W) = π |qc|²|EN(qc).\n\nHere the energy is Ea(p) = pp² + ma for a particle a with mass ma and momentum p.\n\nIn the Laboratory (Lab) frame, the initial nucleon has momentum pt and the scattering angles for the outgoing pion momentum k and the nucleon momentum p are defined by the energy and momentum conservations:\n\n|q| + EN(pt) = Eπ(k) + EN(p),\n\nq + pT = p + k.\n\nThe differential cross section in this Laboratory frame can be calculated from the CM differential cross section Eq. (52) by finding the invariant mass W of the initial γN system:\n\nW = [(|q| + EN(pT))² − (q + pT)²]¹/².\n\nand by using the following transformation:\n\ndσL(W, θk) = | ∂Ωk / ∂Ωc| dΩcdσc(W, θc),\n\nwhere θk is the scattering angle of the outgoing pion with respect to the incident photon momentum q. Alternatively, we can also define the differential cross section in terms of the scattering angle θp of the outgoing nucleon momentum p:\n\ndσL(W, θp) = | ∂Ωp / ∂Ωc| dΩcdσc(W, θc).\n\nIn Eqs. (59) and (60) the angles θk and θp are not independent because of the energy and momentum conservation conditions Eqs. (56)-(57). They are determined by the Lab momenta k (p) which can be calculated from the CM momentum kc (−kc) by using the Lorentz Boost transformation:\n\nk = B⁻¹(β)[+kc],\n\np = B⁻¹(β)[−kc].\n\n# Let there be neutrons!\n\nwhere ⃗β is the velocity of the initial γN system:\n\n⃗β =|q| + EN (pT ) .q + pT\n\nBy considering the Lorentz invariant condition and assuming that photons are in Z-direction, we then have\n\n(q − k)² = (qc − kc)²,\n\nwhich leads to\n\n|q|EN (k) − |q||k|cosθk = |qc|EN (c) − |qc||kc|cosθc,\n\nand hence\n\n| ∂Ωk∂Ωc| = qc||kc| ,|q||k|\n\nfor calculating the differential cross sections using Eq. (59) Similarly, we have\n\n| ∂Ωp∂Ωc| = qc||kc| ,|q||p|\n\nfor calculating the differential cross sections using Eq. (60).\n\nFor a range of photon energies we are interested in, we can use the ANL-Osaka model to generate dΩk dσL(W, θk) (dσL(W, θp)) in a range of W. We then can get pion (nucleon) spectrum for each θk (θp) as a function of pion (nucleon) momentum k (p). Another information crucial to this problem is the outgoing particle spectrum in scattering angles θk or θp for a given incoming photon momentum q.\n\nIt will be complicated to use the spectra generated from the above procedures. As a start, we may just need to see the spectrum of the total pions (nucleons) with an averaged pion momentum k (p) defined by\n\nk² = R k² dΩc R dσc(W, θc)dΩcdσc(W, θc)dΩc,\n\np² = R pdΩc R dσc(W, θc)dΩc² dσc(W, θc)dΩcdΩc,\n\nwhere k (p) can be calculated from the CM momentum kc (−kc) by using Eqs. (61)-(62).\n\nAs a start, we perform calculations for the case that the initial nucleon in the Lab frame is at rest with pT = 0. The calculated total cross sections from threshold to about 1500 MeV of the photon momentum q are shown in Fig. 3. The outgoing spectra corresponding to the averaged momenta are shown for the four cross sections of interest in Figure 8.\n\n# ACKNOWLEDGEMENTS\n\nM. R. M. thanks Yong Zhao at Argonne National Laboratory for the introduction to H. Lee. M. R. M. thanks T. M. Sprouse for valuable discussions. M. R. M. acknowledges support from the Directed Asymmetric Network Graphs for Research (DANGR) initiative at Los Alamos National Laboratory (LANL). LANL is operated by Triad National Security, LLC, for the National Nuclear Security Administration of U.S. Department of Energy (Contract No. 89233218CNA000001). T.-S. H. Lee is supported by the Office of Science of the U.S. Department of Energy under Contract No. DE-AC02-05CH1123. N.L-R. acknowledges support from the Laboratory Directed Research and Development program of LANL project numbers 20230115ER and 20230217ER. B. L. B. acknowledges support from the Advanced Simulation and Computing Program of LANL as a Metropolis Postdoc Fellow.\n\n# REFERENCES\n\nAbbott, B. P., Abbott, R., Abbott, T. D., et al. 2017, Physical Review Letters, 119, 161101, doi: 10.1103/PhysRevLett.119.161101\n\nAhlgren, B., Larsson, J., Valan, V., et al. 2019, ApJ, 880, 76, doi: 10.3847/1538-4357/ab271b\n\n# Figure 8\n\n(upper left) Averaged spectra associated with the γ + p → π+ + n cross section, process (2); (upper right) spectra associated with the γ + n → π− + p cross section, process (3); (bottom left) spectra associated with the γ + n → π0 + n cross section, process (4); (bottom right) spectra associated with the γ + p → π0 + p cross section, process (5).\n\n| |spectrum| |spectrum| | | | |\n|---|---|---|---|---|---|---|---|\n| |n spectrum| | |p spectrum| |n spectrum|p spectrum|\n|250|250|250|250|250|250| | |\n|200|200|200|200|200|200| | |\n|150|150|150|150|150|150| | |\n|100|100|100|100|100|100| | |\n|50|50|50|50|50|50| | |\n|0|0|0|0|0|0| | |\n|0|200|400|600|800|1000|1200| |\n\n# References\n\nAnand, S., Barnes, J., Yang, S., et al. 2024, ApJ, 962, 68, doi: 10.3847/1538-4357/ad11df\n\nBand, D., Matteson, J., Ford, L., et al. 1993, The Astrophysical Journal, 413, 281, doi: 10.1086/172995\n\nBarnes, J., Zhu, Y. L., Lund, K. A., et al. 2021, ApJ, 918, 44, doi: 10.3847/1538-4357/ac0aec\n\nBeloborodov, A. M. 2010, MNRAS, 407, 1033, doi: 10.1111/j.1365-2966.2010.16770.x\n\nBerezinskii, V. S., & Smirnov, A. I. 1975, Ap&SS, 32, 461, doi: 10.1007/BF00643157\n\nBethe, H. A., & Brown, G. E. 1995, Reviews of Modern Physics, 67, 545, doi: 10.1103/RevModPhys.67.545\n\nBlanchard, P. K., Villar, V. A., Chornock, R., et al. 2024, Nature Astronomy, 8, 774, doi: 10.1038/s41550-024-02237-4\n\nBlandford, R. D., & McKee, C. F. 1976, The Physics of Fluids, 19, 1130, doi: 10.1063/1.861619\n\nBlandford, R. D., & Znajek, R. L. 1977, MNRAS, 179, 433, doi: 10.1093/mnras/179.3.433\n\nCowan, J. J., Pfeiffer, B., Kratz, K., et al. 1999, The Astrophysical Journal, 521, 194–205, doi: 10.1086/307512\n\nChoplin, A., Siess, L., & Goriely, S. 2021, A&A, 648, A119, doi: 10.1051/0004-6361/202040170\n\nCˆot´e, B., Denissenkov, P., Herwig, F., et al. 2018, ApJ, 854, 105, doi: 10.3847/1538-4357/aaaae8\n\nColgate, S. A., & Petschek, A. G. 1980, in Texas Workshop on Type I Supernovae, ed. J. C. Wheeler, 42–52\n\nBurbidge, E. M., Burbidge, G. R., Fowler, W. A., & Hoyle, F. 1957, Rev. Mod. Phys., 29, 547, doi: 10.1103/RevModPhys.29.547\n\n# Let there be neutrons!\n\n19\n\nCurtis, S., Miller, J. M., Fröhlich, C., et al. 2023, ApJL, 945, L13, doi: 10.3847/2041-8213/acba16\n\nJiang, Y.-F. 2023, Galaxies, 11, 105, doi: 10.3390/galaxies11050105\n\nDe Colle, F., Kumar, P., & Hoeflich, P. 2022, Monthly Notices of the Royal Astronomical Society, 512, 3627, doi: 10.1093/mnras/stac742\n\nJuliá-Díaz, B., Lee, T.-S. H., Matsuyama, A., & Sato, T. 2007, Physical Review C, 76, doi: 10.1103/physrevc.76.065201\n\nDe Colle, F., Lu, W., Kumar, P., Ramirez-Ruiz, E., & Smoot, G. 2018, MNRAS, 478, 4553, doi: 10.1093/mnras/sty1282\n\nDenton, P. B., & Tamborra, I. 2018, The Astrophysical Journal, 855, 37, doi: 10.3847/1538-4357/aaab4a\n\nDuncan, R. C., & Thompson, C. 1992, ApJL, 392, L9, doi: 10.1086/186413\n\nFarouqi, K., Thielemann, F.-K., Rosswog, S., & Kratz, K.-L. 2022, A&A, 663, A70, doi: 10.1051/0004-6361/202141038\n\nFowler, W. A., & Hoyle, F. 2002, Annual Review of Astronomy and Astrophysics, 40, 191, doi: 10.1146/annurev.astro.40.060401.094141\n\nFreiburghaus, C., Rosswog, S., & Thielemann, F. K. 1999, ApJL, 525, L121, doi: 10.1086/312343\n\nFujimoto, S.-i., Hashimoto, M.-a., Kotake, K., & Yamada, S. 2007, ApJ, 656, 382, doi: 10.1086/509908\n\nFuller, J., & Ro, S. 2018, MNRAS, 476, 1853, doi: 10.1093/mnras/sty369\n\nGallino, R., Renda, F., Busso, M., et al. 1998, Astronomy & Astrophysics, 331, 368, doi: 10.1051/0004-6361:19981275\n\nGarcia-Recio, C., Nieves, J., & Vicente Vacas, M. J. 2019, Journal of Physics G: Nuclear and Particle Physics, 46, 075001, doi: 10.1088/1361-6471/aaf2d2\n\nGehrels, N., Ramirez-Ruiz, E., & Fox, D. B. 2009, ARA&A, 47, 567, doi: 10.1146/annurev.astro.46.060407.145147\n\nGinzburg, V. L., & Syrovatskii, S. I. 1964, The Origin of Cosmic Rays\n\nGottlieb, O., Lalakos, A., Bromberg, O., Liska, M., & Tchekhovskoy, A. 2022, MNRAS, 510, 4962, doi: 10.1093/mnras/stab3784\n\nHalevi, G., Wu, B., Mösta, P., et al. 2023, The Astrophysical Journal Letters, 944, L38, doi: 10.3847/2041-8213/acb702\n\nHarrison, R., & Kobayashi, S. 2013, ApJ, 772, 101, doi: 10.1088/0004-637X/772/2/101\n\nHerwig, F., Woodward, P. R., Lin, P.-H., Knox, M., & Fryer, C. 2014, ApJL, 792, L3, doi: 10.1088/2041-8205/792/1/L3\n\nHotokezaka, K., Beniamini, P., & Piran, T. 2018, International Journal of Modern Physics D, 27, 1842005, doi: 10.1142/S0218271818420051\n\nIzzo, L., de Ugarte Postigo, A., Maeda, K., et al. 2019, Nature, 565, 324, doi: 10.1038/s41586-018-0826-3\n\nMauerhan, J. C., Filippenko, A. V., Zheng, W., et al. 2018, MNRAS, 478, 5050, doi: 10.1093/mnras/sty1307\n\n# References\n\nMumpower et al.\n\nMesler, R. A., Whalen, D. J., Lloyd-Ronning, N. M., Fryer, C. L., & Pihlström, Y. M. 2012, ApJ, 757, 117, doi: 10.1088/0004-637X/757/2/117\n\nMészáros, P. 2006, Reports on Progress in Physics, 69, 2259, doi: 10.1088/0034-4885/69/8/R01\n\nMetzger, B. D. 2019, Living Reviews in Relativity, 23, doi: 10.1007/s41114-019-0024-0\n\nMetzger, B. D., Bauswein, A., Goriely, S., & Kasen, D. 2014, Monthly Notices of the Royal Astronomical Society, 446, 1115–1120, doi: 10.1093/mnras/stu2225\n\nMeyer, B. S. 1998, The Astrophysical Journal, 493, 414, doi: 10.1086/305960\n\nMiller, J. M., Sprouse, T. M., Fryer, C. L., et al. 2020, ApJ, 902, 66, doi: 10.3847/1538-4357/abb4e3\n\nMoriya, T. J., Yoon, S.-C., Gräfener, G., & Blinnikov, S. I. 2017, MNRAS, 469, L108, doi: 10.1093/mnrasl/slx056\n\nMorozova, V., Piro, A. L., & Valenti, S. 2018, ApJ, 858, 15, doi: 10.3847/1538-4357/aab9a6\n\nMorsony, B. J., Lazzati, D., & Begelman, M. C. 2010, ApJ, 723, 267, doi: 10.1088/0004-637X/723/1/267\n\nMücke, A., Rachen, J. P., Engel, R., Protheroe, R. J., & Stanev, T. 1999, PASA, 16, 160, doi: 10.1071/AS99160\n\nMumpower, M., Surman, R., McLaughlin, G., & Aprahamian, A. 2016, Progress in Particle and Nuclear Physics, 86, 86–126, doi: 10.1016/j.ppnp.2015.09.001\n\nMumpower, M. R., Sprouse, T. M., Miller, J. M., et al. 2024, ApJ, 970, 173, doi: 10.3847/1538-4357/ad5afc\n\nMurase, K., & Ioka, K. 2013, Physical Review Letters, 111, doi: 10.1103/physrevlett.111.121102\n\nMurase, K., Kashiyama, K., & Mészáros, P. 2013, Physical Review Letters, 111, doi: 10.1103/physrevlett.111.131102\n\nMészáros, P., & Waxman, E. 2001, Physical Review Letters, 87, doi: 10.1103/physrevlett.87.171102\n\nNakamura, S. X., Kamano, H., Lee, T. S. H., & Sato, T. 2018, Nuclear applications of ANL-Osaka amplitudes: pion photo-productions on deuteron. https://arxiv.org/abs/1804.04757\n\nNakamura, T., Sato, T., & Lee, T.-S. H. 2020, Physical Review Letters, 124, 032001, doi: 10.1103/PhysRevLett.124.032001\n\nNakar, E., & Piran, T. 2017, ApJ, 834, 28, doi: 10.3847/1538-4357/834/1/28\n\nOppenheimer, J. R., & Volkoff, G. M. 1939, Physical Review, 55, 374, doi: 10.1103/PhysRev.55.374\n\nOset, E., & Ramos, A. 2021, Nuclear Physics A, 1016, 121509, doi: 10.1016/j.nuclphysa.2021.121509\n\nParticle Data Group, Workman, R. L., Burkert, V. D., et al. 2022, Progress of Theoretical and Experimental Physics, 2022, 083C01, doi: 10.1093/ptep/ptac097\n\nPiran, T. 1999, Physics Reports, 314, 575, doi: https://doi.org/10.1016/S0370-1573(98)00127-6\n\nPiran, T. 2004, Reviews of Modern Physics, 76, 1143, doi: 10.1103/RevModPhys.76.1143\n\nPiran, T. 2005, in American Institute of Physics Conference Series, Vol. 784, Magnetic Fields in the Universe: From Laboratory and Stars to Primordial Structures., ed. E. M. de Gouveia dal Pino, G. Lugones, & A. Lazarian (AIP), 164–174, doi: 10.1063/1.2077181\n\nRamirez-Ruiz, E., Celotti, A., & Rees, M. J. 2002, MNRAS, 337, 1349, doi: 10.1046/j.1365-8711.2002.05995.x\n\nRoederer, I. U., Vassh, N., Holmbeck, E. M., et al. 2023, Science, 382, 1177, doi: 10.1126/science.adf1341\n\nRosswog, S., Sollerman, J., Feindt, U., et al. 2018, A&A, 615, A132, doi: 10.1051/0004-6361/201732117\n\nSakari, C. M., Placco, V. M., Farrell, E. M., et al. 2018, ApJ, 868, 110, doi: 10.3847/1538-4357/aae9df\n\nSalafia, O. S., Barbieri, C., Ascenzi, S., & Toffano, M. 2020, A&A, 636, A105, doi: 10.1051/0004-6361/201936335\n\nSato, T., & Lee, T.-S. H. 1996, Phys. Rev. C, 54, 2660, doi: 10.1103/PhysRevC.54.2660\n\nSato, T., Shimizu, N., & Thomas, A. W. 2016, Progress in Particle and Nuclear Physics, 94, 1, doi: 10.1016/j.ppnp.2016.04.001\n\nSchatz, H., Aprahamian, A., Barnard, V., et al. 2001, Phys. Rev. Lett., 86, 3471, doi: 10.1103/PhysRevLett.86.3471\n\nSenno, N., Murase, K., & Mészáros, P. 2016, Physical Review D, 93, doi: 10.1103/physrevd.93.083003\n\nSerebrov, A., & Fomin, A. 2011, Physics Procedia, 17, 199, doi: https://doi.org/10.1016/j.phpro.2011.06.037\n\nShanahan, P., & Liu, Z. 2018, Physics Reports, 749, 1, doi: 10.1016/j.physrep.2018.02.002\n\nSiegel, D. M., Barnes, J., & Metzger, B. D. 2019, Nature, 569, 241, doi: 10.1038/s41586-019-1136-0\n\nSmith, N., & Owocki, S. P. 2006, ApJL, 645, L45, doi: 10.1086/506523\n\nSpitzer, Lyman, J. 1960, The Physics of Fluids, 3, 659, doi: 10.1063/1.1706104\n\nSprouse, T. M., Mumpower, M. R., & Surman, R. 2020, in European Physical Journal Web of Conferences, Vol. 242, European Physical Journal Web of Conferences, 04001, doi: 10.1051/epjconf/202024204001\n\nSprouse, T. M., Mumpower, M. R., & Surman, R. 2021, PhRvC, 104, 015803, doi: 10.1103/PhysRevC.104.015803\n\nSuzuki, A., & Maeda, K. 2022, ApJ, 925, 148, doi: 10.3847/1538-4357/ac3d8d\n\nSuzuki, N., Sato, T., & Lee, T.-S. H. 2010, Phys. Rev. C, 82, 045206, doi: 10.1103/PhysRevC.82.045206\n\n# Let there be neutrons!\n\n21\n\nTaub, A. H. 1948, Phys. Rev., 74, 328, doi: 10.1103/PhysRev.74.328\n\nWietfeldt, F. E., & Greene, G. L. 2011, Rev. Mod. Phys., 83, 1173, doi: 10.1103/RevModPhys.83.1173\n\nUsov, V. V. 1992, Nature, 357, 472, doi: 10.1038/357472a0\n\nWoosley, S. E. 1993, ApJ, 405, 273, doi: 10.1086/172359\n\nWoosley, S. E., & Heger, A. 2006, ApJ, 637, 914, doi: 10.1086/498500\n\nWoosley, S. E., Heger, A., & Weaver, T. A. 2002, Rev. Mod. Phys., 74, 1015, doi: 10.1103/RevModPhys.74.1015\n\nValera, V. B., Bustamante, M., & Glaser, C. 2022, Journal of High Energy Physics, 2022, doi: 10.1007/jhep06(2022)105\n\nVassh, N., Wang, X., Larivi`ere, M., et al. 2024, PhRvL, 132, 052701, doi: 10.1103/PhysRevLett.132.052701\n\nVurm, I., Beloborodov, A. M., & Poutanen, J. 2011, ApJ, 738, 77, doi: 10.1088/0004-637X/738/1/77\n\nWanajo, S. 2007, The Astrophysical Journal, 666, L77–L80, doi: 10.1086/521724\n\nZhang, B., & M´esz´aros, P. 2004, International Journal of Modern Physics A, 19, 2385, doi: 10.1142/S0217751X0401746X\n\nZhang, B., & Yan, H. 2011, ApJ, 726, 90, doi: 10.1088/0004-637X/726/2/90\n\nWang, X., N3AS Collaboration, Vassh, N., et al. 2020, ApJL, 903, L3, doi: 10.3847/2041-8213/abbe18\n\nWaxman, E., & Bahcall, J. 1998, Physical Review D, 59, doi: 10.1103/physrevd.59.023002\n\nZhu, Y., Wollaeger, R. T., Vassh, N., et al. 2018, ApJL, 863, L23, doi: 10.3847/2041-8213/aad5de\n\nZhu, Y. L., Lund, K. A., Barnes, J., et al. 2021, ApJ, 906, 94, doi: 10.3847/1538-4357/abc69e",
        "summary": "**Summary of \"Let there be neutrons! Hadronic photoproduction from a large flux of high-energy photons\"**\n\n**1. Main objective and motivation:**\n\nThe paper investigates a potential mechanism for neutron production in high-energy, high-flux photon environments, specifically within the context of long gamma-ray bursts (lGRBs) associated with collapsars.  The authors aim to determine if this process, known as hadronic photoproduction, can create sufficient neutrons to fuel r-process nucleosynthesis, the formation of heavy elements, within the GRB jet, cocoon, and surrounding stellar material.  They acknowledge that while neutron-rich environments are known to exist in neutron star mergers, lGRBs lack a similarly well-established neutron production route.\n\n**2. Key methods and approaches:**\n\nThe paper combines theoretical modeling with existing observational data and results.  The authors:\n\n* **Model the GRB jet's photon flux:** They employ a piecewise power-law function to model the high-energy photon spectrum of the jet, drawing on phenomenological fits to observed GRB spectra.  They also consider contributions from inverse Compton scattering of cocoon photons.\n* **Calculate hadronic photoproduction cross-sections:**  They utilize the ANL-Osaka model to predict the cross-sections for neutron and proton production reactions induced by high-energy photons impacting protons and neutrons.  This enables calculation of the rate of neutron production.\n* **Analyze the dynamics of the jet-envelope interaction:**  They use relativistic hydrodynamics to estimate the density of material in the jet head region and the cocoon as the jet interacts with the surrounding stellar material.  This is crucial for understanding the conditions for neutron escape and nucleosynthesis.\n* **Simulate nucleosynthesis:** They employ the PRISM reaction network to simulate the outcome of nucleosynthesis in the cocoon region, considering various scenarios for the electron fraction (Ye) and mixing of material.\n* **Evaluate other possible astrophysical sites:** They extend the discussion to explore other environments with jets and high-energy photon fluxes (e.g., active galactic nuclei) where the proposed mechanism might apply, establishing the conditions for its viability.\n\n**3. Principal findings and results:**\n\nThe authors find that hadronic photoproduction within the jet head region of lGRBs can efficiently generate neutrons, enabling neutron-rich nucleosynthesis in the cocoon.  Key results include:\n\n* **Neutron production rate:** They establish that the neutron production rate is significantly influenced by the photon flux and proton density in the jet head.\n* **Neutron escape:**  The analysis suggests that neutrons can effectively escape the jet head region into the cocoon, where conditions are suitable for nucleosynthesis. This escape is facilitated by the relativistic dynamics of the jet and is hindered by magnetic confinement.\n* **Nucleosynthesis scenarios:** Simulations reveal that different mixing efficiencies and electron fractions within the cocoon lead to a range of possible nucleosynthesis outcomes.  Some cases produce an r-process pattern mirroring solar system residuals, while others might produce an i-process or even a proton-rich outcome, depending on the specific conditions.\n* **Possible observational signatures:**  The authors discuss potential observational evidence that might support the hadronic photoproduction mechanism, including the detection of specific kilonova characteristics (red component), gamma-ray lines, and/or high-energy neutrino emission, if the conditions for such emission are favorable.\n\n**4. Significance and implications:**\n\nThe paper proposes a new mechanism for heavy element nucleosynthesis in lGRBs, suggesting a possible pathway for the production of the r-process elements that has not been previously investigated.  The implications are potentially far-reaching:\n\n* **Alternative r-process pathway:** This mechanism provides an alternative route to r-process nucleosynthesis in lGRBs, potentially offering a broader explanation for the observed abundance patterns.\n* **Constraints on GRB jets:**  The analysis highlights the importance of considering hadronic interactions in models of GRB jets and the surrounding environment.\n* **Multi-messenger astrophysics:** The potential detection of associated neutrino emissions and kilonova characteristics would provide a multi-messenger approach to understanding the physical processes involved in lGRB nucleosynthesis.\n* **Motivation for future research:** The work emphasizes the need for more detailed modeling that incorporates multi-physics (e.g., magnetohydrodynamics and relativistic hydrodynamics) to further refine estimates of neutron production and nucleosynthesis outcomes.  The paper also underscores the necessity for multi-scale modeling and broader investigations into other astrophysical transient events.\n",
        "insights": "This paper proposes that high-energy photon interactions within astrophysical jets, particularly in the cocoon surrounding long gamma-ray burst jets, can generate sufficient neutrons for rapid neutron capture nucleosynthesis (r-process) of heavy elements.\n\n**Key Insights and Lessons Learned:**\n\n* **Neutron production in situ:** High-energy photons from GRB jets can efficiently produce neutrons directly within the jet and surrounding stellar material, unlike traditional neutron sources relying on pre-existing neutrons.\n* **Cocoons as nucleosynthesis sites:** The cocoon region surrounding the jet, though previously largely unexplored, is shown to be a promising site for neutron-rich nucleosynthesis due to its higher baryon density compared to the jet itself.\n* **Dynamical importance:** The relativistic jet interacts dynamically with the surrounding stellar material, creating conditions conducive to neutron production and nucleosynthesis, including efficient neutron escape from the jet head.\n* **Electron fraction control:** The efficiency of neutron escape from the jet head strongly influences the initial electron fraction (Ye) in the cocoon, a critical parameter for the resulting nucleosynthesis pathway.\n* **Parameter dependence:** The likelihood and outcome of nucleosynthesis depend sensitively on various parameters, such as jet Lorentz factor, surrounding density, photon flux, and mixing processes.\n* **Potential Observational Signatures:**  The paper suggests several potential observational signatures, like kilonovae with extended red afterglows, γ-ray lines from nuclear transitions, and fission signatures, which could be used to identify this neutron production mechanism.\n\n**Questions for the Authors:**\n\n1. What are the uncertainties associated with the cross-section calculations for hadronic photoproduction processes, especially those involving neutron targets?\n2. How robust are the conclusions regarding cocoon nucleosynthesis to variations in the assumed jet parameters (e.g., Lorentz factor, opening angle, baryon loading) and surrounding material properties?\n3. Could you elaborate on the interplay between the assumed mixing efficiency (ϵ) and the final nucleosynthesis outcomes?  How would varying this parameter affect the predicted abundances?\n4. What is the impact of the magnetic field on the escape of neutrons from the jet head? How do the magnetic field strengths and configurations affect the results?\n5. What are the next steps in terms of computational modeling to investigate the complex multi-physics problem of GRB nucleosynthesis?\n\n\n**Suggestions for Related Topics/Future Research:**\n\n1. **Detailed modeling of the cocoon environment:**  Investigate the three-dimensional hydrodynamics and magnetohydrodynamics of the cocoon, incorporating the effect of the jet's interaction with the environment and exploring different mixing scenarios.\n2. **Influence of magnetic fields:** Explore the role of magnetic fields in more detail, considering their impact on particle confinement and the transport of neutrons in the jet and cocoon.\n3. **Non-equilibrium effects:** Examine the impact of non-equilibrium processes in the photo-hadronic interactions on the resulting neutron production and nucleosynthesis.\n4. **Comparison to other r-process sites:**  Investigate the relative efficiency of neutron production in GRBs compared to other proposed r-process sites, like neutron star mergers.\n5. **Observational constraints and tests:** Propose specific observational campaigns to test the predictions made by this paper, including strategies for identifying the predicted observational signatures.\n\n**Relevant References:**\n\n1. **Burbidge et al. (1957):**  A seminal paper on the concept of nucleosynthesis, providing context for the work presented in the current paper.\n2. **Woosley (1993):**  A significant work on the collapsar model of long GRBs, offering the theoretical framework for the study.\n3. **Piran (2004):**  An authoritative review on gamma-ray bursts, providing a fundamental overview of the phenomena relevant to this research.\n4. **Lattimer & Schramm (1974):**  Pioneering research on the r-process nucleosynthesis in neutron star mergers, establishing the link between neutron-rich environments and heavy element production.\n5. **Metzger et al. (2014):**  A relevant article exploring neutron-rich nucleosynthesis in astrophysical events.\n\n\n"
    }
}